[{"name": "Laravel Developer", "company": "Doublard Design Pvt. Ltd", "vacancy": "2", "time": "Information Technology", "address": "Senior Level", "deadline": "B.E. in Computer Science,Bachelors in Computer Science", "education": "Contract", "experience": "Full Time", "desct": "Laravel DeveloperJob posted on 02 Nov, 2020Apply before 30 Nov, 2020Doublard Design Pvt. LtdDetailed Job description / requirements:﻿High IQ? Looking for work that will challenge you?High IQ Experienced Laravel Framework Developers RequiredExperience:Minimum 2 years of Laravel developmentSkills required:Laravel Framework / PHPSalary:Starting at 30000 (post probation 3 months) – however if you are highly skilled and intelligent we will happily compensate you appropriately.It is in your favour if you have experience of:CMS development, Inventory Management Systems, ERP Software, Vue.js and hands on experience with SQL schema design, SOLID principles, REST API design, MySQL profiling and query optimization.Language:Strong command of English.Location:WFH - Remote Work – Main office is located Bansbari, Kathmandu.Please send an email showing your interest along with your CV tocareers@doublarddesign.comPlease note that as part of the interview process, if selected we will expect you to demonstrate your skill level over the course of a day as unpaid. Please ensure that you are happy to do this before applying.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/laravel-developer-118667"}, {"name": "Senior System Engineer", "company": "LIS Nepal Pvt. Ltd. (Sister Concern of Yomari Group of Companies)", "vacancy": "1", "time": "Full Time", "address": "Please check vacancy details", "deadline": "30 Oct, 2020", "education": "Please check vacancy details.", "experience": "Senior Level", "desct": "Senior System EngineerJob posted on 30 Oct, 2020Apply before 29 Nov, 2020LIS Nepal Pvt. Ltd. (Sister Concern of Yomari Group of Companies)LIS Nepal Private Limited is a sister concern of Yomari Group of Companies. It is a privately held company established in 21 July, 2014, with the same proprietor of Yomari. \r\nLIS Nepal specializes in a broad range of data integration, data warehousing and business intelligence solutions, with a special focus on retail industry. It is also one of the development centers for Logic Information Systems, Inc. (http://www.logicinfo.com ). Moreover, LIS Nepal also focuses on providing ICT related services to Nepal's domestic market. Its services include software development, infrastructure services, system integration, project implementation and representing foreign ICT companies in Nepal.\r\nCurrently, LIS team size comprises of 100+ team members working closely with Development, HR, Operations, Infra and Finance team. \r\nAt LIS, we are committed to understand the unique technological needs of our clients and providing them the best solutions. We have all it takes to succeed: a team of experienced IT professionals with the character and competence to do the job right.Detailed Job description / requirements:﻿﻿﻿﻿﻿﻿﻿﻿﻿We are looking for self-driven, motivated and result\noriented professional to be part of our dynamic team as “Senior System\nEngineer”. Details of the same have been highlighted below;Job Description:Handle network technologies with multi\nvendor’s environment (routers, firewalls, switches, etc.)Tune network performance by analyzing different network parameters,\nscheduling upgrades and focus on network optimizations.Develop\nnetwork infrastructures and system implementation solutions and make\nrecommendations on systems enhancements for optimization.Perform network assessments and security testing.Develop automation tools and processes to help scale operations.Perform server data backup, data migration and disaster recovery operations.Coordinate\nwith software developers and system analysts to design effective solutions that\nmeet requirements for functionality and integration with existing components.Research, develop,\nand implement new technologies and practices.Documentation\nand Reporting of assigned task to supervisor.Lead,\nsupervise and train other technical teams.Communication\nwith customers as required; keeping them informed of incident progress,\nnotifying them of impending changes or agreed outages.Job Specification:Bachelor degree, with a technical\nmajor, such as engineering, computer science or similar relevant field.Minimum 3 years’ experience in area of\nnetwork and system administration.Strong communications skills- both\nverbal and written.Team player, self-driven attitude and\nprovide effective solutions.Experience in\nadministering windows/Linux systems and Virtualization (VMware and Citrix).Experience with\nLinux, Unix, DNS, LDAP/AD as well as Linux shell/PowerShell scripting/MySQL is\na plus.Able to effectively manage multiple\nsimultaneous projects.Familiarization with public cloud\nservice like Amazon Web Service and Microsoft Azure.Familiarization with DevOps tools\n(Ansible/Jenkins).Have known knowledge on effective\ncyber security tools.RHCE/Network Security Certification\nwould be an added advantage.Interested candidates\nare requested to send in their cover letter and resume clarifying their work\nexperience and expected salary tohrd@lisnepal.com.npby 30th November 2020.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/senior-system-engineer-118664"}, {"name": "GoLang Engineer", "company": "BerryBytes", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "28 Nov, 2020", "education": "Bachelors in Computer Science", "experience": "Please check vacancy details.", "desct": "GoLang EngineerJob posted on 29 Oct, 2020Apply before 28 Nov, 2020BerryBytesBerryBytes develop computer vision technologies using Machine Learning and AI and offers Cloud Native Application solutions.  We bring the perfect combination of talent and technology to help our customers overcome their most significant challenges.Detailed Job description / requirements:﻿﻿﻿﻿Why a Career with BerryBytesOur Culture:AtBerryBytes,we work in a collaborative and innovative work environment. We work with brilliant and passionate people who strive and encourage others to do their best. BerryBytes's idea-rich environment welcomes creative and sometimes unconventional perspectives!Growth Opportunities:You will have the opportunity to grow and make an impact from your work. We encourage innovation in all who become a part of our team. With growing operations internationally, there are lots of lateral and upward advancement opportunities for rewarding and developing careers with BerryBytes. We’re strong believers in continuing education and provide the resources that you need to continue learning.Employee Perks:We offer flexible hours, competitive PTO policy, incentive, bonus, health and wellness, and attractive compensation and benefit plans. We make it our obligation to the team here to stay current with compensation trends in the tech field.Please send your latest resume in PDF format at hr@berrybytes.comWe thank all applicants in advance for applying. Only individuals selected for interviews will be contacted.GoLang EngineerJob Description and ResponsibilitiesWe’re looking for an experienced Software Engineer with GoLang to join our team. Your core responsibilities will include:Responsible for the development and maintenance of key product featuresWork with other team members to investigate design approaches, prototype new technology, and evaluate technical feasibility.Will work in a fast-paced environment to deliver high-quality software against aggressive schedules.Prepare technical requirements and software design specificationsInstall and support systems used internally by developmentResponsible for helping to document the softwareEducation QualificationsMaster degree in Computer Science, Engineering, a related field or equivalent work experienceTechnical SkillsStrong in Go Concurrency.Knowledge Operating system internals.Knowledge of TCP/IP networking and common web technologies ‘Ability to work independently while managing multiple task assignments.Strong initiative, written, and verbal communication skills.Experience with any of the following technologies a plusSolid experience in Multi-threaded and Concurrent programmingTCP/IP socket programmingFamiliarity with GoLang leading opensource librariesStatic and dynamic analysis toolsWorking knowledge of encryption tools and technologiesNoSQL and Relational Databases experienceElastiSearch and RabbitMQ experience a plus.Nice to HaveExperience with Docker and Kubernetes a plus.Experience in CI/CD and DevOps processes.More details:This is a full-time position, with great career prospects as we grow.Hours: Flexible full-time working hoursCompensation: Based on experienceSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/golang-engineer-118650"}, {"name": "DATA ANALYST", "company": "GrowByData Services Pvt. Ltd.", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "18 Nov, 2020", "education": "Bachelors in Computer Science", "experience": "1+ years", "desct": "DATA ANALYSTJob posted on 19 Oct, 2020Apply before 18 Nov, 2020GrowByData Services Pvt. Ltd.GrowByData was founded by powerhouses in big data analytics and SaaS, who have leveraged the power of global operations for decades. We help early-to-growth-stage companies use data to improve margins, delight customers, and accelerate revenue growth.Detailed Job description / requirements:Are you interested in having your products be used by 1000s of brands globally? Does building a global brand excite you? Does having your solutions be used by the world’s top brand get you up from bed? GrowByData is on a mission to expand its distribution to the world’s retailers and is seeking energetic, creative, and self-driven individuals to join the challenge. We are looking for motivated, and talented individual to join us as Data Analyst to deliver our enterprise platform! If the challenge excites you, please apply with your CV, your work sample and 3 reasons why this excited you. Feel free to send your work samples from the industry or otherwise to prove yourself. Emailinquiries@growbydata.comto be considered immediatelyTITLE: DATA ANALYSTRESPONSIBILITIESAcquire data from primary or secondary data sources and maintain data systems including writing scripts, web scraping.Should gather and process both structured and unstructured data in a way that is useful for analysis.Identify, analyze, and interpret trends or patterns in complex data setsShould provide data support and write SQL queries, and create reports in collaboration with software developers.Locate and define new process improvement opportunities.Deliver to and communicate with team members and client on/offshore effectively, regularly, and professionallyREQUIREMENTSExperience in data analysisStrong analytical and logical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyExperience in MS SQL writing queriesExperience in PythonKnowledge of eCommerce platforms and marketplaces will be an added valueAdept at report writing and presenting findingsExcellent communication and personal interaction skillsPassionate about learning and self-motivated; drive to contribute ideas and share knowledge proactively; must be a team player.EDUCATION:Bachelor in Computer Engineering / Sciences or equivalent.EXPERIENCE:1 year of prior working experience in a relevant field would be preferred and favorable.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/data-analyst-118615"}, {"name": "Web Designer", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "1", "time": "Information Technology", "address": "Web Design", "deadline": "16 Oct, 2020", "education": "Web Development", "experience": "Full Time", "desct": "Web DesignerJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿﻿﻿What you will doCreate clean, user-friendly, and visually appealing design.Convert non-functional UI mockups into responsive cross-browser compatible web pages.Communicate with business to gather requirements, express ideas and collaborate throughout the processes.Must Have:At Least 2+ years experience in the UI/UX field or similar.In-depth knowledge of design fundamentals and processesProficient in Adobe Suite, FigmaProficient in HTML, CSS, SASS & Javascript.Ability to work both independently and in a collaboration with the development & marketing team.How to apply: Interested candidates can submit their CV/RESUME at business@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/web-designer-118607"}, {"name": "Java/Angular Developers", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "2", "time": "Web Designing & Programming", "address": "Computer - Programming", "deadline": "16 Oct, 2020", "education": "Engineering - Software", "experience": "Full Time", "desct": "Java/Angular DevelopersJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿﻿What you’ll do:Analyze technical requirements, design applications, integrate solutionBuild self-contained, reusable and testable modules and components.Perform development in CSS, Angular 6+, and 3rd party libraries or frameworksPerform development in Java/Spring boot, web service, hibernate.Ensure the best possible performance, quality, and responsiveness of applicationsMust Haves:2+ years building high quality and secure application using Angular frameworkGood proficiency with CSS rule specificity, Typescript, JavascriptGood proficiency with Services, routing and security practicesGood proficiency with spring boot/java, web service, hibernateExperience with RESTful servicesProfessional, precise communication skillsHow to apply: Interested candidates can submit their CV/RESUME at business@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/java-angular-developers-118606"}, {"name": "PHP Laravel Developers", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "2", "time": "Web Designing & Programming", "address": "Web Development", "deadline": "16 Oct, 2020", "education": "Computer - Programming", "experience": "Full Time", "desct": "PHP Laravel DevelopersJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿What you must possess:A Minimum 2 Years+ experience in Object-Oriented PHP frameworksExcellent skill in Core PHP, LaravelKnowledge of WordPress is beneficialGood with everything PHP and MySQL.Awesome in JavaScript, jQueryProficiently use version control systemFast learner and troubleshooterTeam PlayerGood to have points:Experience in eCommerce DevelopmentUnderstanding of Common front end environments eg. BootstrapFramework agnostic debugging skillsUnderstanding of Responsive and Mobile DesignHow to apply: Interested candidates can submit their CV/RESUME atbusiness@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/php-laravel-developers-118604"}, {"name": "Senior PHP Developers", "company": "A.M. Nepal", "vacancy": "3", "time": "Full Time", "address": "Graduate (Bachelors)", "deadline": "Graduate (Bachelors)", "education": "4+ years", "experience": "Full Time", "desct": "Senior PHP DevelopersJob posted on 08 Oct, 2020Apply before 06 Nov, 2020A.M. NepalA.M Nepal is a full-service digital agency. We build brands and software that stand out online. Our work engages people to grow business.We have a fabulous list of international clients.Detailed Job description / requirements:﻿A.M. Nepalis an Australia based full-service digital agency in Kathmandu that has been redefining digital scape through its team of innovative and awe inspiring digital natives. We have an unmatched reputation in building international brands and software that stand out online and deliver businesses goals of our clients. It has been part of some of the best renowned Australian brands' online marketing successes and continues to deliver off-the-beat experience through its customized designing, development, and online marketing solutions and strategies. We believe that our success and confidence to lead the market emanates from the team. If you are looking for being part of a team for making a distinct digital print on the web and have the zeal to deliver, we have now openings for some awesome PHP Developers with the following attributes.What you must possess:A Minimum 3 Years+ experience in a digital agency environment with Object-Oriented PHP (No Amateurs please)Excellent skill inCore PHP, LaravelWillingness to work inJoomlaKnowledge ofWordpressis beneficialGood with everything PHP and MySQL.Awesome in Javascript, XML, JqueryFast learner and troubleshooterExcellent Communicator (English)What makes you more attractive:Experience in eCommerce DevelopmentKnowledge of DrupalUnderstanding of Common front end environments eg. BootstrapUnderstanding of Responsive and Mobile DesignGood CSS SkillsOur Offer Package:Salary that your skills deserve (No Ceiling for deserving candidates)Work 5 days a week - Chill out 2 days a weekSpecial Bonus packages (including insurance, lunch, snacks)Regular Parties and HangoutsSurprise PartiesAnnual ReviewsUnlimited growth for achieversFeel this is the dream team you want to be part of mail us now...... or visit our digital office on the web here (www.andmine.com) to know more about us.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/senior-php-developers-118542"}, {"name": "Sitecore/Sharepoint Developer", "company": "A.M. Nepal", "vacancy": "2", "time": "Full Time", "address": "1+ years", "deadline": "Graduate (Bachelors)", "education": "Mid Level", "experience": "Full Time", "desct": "Sitecore/Sharepoint DeveloperJob posted on 08 Oct, 2020Apply before 06 Nov, 2020A.M. NepalA.M Nepal is a full-service digital agency. We build brands and software that stand out online. Our work engages people to grow business.We have a fabulous list of international clients.Detailed Job description / requirements:﻿A.M. Nepalis an Australia based full-service digital agency in Kathmandu that has been redefining digital scape through its team of innovative and awe inspiring digital natives. We have a unmatched reputation in building international brands and software that stand out online and deliver businesses goals of our clients. It has been part of some of the best renowned Australian's brands' online marketing successes and continues to deliver off-the-beat experience through its customized designing, development, and online marketing solutions and strategies. We believe that our success and confidence to lead the market emanates from the team. If you are looking for being part of a team for making a distinct digital print on the web and have the zeal to to deliver, we have now openings for some awesomeSitecore/Sharepoint Developerwith the following attributes.What you must possess:Sitecore/Sharepointis one of the leading enterprise-level content management systems built on ASP.NET,enabling web content editors and marketers to have full control over all aspects of their website from social integration and blog posts to advanced personalization, e-commerce, and moreA Minimum 1 Year+ experience in Sitecore/SharepointExcellent in ASP.NETFast learner and troubleshooterExcellent Communicator (English)What Makes you more attractive:Awesome in Javascript, XML, JqueryExperience in eCommerce DevelopmentUnderstanding of Common front end environments eg. BootstrapUnderstanding of Responsive and Mobile DesignGood CSS SkillsOur Offer Package:Salary that your skills deserve (No Ceiling for deserving candidates)Work 5 days a week - Chill out 2 days a weekThe employee of Year - Special AwardRegular Parties and Hang outsSurprise PartiesAnnual ReviewsUnlimited growth for achieversAdditional financial bonuses awarded every 3 monthsFeel this is the dream team you want to be part of mail us now...... or visit our digital office on the web here(www.andmine.com)to know more about us.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/sitecore-sharepoint-developer-118541"}, {"name": "Senior Front-end Developer (Angular)", "company": "Concinnity Limited", "vacancy": "1", "time": "Information Technology", "address": "Part Time", "deadline": "B.E. in Computer Science,B. Tech.", "education": "Engineering - Software", "experience": "Part Time", "desct": "Senior Front-end Developer (Angular)Job posted on 07 Oct, 2020Apply before 06 Nov, 2020Concinnity LimitedWe, at Concinnity specialize in getting your website on the map with Search Engine Optimization, Targeted Advertising, Social Media Marketing and Conversion Optimization. We work with you to develop a plan that increases traffic and improves conversions, maximizing your profits. With offices in Hong Kong, Singapore & Germany - our team of experts have helped firms across continents achieve their goals with digital marketing.Detailed Job description / requirements:﻿﻿﻿Job DescriptionWe are looking for anAngular Developerresponsible for the client side of our service. Your primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. Your main duties will include creating modules and components and coupling them together into a functional app. The artistic design will be delivered to you, together with a few HTML templates, but we will ask for your help in regard to animations, CSS, and final HTML output. You will work in a team with the back-end developer, and communicate with the API using standard methods. A thorough understanding of all of the components of our platform and infrastructure is required.ResponsibilitiesDelivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building the RESTful APICommunicating with external web servicesSkills and Qualifications5+ years of experience with AngularBS degree in computer science or engineeringProficiency with JavaScript and HTML5Professional, precise communication skillsDeep knowledge of Angular practices and commonly used modules based on extensive work experienceCreating self-contained, reusable, and testable modules and componentsEnsuring a clear dependency chain, in regard to the app logic as well as the file systemAbility to provide SEO solutions for single page appsExtensive knowledge of CSS and JS methods for providing performant visual effects.Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the systemValidating user actions on the client side and providing responsive feedbackWriting non-blocking code, and resorting to advanced techniques such as multi-threading, when neededCreating custom, general use modules and components which extend the elements and modules of core AngularExperience with all levels of operation available to the front-end, such as from creating XHRs in vanilla JS to using a custom wrapper around $resourceExperience with building the infrastructure for serving the front-end app and assetsArchitecting and automating the build process for production, using task runners or scriptsDocumenting the code inline using JSDoc or other conventionsWriting extensive unit tests using automated TDD tasksCreating e2e test suites for all components, and running them with Protractor (or a well reasoned alternative)Creating configuration, build, and test scripts for Continuous Integration environmentsSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/senior-front-end-developer-angular-118530"}, {"name": "Senior Node JS Backend developer", "company": "Concinnity Limited", "vacancy": "1", "time": "Engineering - Computer", "address": "Computer - Programming", "deadline": "Bachelors in Computer Science", "education": "Development and Project", "experience": "Part Time", "desct": "Senior Node JS Backend developerJob posted on 07 Oct, 2020Apply before 06 Nov, 2020Concinnity LimitedWe, at Concinnity specialize in getting your website on the map with Search Engine Optimization, Targeted Advertising, Social Media Marketing and Conversion Optimization. We work with you to develop a plan that increases traffic and improves conversions, maximizing your profits. With offices in Hong Kong, Singapore & Germany - our team of experts have helped firms across continents achieve their goals with digital marketing.Detailed Job description / requirements:﻿﻿﻿﻿Job DescriptionWe are looking for aNode.js Developerresponsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition, and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.ResponsibilitiesIntegration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsImplementation of security and data protectionIntegration of data storage solutionsSkills And Qualifications5+ years of experience with Node.JSBS in computer science or engineeringStrong proficiency with JavaScriptFamiliar with AWS productsExperience with docker is a must. Knowledge of kubernetes is highly appreciated.Knowledge of Node.js and frameworks available such as Express, StrongLoopUnderstanding the nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages such as Jade, EJSGood understanding of server-side CSS preprocessors such as Stylus, LessBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/senior-node-js-backend-developer-118529"}]