[{"name": "﻿Sr. Software Engineer – Node JS", "company": "Cloudyfox Technology Pvt.Ltd.", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "deadline": "10 Dec, 2020", "education": "Graduate (Bachelors)", "experience": "3+ years", "level": "Senior Level", "salary": "", "desct": "﻿Sr. Software Engineer – Node JSJob posted on 11 Nov, 2020Apply before 10 Dec, 2020Cloudyfox Technology Pvt.Ltd.Our amazingly beautiful Software Studio in Kathmandu is a fusion of our culture, discipline & innovation. Our agile team and creative minds fuse with “caffeine” to give excellent UI design & UX for rich products. We provide a complete ecosystem by building a brand, developing a product, deploy to the cloud and ensure the infrastructure. We do all, not a single penny less required for a business to be digital. Yes, we mean “digital”.Detailed Job description / requirements:﻿Sr. Software Engineer – Node JSBasic Job InformationJob Category:IT & TelecommunicationJob Location:Anamnagar, KathmanduOffered Salary:NegotiableJob SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:  Css3 Html5 Node.Js TypescriptOther SpecificationSkills and Qualifications:Strong proficiency with JavaScriptType ScriptVery good Knowledge of Node.js & ExpressThe nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages eg JadeGood understanding of server-side CSS preprocessorsBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitWe follow TDD so testing should be a easy thing for youWe love AWS so expertise on Lambdas, ECS , DynamoDB will be an added advantageExperience with GraphQL would be added advantageJob DescriptionWe are looking for a Node.js Developer to join our awesome team. Your primary focus will be building, documenting, shipping & maintaining apis. Also you will help other engineers & coding ninjas with feedbacks, reviews etc.Responsibilities:Follow api first design and build robust apis for microservicesWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applications, servicesImplementation of security and data protectionIntegration with databases preferably NoSQL - DynamoDBWork in team, is very important, you not only grow yourself, but you grow togetherYou should be flexible & openYou should do sometime peer programming & code reviewsSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/sr-software-engineer-node-js-118735"}, {"name": "﻿Sr. iOS Developer – Swift", "company": "Cloudyfox Technology Pvt.Ltd.", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "deadline": "10 Dec, 2020", "education": "Graduate (Bachelors)", "experience": "3+ years", "level": "Senior Level", "salary": "", "desct": "﻿Sr. iOS Developer – SwiftJob posted on 11 Nov, 2020Apply before 10 Dec, 2020Cloudyfox Technology Pvt.Ltd.Our amazingly beautiful Software Studio in Kathmandu is a fusion of our culture, discipline & innovation. Our agile team and creative minds fuse with “caffeine” to give excellent UI design & UX for rich products. We provide a complete ecosystem by building a brand, developing a product, deploy to the cloud and ensure the infrastructure. We do all, not a single penny less required for a business to be digital. Yes, we mean “digital”.Detailed Job description / requirements:﻿﻿Sr. iOS Developer – SwiftBasic Job InformationJob Category:IT & TelecommunicationJob Location:Anamnagar, KathmanduOffered Salary:NegotiableJob SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Git Tdd Restful Apis Ui/UxOther SpecificationSkillsProficient with Objective-C or Swift, and Cocoa TouchExperience with iOS frameworks such as Core Data, Core Animation, etc.Experience with offline storage, threading, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apple’s design principles and interface guidelinesKnowledge of low-level C-based libraries is preferredExperience with performance and memory tuning with tools such as InstrumentsFamiliarity with cloud message APIs and push notificationsKnack for benchmarking and optimizationProficient understanding of GitTDDFamiliarity with continuous integrationJob DescriptionWe are looking for an iOS developer who will be responsible for developing applications for mobile devices powered by Apple’s iOS operating system. Your primary focus will be development of iOS applications and their integration with back-end services. You should be proficient with one of the two programming languages for this platform: Objective-C or Swift.You must also have a strong understanding of the patterns and practices that revolve around the iOS platform. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.ResponsibilitiesDesign and build applications for the iOS platformWriting scalable, robust, testable, efficient, and easily maintainable codeEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/sr-ios-developer-swift-118734"}, {"name": "Sr. Android Developer – Kotlin", "company": "Cloudyfox Technology Pvt.Ltd.", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "deadline": "10 Dec, 2020", "education": "Graduate (Bachelors)", "experience": "3+ years", "level": "Senior Level", "salary": "", "desct": "Sr. Android Developer – KotlinJob posted on 11 Nov, 2020Apply before 10 Dec, 2020Cloudyfox Technology Pvt.Ltd.Our amazingly beautiful Software Studio in Kathmandu is a fusion of our culture, discipline & innovation. Our agile team and creative minds fuse with “caffeine” to give excellent UI design & UX for rich products. We provide a complete ecosystem by building a brand, developing a product, deploy to the cloud and ensure the infrastructure. We do all, not a single penny less required for a business to be digital. Yes, we mean “digital”.Detailed Job description / requirements:﻿Sr. Android Developer – KotlinBasic Job InformationJob Category:IT & TelecommunicationJob Location:Anamnagar, KathmanduOffered Salary:NegotiableJob SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Git Tdd Restful ApisOther SpecificationSkillsProficient with Java or Kotlin, and Android StudioStrong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizesFamiliarity with RESTful APIs to connect Android applications to back-end servicesStrong knowledge of Android UI design principles, patterns, and best practicesExperience with offline storage, threading, and performance tuningAbility to design applications around natural user interfaces, such as “touch”Familiarity with the use of additional sensors, such as gyroscopes and accelerometersKnowledge of the open-source Android ecosystem and the libraries available for common tasksAbility to understand business requirements and translate them into technical requirementsFamiliarity with cloud message APIs and push notificationsA knack for benchmarking and optimizationUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of GitTDDFamiliarity with continuous integrationJob DescriptionWe are looking for an iOS developer who will be responsible for developing applications for devices powered by the Android operating system. Your primary focus will be the development of Android applications and their integration with back-end services. Due to the fragmentation ofthis ecosystem, you must pay special attention to the application’s compatibility with multiple versions of Android and device types.You must also have a strong understanding of the patterns and practices that revolve around such a platform. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.ResponsibilitiesDesign and build applications for the Android platformTranslate designs and wireframes into high quality codeWriting scalable, robust, testable, efficient, and easily maintainable codeEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/sr-android-developer-kotlin-118733"}, {"name": "Front end Developer", "company": "Codewing Solutions Pvt. Ltd.", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "deadline": "05 Dec, 2020", "education": "", "experience": "", "level": "Senior Level,Mid Level", "salary": "Rs.\n        -\n        30000 to 70000\n        /\n        Month", "desct": "Front end DeveloperJob posted on 06 Nov, 2020Apply before 05 Dec, 2020Codewing Solutions Pvt. Ltd.Detailed Job description / requirements:﻿﻿﻿Are you passionate about front end development? Keep reading!.We, at Codewing Solutionsare looking for 2 WordPress Front-End Developers to join our product development team. The product that you will build will be used by thousands of people from all around the world.You will be working directly with the Founder, Product Strategy Team and Marketing Team to build world-class products.If you are hired, you will work remotely but are expected to work from our office in Hadigaun (near Baluwatar) when the lockdown is over and it is safe to work from the office.What Does Codewing Solutions do?We are a creative digital agency. We are a product-based company rather than a service-oriented company.We have products in many niches. Two of our popular products areRara ThemesandWP Travel Engine, both based on WordPress.With millions of downloads, Rara Themes is one of the leading WordPress theme companies in the world. Similarly, WP Travel Engine is currently the world’s #1 travel booking WordPress plugin.Besides creating world-class products, we also believe in having fun at work. We work 5 days a week, and we chill on weekends!What will you be responsible for?Convert given XD/PSD into pixel perfect design using HTML5,CSS3 and jQueryConvert given design using page builders like ElementorSlice the given design according to wordpress standardsEnsuring web design is optimized for smartphonesBuilding reusable code for future useOptimizing web pages for maximum speed and scalabilityDebug and fix design-related issues of clients when necessaryMaintaining brand consistency throughout designWork closely with designers and developers to create modern pagesUndertake development operational tasks to release web applications, updates and fixesLearning and using new technologies and adapting to the latest trendsCollaborate with team members and reporting to your supervisorHow qualified you should be?We are looking for developers who have proven track records and can demonstrate their skills. To be considered for this position, you should have:Bachelor's Degree in Design, Computer Science or related industry experienceMinimum of 2-3 years of experience in using Wordpress, jQuery, HTML/CSS, Javascript, LESS/SasSExperience in using Wordpress CMSExperience in using page builders like ElementorGood understanding of designing softwares like Photoshop and XDGood understanding of website architecture and layout aestheticsShould have proper knowledge of using GITGood understanding of Search Engine OptimisationShould be able to work under pressureWhy you will love working with us?When you join our team, these are some of the perks that you get.Create digital products that will be used by thousands of people all around the worldWork with a team which has proven record of building and scaling world-class productsFun and friendly people to work withCozy workspace with CPU, dual monitor working station once we are back from the officeFree lunch and snacks during work from officeUnlimited coffee and tea during work from officeFlexible working hoursSalary review regularlyRecreational activitiesProvident Fund, gratuity, Dashain bonus, insurance, and paid leavesWait! Before sending your CV to us, make sure at least three of the profile matches you :I have traveled to at least 1 place in the last 1 year.I am passionate about at least one other thing apart from programming or have a hobby. Passion about programming is expected.I exercise regularly and take care of my health.I have read at least 1 book in the last 6 months.I have helped at least 1 person after the lockdown.I follow at least 1 Youtube Channel or blog regularly.Ready to Apply?If the vacancy appeals to you and matches your interest, send an email tohire@codewing.co (NOT .COM).The email should include the following:Your CV/ResumeYour Work Portfolio (can be included in CV/Resume as well)It should also include answers to at least two of the following questions:What is the last book you read and how did that change your thought process?What causes are you passionate about?What are your 5 major strengths?We’ll take it from there.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/front-end-developer-118711"}, {"name": "Lead Security Engineer", "company": "UXCam Pvt. Ltd", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "05 Dec, 2020", "education": "Bachelors in Computer Science", "experience": "3+ years", "level": "Senior Level,Mid Level", "salary": "", "desct": "Lead Security EngineerJob posted on 06 Nov, 2020Apply before 05 Dec, 2020UXCam Pvt. LtdFounded in 2014, UXCam strives to be the best qualitative analysis tool for apps worldwide. \r\n\r\nWe are providing a product that advances the way our customers think about their User Experience. To do this, we are searching for the best talents around the globe, while having a culture that supports open feedback and constant improvement.\r\n\r\nWe are a U.S. based C-corp with subsidiaries in England and Nepal. We are proudly backed by prominent Silicon valley investors including 500 Startups.\r\n\r\nLearn more about us: https://uxcam.com/aboutDetailed Job description / requirements:﻿Why choose UXCamUXCam is the market leader in app-experience analytics. We are backed by prominent Silicon Valley investors including 500 Startups.You will have the opportunity to have an impact on a mature start-up with flat hierarchies on a hyper-growth stage. We provide a dynamic work environment in the center of Kathmandu and a perfect platform to learn and progress your career.UXCam actively promotes diversity and provides equal employment opportunities (EEO). All applicants are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability or sexual orientation.About UXCamEnsuring an outstanding user experience is key to success in today’s highly competitive digital markets. Every successful organization is in the business of delivering User Experience.  On the foundation of these beliefs, we atUXCamdeveloped a solution that helps enterprises to deliver the perfect app - by understanding their users.Brands such as Vodafone, DeliveryHero, Nissan, Delivery.com and TaskRabbit are using UXCam to deliver the best digital experiences and drive amazing business results.ProductUXCam enables companies to track user experience and pinpoint issues enabling them to make informed decisions about future improvements. Our product includes:Mobile SDK library: iOS, Android and Cross-platform SDK to record user experience data on the appDashboard: to get actionable insight through easy-to-use visual tools (Session Replay, Heatmaps, User Analysis)Job DescriptionSecurity is in the foundation of thousands of customers’ trust in UXCam. In this role, you will work with the Product and Engineering team to support our software security program, ensuring that security is baked into all of the products and infrastructure built at UXCam with appropriate security checkpoints.Work closely with the Product and Engineering team to support the software security program ensuring that security is baked into everything we build at every step of the software development lifecycle.Perform information security assessment and testing, including: penetration testing, vulnerability scanning and mitigation, secure coding and testing practicesRespond to customers' queries about security.Liaise with external vendors for regular penetration testing.Manage the bug bounty program.Qualification:Experience implementing software security programs throughout the SDLC including penetration testing and incident response.Experience with AWS Cloud Security Practices.More than 3 Years of experience with Bachelor's Degree in Software Engineering, IT, Computer Science or closely related.Attractions:Lunch at officeFlexible working hoursProvident Fund, Gratuity BenefitsFamily Medical InsuranceKnowledge sharing OpportunityAttractive SalaryAnnual, Monthly and Quarterly EventsPleaseAPPLY HEREOr visit our Career pagehttps://uxcam.com/careersSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/lead-security-engineer-118708"}, {"name": "Laravel Developer up to 100K", "company": "Doublard Design Pvt. Ltd", "vacancy": "2", "time": "Full Time,Contract", "address": "Kathmandu", "deadline": "30 Nov, 2020", "education": "B.E. in Computer Science,Bachelors in Computer Science", "experience": "3+ years", "level": "Senior Level,Mid Level", "salary": "Based on experience", "desct": "Laravel Developer up to 100KJob posted on 02 Nov, 2020Apply before 30 Nov, 2020Doublard Design Pvt. LtdDetailed Job description / requirements:﻿﻿High IQ? Looking for work that will challenge you?High IQ Experienced Laravel Framework Developers RequiredExperience:Minimum 2 years of Laravel developmentSkills required:Laravel Framework / PHPSalary:Dependent on skill level and ability - we want highly talented individuals. Probation of 3 months requiredIt is in your favour if you have strong experience of:CMS development, Inventory Management Systems, ERP Software, Vue.js and hands on experience with SQL schema design, SOLID principles, REST API design, MySQL profiling and query optimization.Language:Strong command of English.Location:WFH - Remote Work – Main office is located Bansbari, Kathmandu.Please send an email showing your interest along with your CV tocareers@doublarddesign.comPlease note that as part of the interview process, if selected we will expect you to demonstrate your skill level over the course of a day as unpaid. Please ensure that you are happy to do this before applying.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/laravel-developer-up-to-100k-118667"}, {"name": "Senior System Engineer", "company": "LIS Nepal Pvt. Ltd. (Sister Concern of Yomari Group of Companies)", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "29 Nov, 2020", "education": "Please check vacancy details", "experience": "Please check vacancy details.", "level": "Senior Level", "salary": "", "desct": "Senior System EngineerJob posted on 30 Oct, 2020Apply before 29 Nov, 2020LIS Nepal Pvt. Ltd. (Sister Concern of Yomari Group of Companies)LIS Nepal Private Limited is a sister concern of Yomari Group of Companies. It is a privately held company established in 21 July, 2014, with the same proprietor of Yomari. \r\nLIS Nepal specializes in a broad range of data integration, data warehousing and business intelligence solutions, with a special focus on retail industry. It is also one of the development centers for Logic Information Systems, Inc. (http://www.logicinfo.com ). Moreover, LIS Nepal also focuses on providing ICT related services to Nepal's domestic market. Its services include software development, infrastructure services, system integration, project implementation and representing foreign ICT companies in Nepal.\r\nCurrently, LIS team size comprises of 100+ team members working closely with Development, HR, Operations, Infra and Finance team. \r\nAt LIS, we are committed to understand the unique technological needs of our clients and providing them the best solutions. We have all it takes to succeed: a team of experienced IT professionals with the character and competence to do the job right.Detailed Job description / requirements:﻿﻿﻿﻿﻿﻿﻿﻿﻿We are looking for self-driven, motivated and result\noriented professional to be part of our dynamic team as “Senior System\nEngineer”. Details of the same have been highlighted below;Job Description:Handle network technologies with multi\nvendor’s environment (routers, firewalls, switches, etc.)Tune network performance by analyzing different network parameters,\nscheduling upgrades and focus on network optimizations.Develop\nnetwork infrastructures and system implementation solutions and make\nrecommendations on systems enhancements for optimization.Perform network assessments and security testing.Develop automation tools and processes to help scale operations.Perform server data backup, data migration and disaster recovery operations.Coordinate\nwith software developers and system analysts to design effective solutions that\nmeet requirements for functionality and integration with existing components.Research, develop,\nand implement new technologies and practices.Documentation\nand Reporting of assigned task to supervisor.Lead,\nsupervise and train other technical teams.Communication\nwith customers as required; keeping them informed of incident progress,\nnotifying them of impending changes or agreed outages.Job Specification:Bachelor degree, with a technical\nmajor, such as engineering, computer science or similar relevant field.Minimum 3 years’ experience in area of\nnetwork and system administration.Strong communications skills- both\nverbal and written.Team player, self-driven attitude and\nprovide effective solutions.Experience in\nadministering windows/Linux systems and Virtualization (VMware and Citrix).Experience with\nLinux, Unix, DNS, LDAP/AD as well as Linux shell/PowerShell scripting/MySQL is\na plus.Able to effectively manage multiple\nsimultaneous projects.Familiarization with public cloud\nservice like Amazon Web Service and Microsoft Azure.Familiarization with DevOps tools\n(Ansible/Jenkins).Have known knowledge on effective\ncyber security tools.RHCE/Network Security Certification\nwould be an added advantage.Interested candidates\nare requested to send in their cover letter and resume clarifying their work\nexperience and expected salary tohrd@lisnepal.com.npby 30th November 2020.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/senior-system-engineer-118664"}, {"name": "GoLang Engineer", "company": "BerryBytes", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "28 Nov, 2020", "education": "Bachelors in Computer Science", "experience": "Please check vacancy details.", "level": "Senior Level", "salary": "", "desct": "GoLang EngineerJob posted on 29 Oct, 2020Apply before 28 Nov, 2020BerryBytesBerryBytes develop computer vision technologies using Machine Learning and AI and offers Cloud Native Application solutions.  We bring the perfect combination of talent and technology to help our customers overcome their most significant challenges.Detailed Job description / requirements:﻿﻿﻿﻿Why a Career with BerryBytesOur Culture:AtBerryBytes,we work in a collaborative and innovative work environment. We work with brilliant and passionate people who strive and encourage others to do their best. BerryBytes's idea-rich environment welcomes creative and sometimes unconventional perspectives!Growth Opportunities:You will have the opportunity to grow and make an impact from your work. We encourage innovation in all who become a part of our team. With growing operations internationally, there are lots of lateral and upward advancement opportunities for rewarding and developing careers with BerryBytes. We’re strong believers in continuing education and provide the resources that you need to continue learning.Employee Perks:We offer flexible hours, competitive PTO policy, incentive, bonus, health and wellness, and attractive compensation and benefit plans. We make it our obligation to the team here to stay current with compensation trends in the tech field.Please send your latest resume in PDF format at hr@berrybytes.comWe thank all applicants in advance for applying. Only individuals selected for interviews will be contacted.GoLang EngineerJob Description and ResponsibilitiesWe’re looking for an experienced Software Engineer with GoLang to join our team. Your core responsibilities will include:Responsible for the development and maintenance of key product featuresWork with other team members to investigate design approaches, prototype new technology, and evaluate technical feasibility.Will work in a fast-paced environment to deliver high-quality software against aggressive schedules.Prepare technical requirements and software design specificationsInstall and support systems used internally by developmentResponsible for helping to document the softwareEducation QualificationsMaster degree in Computer Science, Engineering, a related field or equivalent work experienceTechnical SkillsStrong in Go Concurrency.Knowledge Operating system internals.Knowledge of TCP/IP networking and common web technologies ‘Ability to work independently while managing multiple task assignments.Strong initiative, written, and verbal communication skills.Experience with any of the following technologies a plusSolid experience in Multi-threaded and Concurrent programmingTCP/IP socket programmingFamiliarity with GoLang leading opensource librariesStatic and dynamic analysis toolsWorking knowledge of encryption tools and technologiesNoSQL and Relational Databases experienceElastiSearch and RabbitMQ experience a plus.Nice to HaveExperience with Docker and Kubernetes a plus.Experience in CI/CD and DevOps processes.More details:This is a full-time position, with great career prospects as we grow.Hours: Flexible full-time working hoursCompensation: Based on experienceSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/golang-engineer-118650"}, {"name": "DATA ANALYST", "company": "GrowByData Services Pvt. Ltd.", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": "18 Nov, 2020", "education": "Bachelors in Computer Science", "experience": "1+ years", "level": "Senior Level", "salary": "", "desct": "DATA ANALYSTJob posted on 19 Oct, 2020Apply before 18 Nov, 2020GrowByData Services Pvt. Ltd.GrowByData was founded by powerhouses in big data analytics and SaaS, who have leveraged the power of global operations for decades. We help early-to-growth-stage companies use data to improve margins, delight customers, and accelerate revenue growth.Detailed Job description / requirements:Are you interested in having your products be used by 1000s of brands globally? Does building a global brand excite you? Does having your solutions be used by the world’s top brand get you up from bed? GrowByData is on a mission to expand its distribution to the world’s retailers and is seeking energetic, creative, and self-driven individuals to join the challenge. We are looking for motivated, and talented individual to join us as Data Analyst to deliver our enterprise platform! If the challenge excites you, please apply with your CV, your work sample and 3 reasons why this excited you. Feel free to send your work samples from the industry or otherwise to prove yourself. Emailinquiries@growbydata.comto be considered immediatelyTITLE: DATA ANALYSTRESPONSIBILITIESAcquire data from primary or secondary data sources and maintain data systems including writing scripts, web scraping.Should gather and process both structured and unstructured data in a way that is useful for analysis.Identify, analyze, and interpret trends or patterns in complex data setsShould provide data support and write SQL queries, and create reports in collaboration with software developers.Locate and define new process improvement opportunities.Deliver to and communicate with team members and client on/offshore effectively, regularly, and professionallyREQUIREMENTSExperience in data analysisStrong analytical and logical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyExperience in MS SQL writing queriesExperience in PythonKnowledge of eCommerce platforms and marketplaces will be an added valueAdept at report writing and presenting findingsExcellent communication and personal interaction skillsPassionate about learning and self-motivated; drive to contribute ideas and share knowledge proactively; must be a team player.EDUCATION:Bachelor in Computer Engineering / Sciences or equivalent.EXPERIENCE:1 year of prior working experience in a relevant field would be preferred and favorable.Save to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/data-analyst-118615"}, {"name": "Web Designer", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "deadline": "15 Nov, 2020", "education": "", "experience": "2+ years", "level": "Mid Level", "salary": "Based on experience", "desct": "Web DesignerJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿﻿﻿What you will doCreate clean, user-friendly, and visually appealing design.Convert non-functional UI mockups into responsive cross-browser compatible web pages.Communicate with business to gather requirements, express ideas and collaborate throughout the processes.Must Have:At Least 2+ years experience in the UI/UX field or similar.In-depth knowledge of design fundamentals and processesProficient in Adobe Suite, FigmaProficient in HTML, CSS, SASS & Javascript.Ability to work both independently and in a collaboration with the development & marketing team.How to apply: Interested candidates can submit their CV/RESUME at business@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/web-designer-118607"}, {"name": "Java/Angular Developers", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "deadline": "15 Nov, 2020", "education": "", "experience": "2+ years", "level": "Senior Level,Mid Level", "salary": "Based on experience", "desct": "Java/Angular DevelopersJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿﻿What you’ll do:Analyze technical requirements, design applications, integrate solutionBuild self-contained, reusable and testable modules and components.Perform development in CSS, Angular 6+, and 3rd party libraries or frameworksPerform development in Java/Spring boot, web service, hibernate.Ensure the best possible performance, quality, and responsiveness of applicationsMust Haves:2+ years building high quality and secure application using Angular frameworkGood proficiency with CSS rule specificity, Typescript, JavascriptGood proficiency with Services, routing and security practicesGood proficiency with spring boot/java, web service, hibernateExperience with RESTful servicesProfessional, precise communication skillsHow to apply: Interested candidates can submit their CV/RESUME at business@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/java-angular-developers-118606"}, {"name": "PHP Laravel Developers", "company": "Rara Information Technology Pvt. Ltd.", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "deadline": "15 Nov, 2020", "education": "", "experience": "2+ years,5+ years", "level": "Senior Level,Mid Level", "salary": "Based on experience", "desct": "PHP Laravel DevelopersJob posted on 16 Oct, 2020Apply before 15 Nov, 2020Rara Information Technology Pvt. Ltd.Rara Information Technology is a company established by a team of young IT and Fin Tech Professionals working in the field of Software development, IT, Fin Tech, E-Commerce and Consulting Services. We are the group of Innovators, Engineers, Developers, Creators and Consultants.Detailed Job description / requirements:﻿﻿﻿What you must possess:A Minimum 2 Years+ experience in Object-Oriented PHP frameworksExcellent skill in Core PHP, LaravelKnowledge of WordPress is beneficialGood with everything PHP and MySQL.Awesome in JavaScript, jQueryProficiently use version control systemFast learner and troubleshooterTeam PlayerGood to have points:Experience in eCommerce DevelopmentUnderstanding of Common front end environments eg. BootstrapFramework agnostic debugging skillsUnderstanding of Responsive and Mobile DesignHow to apply: Interested candidates can submit their CV/RESUME atbusiness@rarait.comSave to favoriteRefer\n                                        to a friend", "Page_URL": "https://www.jobsnepal.com/php-laravel-developers-118604"}]