[
    {
        "name": "Sr. Developer - JS",
        "company": "Wolfmatrix Pvt. Ltd.",
        "logo": "https://www.jobsnepal.com/img/image-03.jpg",
        "vacancy": "1",
        "time": "Full Time",
        "level": "5+ years",
        "experience": "Please check vacancy details",
        "education": "",
        "deadline": "Lalitpur",
        "address": "",
        "desc": "Wolfmatrix is looking for a Sr. Developer – Java Script who will be responsible for full-stack development of web applications with close collaboration with our clients and their agile delivery team. Sr. Developer will be delivering advanced user interface solutions and scalable backend solutions by adhering to user experience, usability and software engineering best practices. ",
        "desc1": "Full-stack development of web applications using JS technologiesDevelop, implement, and improve state-of-the-art software in collaboration with a team of full-stack developers and testersParticipate in a software development process that is user-centric with leading agile engineering philosophies (test-driven development, test automation, continuous integration, and delivery).Deliver high-quality solutions to our clients by adhering to software design, development, and testing best practices",
        "desc2": "Demonstrated experience developing Web ApplicationsKnowledge of JS and frameworks available for it, such as Express is a plusUnderstanding of best practices and architecture patterns for developing Web applicationsUser authentication and authorization between multiple systems, servers, and environmentsUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitStrong written and verbal communicationAbility to work effectively in a team setting, including internal and client teammatesThe following skill will be a big plusD3.JSTypeScriptWeb Performance / OptimizationReact NativeRESTful APIDevOps (CI/CD, test automation)",
        "desc3": "﻿Sr. Developer - JSJob Description:Wolfmatrix is looking for a Sr. Developer – Java Script who will be responsible for full-stack development of web applications with close collaboration with our clients and their agile delivery team. Sr. Developer will be delivering advanced user interface solutions and scalable backend solutions by adhering to user experience, usability and software engineering best practices. Responsibilities:Full-stack development of web applications using JS technologiesDevelop, implement, and improve state-of-the-art software in collaboration with a team of full-stack developers and testersParticipate in a software development process that is user-centric with leading agile engineering philosophies (test-driven development, test automation, continuous integration, and delivery).Deliver high-quality solutions to our clients by adhering to software design, development, and testing best practicesRequired Knowledge, Skills, and AbilitiesDemonstrated experience developing Web ApplicationsKnowledge of JS and frameworks available for it, such as Express is a plusUnderstanding of best practices and architecture patterns for developing Web applicationsUser authentication and authorization between multiple systems, servers, and environmentsUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitStrong written and verbal communicationAbility to work effectively in a team setting, including internal and client teammatesThe following skill will be a big plusD3.JSTypeScriptWeb Performance / OptimizationReact NativeRESTful APIDevOps (CI/CD, test automation)Education + ExperienceEducation:Masters Degree in Software Engineering, IT, Computer Science or closely related.5+ years of development experience with Java Script, CSS, D3.JS, React JS, Node JS, Jquery, Need to be able to build scalable and reliable applicationExperience with AWS or GCloud is plusAll applications must be submitted to the following email address: careers@wolfmatrix.com; with the following information on the subject line: Application for the position of “Sr. Developer-JS”.Deadline for the submission of application is 31 October 2020.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/sr-developer-js-118549"
    },
    {
        "name": "Senior PHP Developers",
        "company": "A.M. Nepal",
        "logo": "https://img.jobsnepal.com/big/15rKK5GlXD8ReRmjGTmb53kj7spE3RahQydV0Lgc.gif",
        "vacancy": "3",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "4+ years",
        "deadline": "08 Oct, 2020",
        "address": "",
        "desc": "What makes you more attractive:",
        "desc1": "A Minimum 3 Years+ experience in a digital agency environment with Object-Oriented PHP (No Amateurs please) Excellent skill in Core PHP, LaravelWillingness to work in JoomlaKnowledge of Wordpress is beneficialGood with everything PHP and MySQL.Awesome in Javascript, XML, JqueryFast learner and troubleshooter Excellent Communicator (English) ",
        "desc2": "Experience in eCommerce DevelopmentKnowledge of Drupal Understanding of Common front end environments eg. Bootstrap Understanding of Responsive and Mobile DesignGood CSS Skills",
        "desc3": "﻿A.M. Nepal is an Australia based full-service digital agency in Kathmandu that has been redefining digital scape through its team of innovative and awe inspiring digital natives. We have an unmatched reputation in building international brands and software that stand out online and deliver businesses goals of our clients. It has been part of some of the best renowned Australian brands' online marketing successes and continues to deliver off-the-beat experience through its customized designing, development, and online marketing solutions and strategies. We believe that our success and confidence to lead the market emanates from the team. If you are looking for being part of a team for making a distinct digital print on the web and have the zeal to deliver, we have now openings for some awesome PHP Developers with the following attributes. What you must possess: A Minimum 3 Years+ experience in a digital agency environment with Object-Oriented PHP (No Amateurs please) Excellent skill in Core PHP, LaravelWillingness to work in JoomlaKnowledge of Wordpress is beneficialGood with everything PHP and MySQL.Awesome in Javascript, XML, JqueryFast learner and troubleshooter Excellent Communicator (English) What makes you more attractive:Experience in eCommerce DevelopmentKnowledge of Drupal Understanding of Common front end environments eg. Bootstrap Understanding of Responsive and Mobile DesignGood CSS SkillsOur Offer Package:Salary that your skills deserve (No Ceiling for deserving candidates) Work 5 days a week - Chill out 2 days a weekSpecial Bonus packages (including insurance, lunch, snacks)Regular Parties and Hangouts Surprise Parties Annual ReviewsUnlimited growth for achievers Feel this is the dream team you want to be part of mail us now...... or visit our digital office on the web here (www.andmine.com) to know more about us.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/senior-php-developers-118542"
    },
    {
        "name": "Sitecore/Sharepoint Developer",
        "company": "A.M. Nepal",
        "logo": "https://img.jobsnepal.com/big/15rKK5GlXD8ReRmjGTmb53kj7spE3RahQydV0Lgc.gif",
        "vacancy": "2",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "1+ years",
        "deadline": "08 Oct, 2020",
        "address": "",
        "desc": "What you must possess: ",
        "desc1": "A Minimum 1 Year+ experience in Sitecore/Sharepoint Excellent in ASP.NETFast learner and troubleshooter Excellent Communicator (English) ",
        "desc2": "Awesome in Javascript, XML, JqueryExperience in eCommerce DevelopmentUnderstanding of Common front end environments eg. Bootstrap Understanding of Responsive and Mobile DesignGood CSS Skills",
        "desc3": "﻿A.M. Nepal is an Australia based full-service digital agency in Kathmandu that has been redefining digital scape through its team of innovative and awe inspiring digital natives. We have a unmatched reputation in building international brands and software that stand out online and deliver businesses goals of our clients. It has been part of some of the best renowned Australian's brands' online marketing successes and continues to deliver off-the-beat experience through its customized designing, development, and online marketing solutions and strategies. We believe that our success and confidence to lead the market emanates from the team. If you are looking for being part of a team for making a distinct digital print on the web and have the zeal to to deliver, we have now openings for some awesome  Sitecore/Sharepoint Developer with the following attributes. What you must possess: Sitecore/Sharepoint is one of the leading enterprise-level content management systems built on ASP.NET, enabling web content editors and marketers to have full control over all aspects of their website from social integration and blog posts to advanced personalization, e-commerce, and moreA Minimum 1 Year+ experience in Sitecore/Sharepoint Excellent in ASP.NETFast learner and troubleshooter Excellent Communicator (English) What Makes you more attractive:Awesome in Javascript, XML, JqueryExperience in eCommerce DevelopmentUnderstanding of Common front end environments eg. Bootstrap Understanding of Responsive and Mobile DesignGood CSS SkillsOur Offer Package:Salary that your skills deserve (No Ceiling for deserving candidates) Work 5 days a week - Chill out 2 days a weekThe employee of Year - Special Award Regular Parties and Hang outs Surprise Parties Annual ReviewsUnlimited growth for achievers Additional financial bonuses awarded every 3 monthsFeel this is the dream team you want to be part of mail us now...... or visit our digital office on the web here (www.andmine.com) to know more about us.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/sitecore-sharepoint-developer-118541"
    },
    {
        "name": "Senior Front-end Developer (Angular)",
        "company": "Concinnity Limited",
        "logo": "https://img.jobsnepal.com/big/Xdn7OirAOtpdnRMMD1WMg82jPac25XO6RkilCU4V.png",
        "vacancy": "1",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "5+ years",
        "deadline": "07 Oct, 2020",
        "address": "",
        "desc": "Responsibilities",
        "desc1": "Delivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building the RESTful APICommunicating with external web services",
        "desc2": "5+ years of experience with AngularBS degree in computer science or engineeringProficiency with JavaScript and HTML5Professional, precise communication skillsDeep knowledge of Angular practices and commonly used modules based on extensive work experienceCreating self-contained, reusable, and testable modules and componentsEnsuring a clear dependency chain, in regard to the app logic as well as the file systemAbility to provide SEO solutions for single page appsExtensive knowledge of CSS and JS methods for providing performant visual effects.Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the systemValidating user actions on the client side and providing responsive feedbackWriting non-blocking code, and resorting to advanced techniques such as multi-threading, when neededCreating custom, general use modules and components which extend the elements and modules of core AngularExperience with all levels of operation available to the front-end, such as from creating XHRs in vanilla JS to using a custom wrapper around $resourceExperience with building the infrastructure for serving the front-end app and assetsArchitecting and automating the build process for production, using task runners or scriptsDocumenting the code inline using JSDoc or other conventionsWriting extensive unit tests using automated TDD tasksCreating e2e test suites for all components, and running them with Protractor (or a well reasoned alternative)Creating configuration, build, and test scripts for Continuous Integration environments",
        "desc3": "﻿﻿﻿Job DescriptionWe are looking for an Angular Developer responsible for the client side of our service. Your primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. Your main duties will include creating modules and components and coupling them together into a functional app. The artistic design will be delivered to you, together with a few HTML templates, but we will ask for your help in regard to animations, CSS, and final HTML output. You will work in a team with the back-end developer, and communicate with the API using standard methods. A thorough understanding of all of the components of our platform and infrastructure is required.ResponsibilitiesDelivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building the RESTful APICommunicating with external web servicesSkills and Qualifications5+ years of experience with AngularBS degree in computer science or engineeringProficiency with JavaScript and HTML5Professional, precise communication skillsDeep knowledge of Angular practices and commonly used modules based on extensive work experienceCreating self-contained, reusable, and testable modules and componentsEnsuring a clear dependency chain, in regard to the app logic as well as the file systemAbility to provide SEO solutions for single page appsExtensive knowledge of CSS and JS methods for providing performant visual effects.Thorough understanding of the responsibilities of the platform, database, API, caching layer, proxies, and other web services used in the systemValidating user actions on the client side and providing responsive feedbackWriting non-blocking code, and resorting to advanced techniques such as multi-threading, when neededCreating custom, general use modules and components which extend the elements and modules of core AngularExperience with all levels of operation available to the front-end, such as from creating XHRs in vanilla JS to using a custom wrapper around $resourceExperience with building the infrastructure for serving the front-end app and assetsArchitecting and automating the build process for production, using task runners or scriptsDocumenting the code inline using JSDoc or other conventionsWriting extensive unit tests using automated TDD tasksCreating e2e test suites for all components, and running them with Protractor (or a well reasoned alternative)Creating configuration, build, and test scripts for Continuous Integration environments\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/senior-front-end-developer-angular-118530"
    },
    {
        "name": "Senior Node JS Backend developer",
        "company": "Concinnity Limited",
        "logo": "https://img.jobsnepal.com/big/Xdn7OirAOtpdnRMMD1WMg82jPac25XO6RkilCU4V.png",
        "vacancy": "1",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "5+ years",
        "deadline": "07 Oct, 2020",
        "address": "",
        "desc": "Responsibilities",
        "desc1": "Integration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsImplementation of security and data protectionIntegration of data storage solutions",
        "desc2": "5+ years of experience with Node.JSBS in computer science or engineeringStrong proficiency with JavaScriptFamiliar with AWS productsExperience with docker is a must. Knowledge of kubernetes is highly appreciated.Knowledge of Node.js and frameworks available such as Express, StrongLoopUnderstanding the nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages such as Jade, EJSGood understanding of server-side CSS preprocessors such as Stylus, LessBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as Git",
        "desc3": "﻿﻿﻿﻿Job DescriptionWe are looking for a Node.js Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition, and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.ResponsibilitiesIntegration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsImplementation of security and data protectionIntegration of data storage solutionsSkills And Qualifications5+ years of experience with Node.JSBS in computer science or engineeringStrong proficiency with JavaScriptFamiliar with AWS productsExperience with docker is a must. Knowledge of kubernetes is highly appreciated.Knowledge of Node.js and frameworks available such as Express, StrongLoopUnderstanding the nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages such as Jade, EJSGood understanding of server-side CSS preprocessors such as Stylus, LessBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as Git\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/senior-node-js-backend-developer-118529"
    },
    {
        "name": "UI/UX Designer",
        "company": "Codewing Solutions Pvt. Ltd.",
        "logo": "https://img.jobsnepal.com/big/zcp2EVoF66Ta9u0U0TeekJ80HMHeyutMPKPYxeTj.jpeg",
        "vacancy": "1",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "2+ years",
        "deadline": "05 Oct, 2020",
        "address": "",
        "desc": "The work requires you to work closely with our company growth strategy team and developers to create meaningful designs following WordPress theme design guidelines.  ",
        "desc1": "The job requires you to keep create beautiful designs following strategy documents provided by our strategy team. The theme you will design will be used by thousands of people from all around the world. The design you create should also be clean, user-friendly, and visually appealing.",
        "desc2": "At least 2 years of experience in the UI/UX field or a similar fieldBachelor’s degree in design, IT, or similar degreeStrong understanding of UI which can be proved via your sample design or previous workKnowledge about WordPress will be preferredProficient in Adobe XD, Adobe Photoshop, and Adobe IllustratorProficient in Adobe Suite, Figma, Wireframing & Prototyping tool will serve as an advantage",
        "desc3": "﻿Are you passionate about design? Keep reading!. Codewing Solutions is looking for a highly skilled web designer (UI/UX or UI or UX) to join our product team to create beautiful themes, not client websites. The work requires you to work closely with our company growth strategy team and developers to create meaningful designs following WordPress theme design guidelines.  If you are hired, you will work remotely but are expected to work from our office in Hadigaun (near Baluwatar) when the lockdown is over and it is safe to work from the office.What Does Codewing Solutions do?We are a creative digital agency. We are a product-based company rather than a service-oriented company.We have products in many niches. Two of our popular products are Rara Themes and WP Travel Engine, both based on WordPress.With millions of downloads, Rara Themes is one of the leading WordPress theme companies in the world. Similarly, WP Travel Engine is currently the world’s #1 travel booking WordPress plugin.Besides creating world-class products, we also believe in having fun at work. We work 5 days a week and, and we chill on weekends!What will you be responsible for?The job requires you to keep create beautiful designs following strategy documents provided by our strategy team. The theme you will design will be used by thousands of people from all around the world. The design you create should also be clean, user-friendly, and visually appealing.How qualified you should be?At least 2 years of experience in the UI/UX field or a similar fieldBachelor’s degree in design, IT, or similar degreeStrong understanding of UI which can be proved via your sample design or previous workKnowledge about WordPress will be preferredProficient in Adobe XD, Adobe Photoshop, and Adobe IllustratorProficient in Adobe Suite, Figma, Wireframing & Prototyping tool will serve as an advantageWhy you will love working with us?When you join our team, these are some of the perks that you get.Create digital products that will be used by thousands of people all around the worldWork with a team which has a proven record of building and scaling world-class products Fun and friendly people to work withCozy workspace with CPU, dual monitor working station, and ergonomic seating arrangement once we are back at the officeFree lunch and snacks once we are back at the officeUnlimited coffee and tea once we are back at the officeFlexible working hoursTimely performance review and annual salary reviewRecreational activitiesProvident Fund, gratuity, Dashain bonus, insurance, and paid leavesWait! Before sending your CV to us, make sure at least three of the profile matches you:I have traveled to at least 1 place in the last 1 year.I am passionate about at least one other thing apart from designing or have a hobby. Passion for designing is expected.I exercise regularly and take care of my health.I have read at least 1 book in the last 6 months.I have helped at least 1 person after the lockdown.I follow at least 1 Youtube Channel or blog regularly.Ready to Apply?If the vacancy appeals to you and matches your interest, send an email to hire@codewing.co (NOT .COM). The email should include the following:Your CV/ResumeYour Work PortfolioIt should also include answers to at least two of the following questions:What is the last book you read and how did that change your thought process? What causes are you passionate about? What are your 5 major strengths? We’ll take it from there.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/ui-ux-designer-118512"
    },
    {
        "name": "Senior Wordpress Developer",
        "company": "Nerd Platoon Pvt. Ltd.",
        "logo": "https://img.jobsnepal.com/big/i4bcahEBGt2IkgahpZabwJrrzPPvGz7Bk3j9E33w.jpeg",
        "vacancy": "5",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "3+ years",
        "deadline": "05 Oct, 2020",
        "address": "",
        "desc": "",
        "desc1": "A strong passion for web developmentA willingness to work with othersStrong verbal/written communication skillsAdvanced knowledge of HTML/CSS/JavaScriptExperience with using API's/Web ServicesStrong understanding of PHP/mySQLExperinced in PHP and WordpressProficient knowledge of web standardsA full understanding of web accessibilityExperience with WordPress developmentGood understanding of wordpress APIAn ability to multi-taskAn ability to work under pressure to meet deadlinesMust have excellent English written and oral communication skills",
        "desc2": "Good understanding of front-end technologies, including HTML5, CSS3, JavaScript, jQueryExperience building user interfaces for websites and/or web applicationsExperience designing and developing responsive design websitesComfortable working with debugging tools like Firebug, Chrome inspector, etc.Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsersAbility to convert comprehensive layout and wireframes into working HTML pagesKnowledge of how to interact with RESTful APIs and formats (JSON, XML)Proficient understanding of code versioning tools *such as Git, SVN, and Mercurial*Strong understanding of PHP back-end development",
        "desc3": "﻿If you have the following skills then we would like to hear about it:A strong passion for web developmentA willingness to work with othersStrong verbal/written communication skillsAdvanced knowledge of HTML/CSS/JavaScriptExperience with using API's/Web ServicesStrong understanding of PHP/mySQLExperinced in PHP and WordpressProficient knowledge of web standardsA full understanding of web accessibilityExperience with WordPress developmentGood understanding of wordpress APIAn ability to multi-taskAn ability to work under pressure to meet deadlinesMust have excellent English written and oral communication skillsSkills and QualificationsGood understanding of front-end technologies, including HTML5, CSS3, JavaScript, jQueryExperience building user interfaces for websites and/or web applicationsExperience designing and developing responsive design websitesComfortable working with debugging tools like Firebug, Chrome inspector, etc.Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsersAbility to convert comprehensive layout and wireframes into working HTML pagesKnowledge of how to interact with RESTful APIs and formats (JSON, XML)Proficient understanding of code versioning tools *such as Git, SVN, and Mercurial*Strong understanding of PHP back-end developmentJob DescriptionJob Overview:Nerd Platoon, A Qodemedia R&D Team, is looking for a full-time experienced Senior Wordpress Developer responsible for building varities of websites. Your primary focus will be the development of every kind of commercial and non-commercial websites.Building and deploying websites and web applicationsLaunching e-commerce websiteBuilding website plugins and modulesUpdating content through WordPress or HTML templatesOptimizing websites and web applications for accessibility and speedWork with Payment Gateway SystemsPerforming web design and web development tasksOur Offer Package:Salary that your skills deserve (No ceiling for deserving candidates)Free transportation with  pick up and door to door drop facility round the clockCitizen Investment Trust saving facilityWork 5 days a week - Chill out 2 days a weekDinner, Lunch & Snacks parties and hangouts – Annual entertainment calendarWeekly sporting, training & team building eventsUnlimited growth for achieversApplying Procedure:Interested candidates can submit their resume with a cover letter explaining why you would be a great fit at:career@nerdplatoon.com\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/senior-wordpress-developer-118511"
    },
    {
        "name": "FRONT-END Engineer (Senior)",
        "company": "Zegal",
        "logo": "https://img.nepaljobs.com/big/NdUZqwCRVgnTlf5IN8M3e2IXN8Pdbz0Q007VW8Q6.jpeg",
        "vacancy": "1",
        "time": "Full Time",
        "level": "Senior Level",
        "experience": "2+ years",
        "education": "Please check vacancy details",
        "deadline": "27 Oct, 2020",
        "address": "Kathmandu",
        "desc": "We are looking for a Senior Front-End Engineer who will work in our close-knit Nepal development team as part of our broader engineering team working from the Hong Kong Zegal office. This is a unique opportunity for an experienced software engineer to be part of a team developing a truly innovative and high potential technology service.",
        "desc1": "Control day-to-day and hands-on work in detailed design, coding, documentation, and unit testing of certain components of the Zegal service, in particular client side components in our many web applications.Work with other team members and subordinate junior members to integrate software into working releases for testing and eventual production deployment.Ongoing maintenance of components throughout the software lifecycle.Work with Project Manager and Chief Technology Officer to plan work program for individual releases.BAU work such as bug fixing, testing and patching our web applications.",
        "desc2": "Experience in the coding of client-side Javascript applications with libraries related to such implementations, including React, MobX, Webpack.Good understanding of client-side state management and application architecture patterns.Some experience with functional programming concepts.Familiarity with client-side analytics tools.",
        "desc3": "﻿FRONT-END SENIOR ENGINEER - Nepal OfficeTHE ROLEWe are looking for a Senior Front-End Engineer who will work in our close-knit Nepal development team as part of our broader engineering team working from the Hong Kong Zegal office. This is a unique opportunity for an experienced software engineer to be part of a team developing a truly innovative and high potential technology service.RESPONSIBILITIESControl day-to-day and hands-on work in detailed design, coding, documentation, and unit testing of certain components of the Zegal service, in particular client side components in our many web applications.Work with other team members and subordinate junior members to integrate software into working releases for testing and eventual production deployment.Ongoing maintenance of components throughout the software lifecycle.Work with Project Manager and Chief Technology Officer to plan work program for individual releases.BAU work such as bug fixing, testing and patching our web applications.QUALIFICATIONSSkillsExperience in the coding of client-side Javascript applications with libraries related to such implementations, including React, MobX, Webpack.Good understanding of client-side state management and application architecture patterns.Some experience with functional programming concepts.Familiarity with client-side analytics tools.Experience5+ years of programming experience in a work environment.LanguagesEnglish a mustEducationUniversity degree or equivalent professional apprenticeshipCompensationCompensation will be very competitive with market, including base salary, and benefits (e.g., stock options, additional leave, and training in our Hong Kong office)COMPANY OVERVIEWCompanies that are connected to knowledge, their advisors, and use workflows to run their organisation are smarter and more profitable. Our mission is to make this the new normal for millions of businesses across the globe.Founded in 2013, Zegal is the fastest growing LegalTech company operating across Asia Pacific and Europe. Today, business users and lawyers across the globe trust Zegal’s software to solve legal problems in an affordable and efficient way.Zegal is led by a talented team of 60 employees and has offices in Hong Kong, Singapore, Nepal, Australia, New Zealand, and the UK.Zegal has been featured in the New York Times, Forbes, and Huffington Post, and was recently recognised in the South China Morning Post as an emerging LegalTech company in the artificial intelligence space.﻿\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/front-end-engineer-senior-118446"
    },
    {
        "name": "PHP laravel developer",
        "company": "Technology sales Pvt Ltd",
        "logo": "https://img.jobsnepal.com/big/K9V44Z67aCd54k37QYVmIvdJwDt9jaAY5j3T2fat.jpeg",
        "vacancy": "2",
        "time": "",
        "level": "",
        "experience": "Mid Level",
        "education": "2+ years",
        "deadline": "28 Sep, 2020",
        "address": "",
        "desc": "",
        "desc1": "Minimum 2 years relevant work experience in Backend/ API developmentDemonstrated experience in Development, unit test application modules based on specified design and frameworks.Experience with implementing applications with, Laravel and MVC architecturesExperience with Agile project development methodologiesExperience with Web Services, Restful or SOAPExperience with designing, developing, and implementing across LINUX/UNIX and Windows server operating systemsExperience with collaborating across multiple functional/technical teams to deliver a projectExperience with Databases and having good knowledge of database managementPreferred Professional and Technical ExpertiseExposure to automated build & development  tools like Git Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and validated time managementDeveloping enterprise applications leveraging the full spectrum of web technologies and design patternsCollaborating with Clients, team members and business analysts to translate business requirements into technical requirementsBusiness requirements are understood and analyzed by having frequent interaction with various user levels to understand their requirements.",
        "desc2": "31% Social Security FundDashain bonusAnnual holidays up to 19 daysGreat work cultureFlexible timings against performanceProfessional support and recognitionLearn new technologies & novel implementationsExposure to multiple aspects of a small growing teamAnnual performance reviewInternal and external learning, training and workshopOn-going career developmentPaid maternity and paternity leaveInsurance: Medicine and health insurance up to 1 lakh Nepalese rupees (after 3 months)Accidental insurance up to 10 lakhsDependent Pension plan up to 60% of salary in case of deathRetirement plan same as per government office12 days annual paid leave ",
        "desc3": "﻿﻿The candicate must have following Minimum 2 years relevant work experience in Backend/ API developmentDemonstrated experience in Development, unit test application modules based on specified design and frameworks.Experience with implementing applications with, Laravel and MVC architecturesExperience with Agile project development methodologiesExperience with Web Services, Restful or SOAPExperience with designing, developing, and implementing across LINUX/UNIX and Windows server operating systemsExperience with collaborating across multiple functional/technical teams to deliver a projectExperience with Databases and having good knowledge of database managementPreferred Professional and Technical ExpertiseExposure to automated build & development  tools like Git Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to workIntuitive individual with an ability to manage change and validated time managementDeveloping enterprise applications leveraging the full spectrum of web technologies and design patternsCollaborating with Clients, team members and business analysts to translate business requirements into technical requirementsBusiness requirements are understood and analyzed by having frequent interaction with various user levels to understand their requirements.Apply: Interested candidates can submit their CV/RESUME at baikunthareemal@gmail.comFacilitiesWorking days per week: 6 days 42 Hr. Per week 31% Social Security FundDashain bonusAnnual holidays up to 19 daysGreat work cultureFlexible timings against performanceProfessional support and recognitionLearn new technologies & novel implementationsExposure to multiple aspects of a small growing teamAnnual performance reviewInternal and external learning, training and workshopOn-going career developmentPaid maternity and paternity leaveInsurance: Medicine and health insurance up to 1 lakh Nepalese rupees (after 3 months)Accidental insurance up to 10 lakhsDependent Pension plan up to 60% of salary in case of deathRetirement plan same as per government office12 days annual paid leave How to apply: Interested candidates can submit their CV/RESUME at baikunthareemal@gmail.com\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/php-laravel-developer-118444"
    },
    {
        "name": "Node Js and React Full Stack Developer",
        "company": "Codewing Solutions Pvt. Ltd.",
        "logo": "https://img.jobsnepal.com/big/zcp2EVoF66Ta9u0U0TeekJ80HMHeyutMPKPYxeTj.jpeg",
        "vacancy": "2",
        "time": "",
        "level": "",
        "experience": "Senior Level",
        "education": "2+ years",
        "deadline": "24 Oct, 2020",
        "address": "Kathmandu",
        "desc": "You will be working directly with the Founder, Product Strategy Team, and Marketing Team to build world-class SaaS products. ",
        "desc1": "",
        "desc2": "",
        "desc3": "﻿﻿﻿Are you a passionate Node Js and React developer? Keep reading!. Codewing Solutions is looking for 2 Node Js and React developers to join our SaaS product development team. The product that you will build will be used by thousands of people from all around the world. You will be working directly with the Founder, Product Strategy Team, and Marketing Team to build world-class SaaS products. If you are hired, you will work remotely but are expected to work from our office in Hadigaun (near Baluwatar) when the lockdown is over and it is safe to work from the office.What Does Codewing Solutions do?We are a creative digital agency. We are a product-based company rather than a service-oriented company.We have products in many niches. Two of our popular products are Rara Themes and WP Travel Engine, both based on WordPress.With millions of downloads, Rara Themes is one of the leading WordPress theme companies in the world. Similarly, WP Travel Engine is currently the world’s #1 travel booking WordPress plugin.Besides creating world-class products, we also believe in having fun at work. We work 5 days a week and, and we chill on weekends!What will you be responsible for?Working closely with the Product Strategy Team to create scalable and efficient SaaS productsFull-stack development of web applications using React and Node.js technologiesBuild high-quality products by adhering to software design, development, and testing best practicesHow qualified you should be?We are looking for developers who have proven track records and can demonstrate their skills. To be considered for this position, you should have: Minimum of 2 years of experience working with Node Js and ReactDeveloped at least 3 web applicationsStrong exposure to JavaScript, HTML5, and CSS and have a good understanding across the full client-server stack.Understanding of best practices and architecture patterns for developing Web applicationsProficient understanding of code versioning tools, such as GitStrong written and verbal communicationWhy you will love working with us?When you join our team, these are some of the perks that you get.Create digital products that will be used by thousands of people all around the worldWork with a team which has a proven record of building and scaling world-class products Fun and friendly people to work withCozy workspace with CPU, dual monitor working station, and ergonomic seating arrangement once we are back at the officeFree lunch and snacks once we are back at the officeUnlimited coffee and tea once we are back at the officeFlexible working hoursTimely performance review and annual salary reviewRecreational activitiesProvident Fund, gratuity, Dashain bonus, insurance, and paid leavesWait! Before sending your CV to us, make sure at least three of the profile matches you:I have traveled to at least 1 place in the last 1 year.I am passionate about at least one other thing apart from programming or have a hobby. Passion about programming is expected.I exercise regularly and take care of my health.I have read at least 1 book in the last 6 months.I have helped at least 1 person after the lockdown.I follow at least 1 Youtube Channel or blog regularly.Ready to Apply?If the vacancy appeals to you and matches your interest, send an email to hire@codewing.co (NOT .COM). The email should include the following:Your CV/ResumeYour Work Portfolio (can be included in CV/Resume as well)It should also include answers to at least two of the following questions:What is the last book you read and how did that change your thought process? What causes are you passionate about? What are your 5 major strengths? We’ll take it from there.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/node-js-and-react-full-stack-developer-118432"
    },
    {
        "name": ".NET Developer",
        "company": "Raindrop Inc",
        "logo": "https://img.jobsnepal.com/big/40PJheJfKq111wTKChUtt1tj5JK0jTATI5XQBbPm.jpeg",
        "vacancy": "5",
        "time": "Full Time",
        "level": "Senior Level",
        "experience": "2+ years",
        "education": "B.E. in Computer Science",
        "deadline": "23 Oct, 2020",
        "address": "Lalitpur",
        "desc": "Required: ",
        "desc1": "Bachelor's in IT, CSIT, Computer Engineering or relatedExperience of more than 2 years preferred.",
        "desc2": "Proven experience as a .NET Developer (Asp.net MVC, MVC Core, Sql Server)Must have good skill on AngularJS and Typescript.Experience with JavaScript and JQuery.Good understanding of Web Application security (Identity).Comprehensive understanding of REST/JSON/XML Web ServicesStrong knowledge of Design Patterns/Architectural Patterns.Experience using Team Foundation Server (TFS)/Git/SVNExperience working on agile/scrum teams.",
        "desc3": "﻿﻿﻿﻿﻿Post: .NET DeveloperJob SpecificationRequired: Bachelor's in IT, CSIT, Computer Engineering or relatedExperience of more than 2 years preferred.Other SpecificationPreferred Skills:Proven experience as a .NET Developer (Asp.net MVC, MVC Core, Sql Server)Must have good skill on AngularJS and Typescript.Experience with JavaScript and JQuery.Good understanding of Web Application security (Identity).Comprehensive understanding of REST/JSON/XML Web ServicesStrong knowledge of Design Patterns/Architectural Patterns.Experience using Team Foundation Server (TFS)/Git/SVNExperience working on agile/scrum teams.Job DescriptionResponsibilities:Write clean,scalable code using .NET programming languagesWork with project Managers and development leads to complete assigned tasks and with expected quality and on time.Develop documentation throughout the software development life cycle (SDLC)Collaborate with internal teams to produce software design and architect\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/net-developer-118423"
    },
    {
        "name": "Commercial Lawyer",
        "company": "Zegal",
        "logo": "https://img.nepaljobs.com/big/NdUZqwCRVgnTlf5IN8M3e2IXN8Pdbz0Q007VW8Q6.jpeg",
        "vacancy": "1",
        "time": "Full Time",
        "level": "3+ years",
        "experience": "Bachelors in Law",
        "education": "",
        "deadline": "Lalitpur",
        "address": "",
        "desc": "Founded in 2013, Zegal is the fastest growing LegalTech company operating across Asia Pacific and Europe. Today, business users and lawyers across the globe trust Zegal’s software to solve legal problems in an affordable and efficient way. Zegal has been featured in the New York Times, Forbes, and Huffington Post, and was recently recognised in the South China Morning Post as an emerging LegalTech company in the artificial intelligence space",
        "desc1": "Drafting legal contents (agreements, secretarial documents etc.) for a legal-tech companyQuality assurance of drafted legal contentsIdentifying questions that can be asked to a non-legal person to prepare a legal agreementManaging document automationQuality assurance of automated documentsEnsuring timely delivery of automated documents for clients",
        "desc2": "Bachelor's degree in law + 3 years experience.Qualified applicants must have at least a years’ experience in legal agreement drafting.",
        "desc3": "﻿﻿COMPANY OVERVIEW Companies that are connected to knowledge, their advisors, and use workflows to run their organisation are smarter and more profitable. Our mission is to make this the new normal for millions of businesses across the globe.Founded in 2013, Zegal is the fastest growing LegalTech company operating across Asia Pacific and Europe. Today, business users and lawyers across the globe trust Zegal’s software to solve legal problems in an affordable and efficient way. Zegal has been featured in the New York Times, Forbes, and Huffington Post, and was recently recognised in the South China Morning Post as an emerging LegalTech company in the artificial intelligence spaceTHE ROLEWe are looking for a Commercial Lawyer who can handle legal drafting for commercial/ business agreements, answer general legal questions from clients, and ensure the quality of the contents.This is a unique opportunity to join a passionate team developing a truly innovative and high potential business. The lawyer will work with the team to create and deliver quality legal contents throughout Hong Kong, Singapore, UK, Australia, and New Zealand via our technology platform as we update our content library in our mission to stand atop the best legal tech solution providers across the world.Job Description:Drafting legal contents (agreements, secretarial documents etc.) for a legal-tech companyQuality assurance of drafted legal contentsIdentifying questions that can be asked to a non-legal person to prepare a legal agreementManaging document automationQuality assurance of automated documentsEnsuring timely delivery of automated documents for clientsQualification:Can be any of:Bachelor's degree in law + 3 years experience.Qualified applicants must have at least a years’ experience in legal agreement drafting.Skills:Legal drafting, MS Word, MS Excel, Excellent English and communication skillsWhat you must submit with your job application/Resume: A sample agreement (draft) for supply of services between two parties.Probation: 3 monthsLocation: Based on Lalitpur, NepalApplication procedure:Interested candidates can drop their resume at content-recruitment@zegal.com\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/commercial-lawyer-118421"
    },
    {
        "name": "QA/Tester - Software Product",
        "company": "Botsplash",
        "logo": "https://img.jobsnepal.com/big/XRiD4g9bTMPyUJYrGzGkBDk4RR6TORWAlc41mAuY.png",
        "vacancy": "1",
        "time": "",
        "level": "",
        "experience": "Mid Level",
        "education": "3+ years",
        "deadline": "18 Sep, 2020",
        "address": "",
        "desc": "Requirements",
        "desc1": "Experience with software product testing of CRM or B2B platforms or large software applicationsExcellent communication skills with ability to prioritize important features and bugsUnderstand user empathy and product experienceWorked with cross-browser, mobile app or API testingFull time with normal day hours and a limited overlap with US Eastern timezone",
        "desc2": "Competitive payWork directly with global and talented team (we are not an agency)Own the product testing and ability to learn and grow into newer roles5 day work week, Work from home or coworking office space in 2021 (after Covid 19 easing)Laptop and office supplies",
        "desc3": "﻿﻿﻿﻿﻿﻿We\n are looking for an experienced Software Manual QA/Tester for the \nBotsplash platform.The ideal candidate is a self-starter, independent and analytical. Requirements Experience with software product testing of CRM or B2B platforms or large software applicationsExcellent communication skills with ability to prioritize important features and bugsUnderstand user empathy and product experienceWorked with cross-browser, mobile app or API testingFull time with normal day hours and a limited overlap with US Eastern timezone Benefits Competitive payWork directly with global and talented team (we are not an agency)Own the product testing and ability to learn and grow into newer roles5 day work week, Work from home or coworking office space in 2021 (after Covid 19 easing)Laptop and office supplies About the company Botsplash\n is a software as a service business based in North Carolina, USA. We are an omni-channel \nsoftware messaging platform, focused at improving digital engagement between \nenterprises and their customers.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/qa-tester-software-product-118371"
    },
    {
        "name": "Link and Relationship Building (SEO) Intern",
        "company": "Codewing Solutions Pvt. Ltd.",
        "logo": "https://img.jobsnepal.com/big/zcp2EVoF66Ta9u0U0TeekJ80HMHeyutMPKPYxeTj.jpeg",
        "vacancy": "1",
        "time": "Intern",
        "level": "Intern / Trainees",
        "experience": "Fresh Graduate",
        "education": "Please check vacancy details",
        "deadline": "14 Oct, 2020",
        "address": "Kathmandu",
        "desc": "You will be working directly with our SEO Team to assist in link acquisition for all SEO projects and execution of all link building tasks.",
        "desc1": "Qualify websites for potential link opportunitiesDevelop and execute strategies to acquire backlinks that will positively impact organic search visibilityPush email outreach campaigns for link building and influencer marketingMaintain relationship with partnersRegularly track and monitor new and existing links using Google Webmaster Tools and Ahref.",
        "desc2": "A minimum Bachelor’s degree, IT Specialization is preferredLong term career plan in the SEO SectorProficient in Google Drive, MS Office; knowledge of basic SEO is a plusPeople skills, enthusiastic to learn and growStrong ethics and reliability.Excellent verbal and written communication skills",
        "desc3": "﻿﻿﻿﻿﻿﻿﻿Are you passionate about SEO? Keep reading!Codewing Solutions is looking for a Relationship Manager and Link Builder (SEO) Intern to join our team. The internship will be for a period of 3 months.You will be working directly with our SEO Team to assist in link acquisition for all SEO projects and execution of all link building tasks.If you are hired, you will work remotely but are expected to work from our office in Hadigaun (near Baluwatar) when the lockdown and transportation is eased.What Does Codewing Solutions do?We are a creative digital agency. We are a product-based company rather than a service-oriented company.We have products in many niches. Two of our popular products are Rara Themes and WP Travel Engine, both based on WordPress. Besides creating world-class products, we also believe in having fun at work. We work 5 days a week and we chill on weekends!What will you be responsible for?You will be responsible for but not limited to:Qualify websites for potential link opportunitiesDevelop and execute strategies to acquire backlinks that will positively impact organic search visibilityPush email outreach campaigns for link building and influencer marketingMaintain relationship with partnersRegularly track and monitor new and existing links using Google Webmaster Tools and Ahref.How qualified you should be?A minimum Bachelor’s degree, IT Specialization is preferredLong term career plan in the SEO SectorProficient in Google Drive, MS Office; knowledge of basic SEO is a plusPeople skills, enthusiastic to learn and growStrong ethics and reliability.Excellent verbal and written communication skillsWhy you will love working with us?When you join our team, these are some of the perks that you get.Work with a team which has a proven record of building and scaling world-class productsFun and friendly people to work withFree lunch and snacks during work from the officeUnlimited coffee and tea during work from the officeFlexible working hoursRecreational activitiesWait! Before sending your CV to us, make sure at least three of the profile matches you :I have traveled to at least 1 place in the last 1 year.I am passionate about at least one other thing apart from SEO or have a hobby. I exercise regularly and take care of my health.I have read at least 1 book in the last 6 months.I have helped at least 1 person after the lockdown.Ready to Apply?If the vacancy appeals to you and matches your interest, send an email to hire@codewing.co (NOT .COM). The email should include the following:Your updated CV/ResumeAnswers to at least two of the following questions:What is the last book you read and how did that change your thought process? Why are you passionate about SEO?What are your 5 major strengths? We’ll take it from there.\n\n                            \n                                                                                                \n                                    \n\n                                \n                                                                \n                                                                \n                                    \n                                        Save to favorite\n                                    \n                                \n                                                                \n                                     Refer\n                                        to a friend",
        "Page_URL": "https://www.jobsnepal.com/link-and-relationship-building-seo-intern-118349"
    }
]
