[{"name": "IT Support Social Media Handler", "company": "Elite Network & Communication Pvt. Ltd.", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "deadline": " Dec 05, 2020", "experience": "2 Years", "level": "Mid Level", "salary": "26,000  / month", "desct": "about usElite Network & Communication Pvt. Ltd. is one of the leading system integrator and IT equipment supplier. It has been providing its services to leading financial institutions, INGO, Gov Agency and Manufacturing industries.IT Support Social Media HandlerJobs Function:IT & TelecommunicationJobs Availability:Full TimeJobs Level:Mid LevelOffered Salary:26,000  / monthJobs Location:KathmanduMin. Experience Year:2 YearsEducation Degree:BachelorNo. of Openings:1Deadline:Saturday, Dec 05, 2020(6 days left)Preferred Gender:Anyjob descriptionVacancy Announcement !!!We are hiring IT graduates for the position ofIT Support Social Media Handler.Interested candidates can view the details and apply.Details:Position:IT Support Social Media HandlerNo. of requirements: 1Qualification: Bachelors in IT.Experience: Minimum 2 year requiredJob Location: Naxal,KathmanduSalary: Nrs.26000/Job DescriptionDesigns, builds, and maintains our social media presence.Brainstorms new and creative growth strategies through digital marketing.Plans and executes all web, email, social media campaigns.Handling client queries, Quotation, Report preparation and submission to clients .Follow up with client for their requirement .Visit client if required.Update website and products as required.Apply Instruction:Interested candidates are requested to send their updated resume atapsara@kantipurmanagement.comby mentioning position applied.Apply NowShare JobAdd To Basketrelated jobsIT OfficerKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowData AnalystKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowRegional Project LeadDish Media Network  LtdFull TimeBachelorDec 13, 2020Apply Now", "Page_URL": "https://kantipurjob.com/job/detail/it-support-cum-social-media-handler", "websitename": "kantipurjob.com"}, {"name": "Regional Project Lead", "company": "Dish Media Network  Ltd", "vacancy": "1", "time": "Full Time", "address": "Itahari", "deadline": " Dec 13, 2020", "experience": "2 Years", "level": "Mid Level", "salary": "Negotiable", "desct": "about usDish Media Limited is one of the fastest-growing operators of Nepal’s broadcast and transmission services industry for digital television channels.Regional Project LeadJobs Function:IT & TelecommunicationJobs Availability:Full TimeJobs Level:Mid LevelOffered Salary:NegotiableJobs Location:ItahariMin. Experience Year:2 YearsEducation Degree:BachelorNo. of Openings:1Deadline:Sunday, Dec 13, 2020(14 days left)Preferred Gender:Anyjob descriptionManage daily operation of the unit and maintain efficiency in the team.Problem analysis and escalate to concern department for solution.Ensure high productivity from the team.Operate Outbound calls campaign efficiently.Maintain attendance and occupancy of all agents in the unit.Reporting of the daily operations.Coordination with concerned departments for updates and resolving issues.Job SpecificationGood interpersonal skills and a team player.Computer literacy (Ms. Office).Problem solving skills with innovative ideas.Handling of team members with confidence.Able to handle pressure and deal with unfamiliar circumstances.Other Specific RequirementApply Instruction:Interested candidates are requested to send their CVs along with cover letter athr@dishhome.com.npby mentioning position applied.Apply NowApply EmailShare JobAdd To Basketrelated jobsIT OfficerKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowData AnalystKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowIT Support cum Social Media HandlerElite Network & Communication Pvt. Ltd.Full TimeBachelorDec 05, 2020Apply Now", "Page_URL": "https://kantipurjob.com/job/detail/regional-project-lead", "websitename": "kantipurjob.com"}, {"name": "IT Officer", "company": "Kantipur Management Pvt Ltd", "vacancy": "3", "time": "Full Time", "address": "Kumaripati, Lalitpur", "deadline": " Dec 10, 2020", "experience": "1 Years", "level": "Mid Level", "salary": "Negotiable", "desct": "about usKantipur Management Private Limited (KMPL) is an expertise on human resources solutions and has been providing Human Resource Management and related solutions to organizations across the country since 2012. The company is involved in committed to provide the best services to clients and job seekers in different field and profession of varied diversity of candidates from entry level associates, mid-level managers to first level managers.IT OfficerJobs Function:IT & TelecommunicationJobs Availability:Full TimeJobs Level:Mid LevelOffered Salary:NegotiableJobs Location:Kumaripati, LalitpurMin. Experience Year:1 YearsEducation Degree:BachelorNo. of Openings:3Deadline:Thursday, Dec 10, 2020(11 days left)Preferred Gender:Anyjob descriptionPerforming basic and intermediate level technical troubleshooting for IT issues/problems as per the scope defined.Keeping track of the issues through to resolution (if the issue can be resolved within the scope of the 1st Level), within agreed time limits.Escalate complex incidents to appropriate 2nd line or 3rd line IT Support teams.Gathering and documenting as much information as possible for the escalation teams to perform advanced investigation on the issue.Provide both remote and on-premise desktop level technical support (if required) including troubleshooting Windows, Linux and MAC OS environments, installing and upgrading software and configuring systems and applications.Provide technical and administrative assistance for all IT managed On-premise or SAAS based solutions or applications.Responsible for planning and organizing daily workload. This includes prioritizing service calls and adjusting work plans to support high priority calls to meet operational requirements.Responsible for ensuring that all IT policies and procedures are followed.Adhere to the IT security and compliance processes in line with Company’s policies and regulations.Follow IT procedures, maintain documentations and standards and contribute to IT assets.The post holder should be aware of the legislation behind data protection within their jurisdiction and follow relevant regulations and codes of practice to ensure appropriate action is taken to safeguard confidential information.Be available to team members to provide direction and communication.Consistently monitor the network and system’s bandwidth and traffic.Job SpecificationInstall and configure computer hardware, Switches, Routers, Operating systems and applicationsMonitor and maintain computer systems and networksShould talk to the staffs or clients through a series of actions, either face to face or over phone, to help setting up a system and to resolve the issuesTroubleshoot the systems and network problems, diagnosing and solving hardware or software faultsProvide support, including procedural documentation and relevant reportsFollow diagrams and written instructions to repair a fault or set up a systemSupport a roll-out of new applicationsResponding in a timely manner to service issues and requestsSet up new users accounts and profiles and deal with password issuesRespond within agreed time limits to call-outsWork continuously on a task until completion (or referral to third parties if appropriate)Prioritize and manage many open cases at one timeRapidly establish a good working relationship with customers and other professionals; such as software developersTest and evaluate new technologyConduct electrical safety checks on computer equipmentBasic knowledge on graphic designingEducation descriptionBachelors Degree in Information Technology or Computer ScienceOther Specific RequirementRemote and On-premise technical support for Windows/Linux/MAC environmentsDesktop ApplicationsKnowledge of Asterisk server, Windows server, Firewall, Cisco Switches and Routers.Internet technologies (WWW \\ FTP \\ EMAIL \\VPN etc.)Basic Networking protocols TCP/IPHands-on experience working in one or more ITSM toolsetsGood verbal and written communication skills (English)Ability to work under pressure efficiently.Ability to multitask, prioritize and manage workload.Self-motivated and self-reliant with ability to work independently.Apply Instruction:Intersted candidates meeting mentioned criteria are requested to send their CV atsimran@kantipurmanagement.comby mentioning position applied.Apply EmailShare JobAdd To Basketrelated jobsData AnalystKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowRegional Project LeadDish Media Network  LtdFull TimeBachelorDec 13, 2020Apply NowIT Support cum Social Media HandlerElite Network & Communication Pvt. Ltd.Full TimeBachelorDec 05, 2020Apply Now", "Page_URL": "https://kantipurjob.com/job/detail/it-officer-17", "websitename": "kantipurjob.com"}, {"name": "Data Analyst", "company": "Kantipur Management Pvt Ltd", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "deadline": " Dec 10, 2020", "experience": "2 Years", "level": "Mid Level", "salary": "Negotiable", "desct": "about usKantipur Management Private Limited (KMPL) is an expertise on human resources solutions and has been providing Human Resource Management and related solutions to organizations across the country since 2012. The company is involved in committed to provide the best services to clients and job seekers in different field and profession of varied diversity of candidates from entry level associates, mid-level managers to first level managers.Data AnalystJobs Function:IT & TelecommunicationJobs Availability:Full TimeJobs Level:Mid LevelOffered Salary:NegotiableJobs Location:LalitpurMin. Experience Year:2 YearsEducation Degree:BachelorNo. of Openings:1Deadline:Thursday, Dec 10, 2020(11 days left)Preferred Gender:Anyjob descriptionManaging master data, including creation, updates, and deletion.Managing users and user roles.Provide quality assurance of imported data, working with quality assurance analyst if necessary.Commissioning and decommissioning of data sets.Processing confidential data and information according to guidelines.Helping develop reports and analysis.Managing and designing the reporting environment, including data sources, security, and metadata.Supporting the data warehouse in identifying and revising reporting requirements.Supporting initiatives for data integrity and normalization.Assessing tests and implementing new or upgraded software and assisting with strategic decisions on new systems.Generating reports from single or multiple systems.Troubleshooting the reporting database environment and reports.Evaluating changes and updates to source production systems.Training end users on new reports and dashboards.Providing technical expertise on data storage structures, data mining, and data cleansing.Job SpecificationBachelor’s degree in computer science/Information Technology.Work experience as a data analyst or in related field.Ability to work with stakeholders to assess potential risks.Ability to analyze existing tools and databases and provide software solution recommendations.Ability to translate business requirements into non-technical, lay terms.High-level experience in methodologies and processes for managing large scale databases.Demonstrated experience in handling large data sets and relational databases.Understanding of addressing and metadata standards.High-level written and verbal communication skills.Education descriptionBachelor’s degree in computer science/Information Technology.Apply EmailShare JobAdd To Basketrelated jobsIT OfficerKantipur Management Pvt LtdFull TimeBachelorDec 10, 2020Apply NowRegional Project LeadDish Media Network  LtdFull TimeBachelorDec 13, 2020Apply NowIT Support cum Social Media HandlerElite Network & Communication Pvt. Ltd.Full TimeBachelorDec 05, 2020Apply Now", "Page_URL": "https://kantipurjob.com/job/detail/data-analyst-3", "websitename": "kantipurjob.com"}]