[
    {
        "name": "ETL Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Verisk Nepal Verisk Nepal Software Companies",
        "address": "Kathmandu",
        "days_left": "Days Left : 27 days left",
        "vacancy": "4",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-11-06",
        "desc": "1+ years of overall industry experience with experience in ETL design/development Experience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting Experience with ETL tools and processes (Pentaho/PDI preferred) Experience or Knowledge in Data masking and Data integrity check Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc. Experience in writing advanced SQL scripts Experience or Knowledge in AWS Services Experience working in an Agile development process Excellent problem solving and data analysis skills Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features Demonstrated ability to work independently with minimal supervision Good communication skill in verbal and written Ability to troubleshoot and maintain mid-level to complex applications",
        "desc1": "Support, development and data operation workload Coordinate and communicate effectively with team members and various stakeholders Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements Identify and test for bugs and bottlenecks in the ETL solution Ensure the best possible performance and quality in the packages Participate in different support activities",
        "desc2": "Job Description    Other Specification    1+ years of overall industry experience with experience in ETL design/development Experience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting Experience with ETL tools and processes (Pentaho/PDI preferred) Experience or Knowledge in Data masking and Data integrity check Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc. Experience in writing advanced SQL scripts Experience or Knowledge in AWS Services Experience working in an Agile development process Excellent problem solving and data analysis skills Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features Demonstrated ability to work independently with minimal supervision Good communication skill in verbal and written Ability to troubleshoot and maintain mid-level to complex applications       Job Description   Support, development and data operation workload Coordinate and communicate effectively with team members and various stakeholders Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements Identify and test for bugs and bottlenecks in the ETL solution Ensure the best possible performance and quality in the packages Participate in different support activities",
        "Page_URL": "https://www.kumarijob.com/recentjob/etl-developer/28868"
    },
    {
        "name": "Dot Net Developer : VN",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Verisk Nepal Software Companies",
        "address": "Kathmandu",
        "days_left": "Days Left : 11 days left",
        "vacancy": "2",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-21",
        "desc": "Have strong sense of ownership with demonstrated ability to work independently Be focused, passionate, and strive to find simple solutions to complex problems Have previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applications Experience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders. Knowledge of cloud-based applications would be a strong plus point Experience working with large-scale production systems and/or data platforms Experience leading a development effort, including mentoring younger developers Experience interfacing with external groups, product managers, partners, customers Be comfortable working in a dynamic environment Excellent communication skills (written and verbal)",
        "desc1": "",
        "desc2": "Job Description    Other Specification   Role and Required Skills :  Have strong sense of ownership with demonstrated ability to work independently Be focused, passionate, and strive to find simple solutions to complex problems Have previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applications Experience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders. Knowledge of cloud-based applications would be a strong plus point Experience working with large-scale production systems and/or data platforms Experience leading a development effort, including mentoring younger developers Experience interfacing with external groups, product managers, partners, customers Be comfortable working in a dynamic environment Excellent communication skills (written and verbal)  Skills and Qualifications:  BS/MS degree in Computer Science, Engineering or a related subject At least 1 years full-time work experience with good knowledge of AWS environment     Strong ability to build RESTful services in C# with .NET/.NET Core and Python (nice to have) .Net Frameworks 4.5+ and .Net Core 2.0+ SQL and NoSQL databases (preferably PostgreSQL and/or DynamoDB), Elasticsearch Proficient in SQL and relational database concepts Experience or Knowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus point Preferably certified in AWS skills         Job Description   Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world! In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.  Design and develop high performance software libraries and APIs Implement highly scalable, performant, fault tolerant processing systems in an AWS environment Be involved in all phases of the agile software development lifecycle Work with our Product teams to gather detailed requirements for new products, services & tools. Proactively seek out and minimize pain points within the infrastructure and code base Keep up-to-date with the latest technologies and introduce them as needed Create next-gen solutions for unique and challenging use cases Lead a team of junior developer(s), provide guidance and mentorship",
        "Page_URL": "https://www.kumarijob.com/recentjob/dot-net-developer-vn/28867"
    },
    {
        "name": "Hybrid Mobile Apps Engineer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Pioneer Associate Information / Computer / Technology",
        "address": "Kathmandu",
        "days_left": "Days Left : 2 days left",
        "vacancy": "5",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-12",
        "desc": "",
        "desc1": "BE, BSCIT, Bachelor Degree in IT related field. 1+ years of experience in mobile app development. Communication skill with strong quantitative background. Competent, smart, result-oriented and self-motivated. Ability to work well in a team.",
        "desc2": "Job Description Qualifications  BE, BSCIT, Bachelor Degree in IT related field. 1+ years of experience in mobile app development. Communication skill with strong quantitative background. Competent, smart, result-oriented and self-motivated. Ability to work well in a team.  Knowledge & Skills   Programming skill in phonegap, ionic, flutter, javascript, jquery, angular js. Knowledge and experience of MVC.NET. Knowledge of MVC and API will be an added advantage. Knowledge working with code repositories (SVN Git).",
        "Page_URL": "https://www.kumarijob.com/recentjob/hybrid-mobile-apps-engineer/28863"
    },
    {
        "name": "App Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Muncha.com Information / Computer / Technology",
        "address": "Ekantakuna, Lalitpur",
        "days_left": "Days Left : 25 days left",
        "vacancy": "1",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-11-04",
        "desc": "Experience: A year of experience in flutter Skills: Dart & OOP Concepts Knowledge: Git & git-hub or any other version control tools Can develop application for Android and iOS platform Additional experience in software development would be more beneficial Proficiency with HTML, CSS, JavaScript, React.Js Solid understanding of object-oriented programming, functional programming, and design patterns Excellent communication skills, with a focus on clear and proactive communication Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web-capable devices and browsers",
        "desc1": "Develop the best technical design and approach for new products or technologies Familiarity with code versioning tools such as GIT Diagnose and fix bugs and performance bottlenecks Identify project risks and clearly communicate risks and expectations to your team members and your management Communicate proactively with clients regarding projects’ status and progress Stay aware of industry trends and use these to make informed technology choices and strategic decisions",
        "desc2": "Job Description    Other Specification    Experience: A year of experience in flutter Skills: Dart & OOP Concepts Knowledge: Git & git-hub or any other version control tools Can develop application for Android and iOS platform Additional experience in software development would be more beneficial Proficiency with HTML, CSS, JavaScript, React.Js Solid understanding of object-oriented programming, functional programming, and design patterns Excellent communication skills, with a focus on clear and proactive communication Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web-capable devices and browsers       Job Description   Develop the best technical design and approach for new products or technologies Familiarity with code versioning tools such as GIT Diagnose and fix bugs and performance bottlenecks Identify project risks and clearly communicate risks and expectations to your team members and your management Communicate proactively with clients regarding projects’ status and progress Stay aware of industry trends and use these to make informed technology choices and strategic decisions",
        "Page_URL": "https://www.kumarijob.com/recentjob/app-developer/28859"
    },
    {
        "name": "Web Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Muncha.com Information / Computer / Technology",
        "address": "Ekantakuna, Lalitpur",
        "days_left": "Days Left : 25 days left",
        "vacancy": "1",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-11-04",
        "desc": "Experience: A year of experience in Backend Development Skill: Php (Laravel Preffered), Vuejs, Mysql & Nodejs Must have knowledge in Git & Git- hub or any other version control tools",
        "desc1": "Web-based chat application development and maintenance Develop, troubleshoot and enhance cutting edge web applications Frameworks - Laravel Payment gateway integration and maintenance Source Version Control (git preferred, svn, cvs)",
        "desc2": "Job Description    Other Specification    Experience: A year of experience in Backend Development Skill: Php (Laravel Preffered), Vuejs, Mysql & Nodejs Must have knowledge in Git & Git- hub or any other version control tools       Job Description   Web-based chat application development and maintenance Develop, troubleshoot and enhance cutting edge web applications Frameworks - Laravel Payment gateway integration and maintenance Source Version Control (git preferred, svn, cvs)",
        "Page_URL": "https://www.kumarijob.com/recentjob/web-developer/28858"
    },
    {
        "name": "Team Lead(Cloud)",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/02.png",
        "company": "Bottle Technology Pvt. Ltd",
        "address": "Kupondole, Lalitpur, Nepal.",
        "days_left": "",
        "vacancy": "1",
        "experience": "Min 2 years of experience",
        "level": "IT&Telecommunication",
        "time": "Senior Level",
        "salary": "60,000 month",
        "education": "Bachelor Graduates",
        "deadline": "2020-10-20",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/premiumjob/team-leadcloud/28849"
    },
    {
        "name": "Project Manager",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/02.png",
        "company": "Bottle Technology Pvt. Ltd",
        "address": "Kupondole, Lalitpur, Nepal.",
        "days_left": "",
        "vacancy": "1",
        "experience": "At least 2 years of software project management experience in an agile environment.",
        "level": "IT&Telecommunication",
        "time": "Mid Level",
        "salary": "Negotiable month",
        "education": "Bachelor's degree in Computer Science graduate or equivalent. A Master's degree is preferable",
        "deadline": "2020-10-20",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/premiumjob/project-manager/28848"
    },
    {
        "name": "Senior .Net Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Eightsquare Information / Computer / Technology",
        "address": "Kathmandu",
        "days_left": "Days Left : 22 days left",
        "vacancy": "2",
        "experience": "Four year or above",
        "level": "Senior Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-11-01",
        "desc": "Strong knowledge of .NET web framework  Must have and ample knowledge on front end development (especially Vue, Angular...). Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiarity with Microsoft SQL Server and design/architectural patterns Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Attention to detail Experience creating database schemas that represent and support business processes Experience implementing automated testing platforms and unit tests Proficient understanding of code versioning tools such as Git, SVN, and Mercurial Some knowledge in node js, MongoDB and Redis ",
        "desc1": "Supporting the technical design process by participating in the analysis of technical application requirements Writing scalable code for .NET software applications Reviewing, debugging and upgrading existing .NET web and applications Providing support and training for junior developers Coding and testing program modules; assisting in design by collaborating with internal team Drafting software and application operating procedures Test and deploy applications and systems Develop documentation throughout the software development life cycle (SDLC) Participating in execution and documentation of tests Drive the delivery quality system utilizing automated unit testing, TDD and performance testing Collaborate with internal team to identify pain points, develop solutions and evangelize best practice",
        "desc2": "Job Description    Other Specification    Strong knowledge of .NET web framework  Must have and ample knowledge on front end development (especially Vue, Angular...). Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiarity with Microsoft SQL Server and design/architectural patterns Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Attention to detail Experience creating database schemas that represent and support business processes Experience implementing automated testing platforms and unit tests Proficient understanding of code versioning tools such as Git, SVN, and Mercurial Some knowledge in node js, MongoDB and Redis        Job Description   Supporting the technical design process by participating in the analysis of technical application requirements Writing scalable code for .NET software applications Reviewing, debugging and upgrading existing .NET web and applications Providing support and training for junior developers Coding and testing program modules; assisting in design by collaborating with internal team Drafting software and application operating procedures Test and deploy applications and systems Develop documentation throughout the software development life cycle (SDLC) Participating in execution and documentation of tests Drive the delivery quality system utilizing automated unit testing, TDD and performance testing Collaborate with internal team to identify pain points, develop solutions and evangelize best practice  Company Benefits:  Competitive Remuneration Timely Appraisal and Pay Upgradation Sophisticated Infrastructure Medical insurance inclusive Spouse, Parents & Children Accidental and Term Life Insurance Festival Allowance Onsite Engagement with Multination International Travel Exposure and Allowance. Technical and Soft Skills Trainings. Retreat Programs",
        "Page_URL": "https://www.kumarijob.com/recentjob/senior-net-developer/28833"
    },
    {
        "name": "Android Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "EBPearls Information / Computer / Technology",
        "address": "Kandevsthan",
        "days_left": "Days Left : 7 days left",
        "vacancy": "1",
        "experience": "Upto two years",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-17",
        "desc": "University Bachelor's degree in Computer Engineering or equivalent in relevant stream Minimum 2 years of professional work experience in software development using technologies: Java/Kotlin",
        "desc1": "Understand the project requirements clearly. Generate queries in case there is any confusion in understanding the project. Discuss any technical challenges that might come affront while working on the project. Realize the project delivery date and understand the communication channels. Write codes to develop a quality product on time. Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager. Verify the product with SRS.",
        "desc2": "Job Description    Other Specification   Qualifications Required  University Bachelor's degree in Computer Engineering or equivalent in relevant stream Minimum 2 years of professional work experience in software development using technologies: Java/Kotlin  Skills Required  Experience in Kotlin/ Java (extensions, data classes, sealed classes, objects and basics of coroutines, Lambda & higher order functions) Strong knowledge of MVC, MVVM, Architecture component and memory management Strong knowledge of ROOM models and define relationships, access dates using DAO's Experience with offline storage, threading, and performance tuning Experience with Android Studio, Android Components and UI Component, Animation & Design Guidelines High-caliber proficiency in Android SDK and experience with third-party SDKs and APIs Strong coding and analytical skills  Skills Preferred  Understanding of Android Coding Architecture & Patterns Strong knowledge of Problem breakdown into multiple functions Strong knowledge of SQLLite and able to perform CRUD operations, JOINs and proficient in RDBMS. Experience with Testing & Debugging (unit testing, UI testing and automation) Experience with RESTful web services and parsing JSON/XML Fluency with XCode, JIRA, GIT and other common software development tools Strong software engineering skills, can design and implement software projects from the ground up. Understanding of the full mobile development life cycle Good understanding of OOPS concepts, and Design pattern       Job Description  Position Overview Are you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award winning Android App Development team? We are looking for Android Developers who will be a responsible member of the Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. Android developer reports directly to the Project Manager and is accountable for the Project Development. Job Roles and Responsibilities: 1. Project Accountability  Understand the project requirements clearly. Generate queries in case there is any confusion in understanding the project. Discuss any technical challenges that might come affront while working on the project. Realize the project delivery date and understand the communication channels. Write codes to develop a quality product on time. Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager. Verify the product with SRS.  2. Adapt to EB Work Culture  Attend project meetings conducted by Project Manager with full preparation by studying the project documents and information. Follow company coding standards.  3. Team Coordination  Take ownership of the project from planning to the delivery of the project. Be easily approachable and flexible in work.  Perks and Benefits We strive to make sure that our people are comfortable, happy and growing at EB Pearls. We offer:  Insurance: We enroll our employees in the company's group insurance policy that covers both medial and accidental insurance. Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standards Timely performance appraisal and salary reviews: We conduct bi yearly performance review to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to compliment. Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays. Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our people Social Security Fund: SSF is a contribution based social security scheme, the employee contributes 11 % and the employer adds 20% of the basic salary per month( 31% of the basic salary of employee) every month. Festival Allowance: We have the provision of festival allowance and provide Dashain bonus which is based on the amount of employees’ basic salary. Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly. Work on next generation technology projects Work with leading edge technology  Fun At EB All work and no play is not our cup of tea. At EB, we enjoy:  Office Events: Chat and Chew, Residential Annual Event, Team Lunch Out EEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out events Food and Coffee: Office Provided lunch and stocked pantry Inspiring Colleagues: Fun and friendly work environment with brilliant one of a kind team",
        "Page_URL": "https://www.kumarijob.com/recentjob/android-developer/28832"
    },
    {
        "name": "iOS Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "EBPearls Information / Computer / Technology",
        "address": "Kandevsthan",
        "days_left": "Days Left : 7 days left",
        "vacancy": "1",
        "experience": "Upto two years",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-17",
        "desc": "University Bachelor's degree in Computer Engineering or equivalent in relevant stream  Minimum 2 years of relevant professional work experience",
        "desc1": "Understand the project requirements clearly. Generate queries in case there is any confusion in understanding the project. Discuss any technical challenges that might come affront while working on the project. Realize the project delivery date and understand the communication channels. Write codes to develop a quality product on time. Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager. Verify the product with SRS.",
        "desc2": "Job Description    Other Specification   Qualifications Required  University Bachelor's degree in Computer Engineering or equivalent in relevant stream  Minimum 2 years of relevant professional work experience  Skills Required  Experience with Objective-C/Swift, with full command of the Cocoa Touch Framework Experience with Core Framework like Core Graphics, Core Location, Core Animation Strong knowledge of CoreData, ORM and RDBMS concepts Experience with RESTful web services and parsing JSON/XML Experience with reactive programming Experience with dependency management tools like: Cocoapods, SPM and commands related to Cocoapods dependency manager Experience with breakpoints and inspection, LLDB commands Experience with concept of threads management Fluency with Xcode, JIRA, GIT Strong knowledge of MVC, MVVM, Architecture component and memorymanagement Understanding of the full mobile development life cycle Strong coding and analytical skills Good understanding of OOPS concepts, and Design patterns Strong coding and analytical skills  Skills Preferred  Should be able to integrate 3rd party library manually Professional experience with deployment, Apple Store policies Strong software engineering skills, can design and implement software projects from the ground up.       Job Description  Position Overview Are you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award winning iOS App Development team? We are looking for iOS Developers who will be a responsible member of the Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. iOS developer reports directly to the Project Manager and is accountable for the Project Development. Job Roles and Responsibilities 1. Project Accountability  Understand the project requirements clearly. Generate queries in case there is any confusion in understanding the project. Discuss any technical challenges that might come affront while working on the project. Realize the project delivery date and understand the communication channels. Write codes to develop a quality product on time. Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager. Verify the product with SRS.  2. Adapt to EB Work Culture  Attend project meetings conducted by Project Manager with full preparation by studying the project documents and information. Follow company coding standards.  3. Team Coordination  Take ownership of the project from planning to the delivery of the project. Be easily approachable and flexible in work.  Perks and Benefits We strive to make sure that our people are comfortable, happy and growing at EB Pearls. We offer:  Insurance: We enroll our employees in the company's group insurance policy that covers both medial and accidental insurance. Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standards Timely performance appraisal and salary reviews: We conduct bi yearly performance review to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to compliment. Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays. Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our people Social Security Fund: SSF is a contribution based social security scheme, the employee contributes 11 % and the employer adds 20% of the basic salary per month( 31% of the basic salary of employee) every month. Festival Allowance: We have the provision of festival allowance and provide Dashain bonus which is based on the amount of employees’ basic salary. Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly. Work on next generation technology projects Work with leading edge technology  Fun At EB All work and no play is not our cup of tea. At EB, we enjoy:  Office Events: Chat and Chew, Residential Annual Event, Team Lunch Out EEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out events Food and Coffee: Office Provided lunch and stocked pantry Inspiring Colleagues: Fun and friendly work environment with brilliant one of a kind team",
        "Page_URL": "https://www.kumarijob.com/recentjob/ios-developer/28831"
    },
    {
        "name": "Assist. System and Network Admin",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/111171.jpg",
        "company": "FOCUSONE Payment Solutions Pvt.Ltd.",
        "address": "DD Plaza, 4th Floor, Kamaladi, Kathmandu",
        "days_left": "",
        "vacancy": "2",
        "experience": "At Least 1 year",
        "level": "IT&Telecommunication",
        "time": "Negotiable month",
        "salary": "BS Degree in Computer Science, Engineering or a related subject",
        "education": "2020-10-15",
        "deadline": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/premiumjob/assist-system-and-network-admin/28823"
    },
    {
        "name": "JavaScript Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Gentech Gentech Software Companies",
        "address": "Naxal, Nagpokhari",
        "days_left": "Days Left : Expire Today",
        "vacancy": "2",
        "experience": "Upto two years",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-10",
        "desc": "",
        "desc1": "At least 2 years of work experience in Software Development using JavaScript  Strong knowledge in building web apps using Node.js Must have good idea of OOP, Algorithm and at least one Relational Database Management System. Good knowledge of Messaging Queue is expected. Strong experience in a front-end JS/Typescript library. Primary: ReactJS. Experience with Linux based system, and docker is desirable Theoretical and practical knowledge of MS SQL, My SQL databases with hands-on experience in at least one database system. Good knowledge on version control tools such as Git. Preferably contribution to open source projects or shareable public repositories. Strong knowledge on business processes and business application Innovator in adapting new technologies.  Should have good English communication and writing skills with good command.  Familiarity with Project Management tools.  Ability to integrate third-party services. Ability to follow agile principles and processes. Strong understanding of Data Structure and Algorithms Strong understanding of Object-Oriented Programming concepts Should have knowledge of Linux/Windows with system troubleshooting capabilities Hands-on knowledge on deployment process Highly self-motivated, flexible, and collaborative, with an eagerness to learn Ability to work independently or in a collaborative environment with a proactive attitude Should be regular, reliable attendance is a requirement for this job",
        "desc2": "Job Description Required Skills/Competencies:  At least 2 years of work experience in Software Development using JavaScript  Strong knowledge in building web apps using Node.js Must have good idea of OOP, Algorithm and at least one Relational Database Management System. Good knowledge of Messaging Queue is expected. Strong experience in a front-end JS/Typescript library. Primary: ReactJS. Experience with Linux based system, and docker is desirable Theoretical and practical knowledge of MS SQL, My SQL databases with hands-on experience in at least one database system. Good knowledge on version control tools such as Git. Preferably contribution to open source projects or shareable public repositories. Strong knowledge on business processes and business application Innovator in adapting new technologies.  Should have good English communication and writing skills with good command.  Familiarity with Project Management tools.  Ability to integrate third-party services. Ability to follow agile principles and processes. Strong understanding of Data Structure and Algorithms Strong understanding of Object-Oriented Programming concepts Should have knowledge of Linux/Windows with system troubleshooting capabilities Hands-on knowledge on deployment process Highly self-motivated, flexible, and collaborative, with an eagerness to learn Ability to work independently or in a collaborative environment with a proactive attitude Should be regular, reliable attendance is a requirement for this job  Application Requirement:  Cover Letter Detailed CV Citizenship Copy Experience Letter or Reference Letter",
        "Page_URL": "https://www.kumarijob.com/recentjob/javascript-developer/28815"
    },
    {
        "name": "Project Manager",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "AlphaBetaTheta Technologies Software Companies",
        "address": "Kathmandu",
        "days_left": "Days Left : 20 days left",
        "vacancy": "1",
        "experience": "Upto two years",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-30",
        "desc": "Minimum of two (2) years Project Management experience Solid knowledge of SDLC process and deep understanding of how a software development project works  Good understanding of Agile and Kanban methodologies  PMP certification preferred Six Sigma certification preferred Strong conceptual understanding of technology and tools including, but not limited to, ReactJS, C#, Adobe XD, Azure and QA processes Demonstrates a commitment to quality and risk awareness Strong presentation and communication skills   Excellent verbal and written communication skills Strong interpersonal skills with the ability to communicate and engage all levels of the organization including senior management and executive committee Proven ability to solve problems creatively  Strong familiarity with project management software tools, methodologies, and best practices  Strong knowledge of Kanban or Agile project management methodology  Experience seeing projects through the full life cycle  Excellent analytical skills  Strong interpersonal skills and extremely resourceful  Proven ability to complete projects according to outlined scope, budget, and timeline ",
        "desc1": "Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completion Acts as the central point of contact for project-related activities Breakdown the requirements and assign individual team members Actively participate in all stages of SDLC from requirement to delivery Facilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverables Manages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channels Forms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departments Manages conflicting points of views to arrive at creative and responsive solutions.  Influences completion of project activities through dotted line relationships Manages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industry Other duties as assigned",
        "desc2": "Job Description    Other Specification    Minimum of two (2) years Project Management experience Solid knowledge of SDLC process and deep understanding of how a software development project works  Good understanding of Agile and Kanban methodologies  PMP certification preferred Six Sigma certification preferred Strong conceptual understanding of technology and tools including, but not limited to, ReactJS, C#, Adobe XD, Azure and QA processes Demonstrates a commitment to quality and risk awareness Strong presentation and communication skills   Excellent verbal and written communication skills Strong interpersonal skills with the ability to communicate and engage all levels of the organization including senior management and executive committee Proven ability to solve problems creatively  Strong familiarity with project management software tools, methodologies, and best practices  Strong knowledge of Kanban or Agile project management methodology  Experience seeing projects through the full life cycle  Excellent analytical skills  Strong interpersonal skills and extremely resourceful  Proven ability to complete projects according to outlined scope, budget, and timeline        Job Description  We are a growing team and we are seeking to hire a Project Manager to join our team. We build custom applications using the latest and fastest technologies available in the market. We are a motivated team of individuals handling diverse IT projects. If you are passionate about handling unique challenges with a motivated team, this is a great place for you!   You have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta, through modern practices of software development. We have highly talented team members and boast of top notch quality software on every aspect. In this high-paced, creative environment, we know that our people will make all the difference in our success. Leading their success will be you, as a project manager. We need energy, curiosity and a relentless interest in creating the best requirement to delivery experience!  The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life!    Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completion Acts as the central point of contact for project-related activities Breakdown the requirements and assign individual team members Actively participate in all stages of SDLC from requirement to delivery Facilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverables Manages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channels Forms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departments Manages conflicting points of views to arrive at creative and responsive solutions.  Influences completion of project activities through dotted line relationships Manages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industry Other duties as assigned",
        "Page_URL": "https://www.kumarijob.com/recentjob/project-manager/28811"
    },
    {
        "name": "Back End Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "AlphaBetaTheta Technologies Software Companies",
        "address": "Kathmandu",
        "days_left": "Days Left : 20 days left",
        "vacancy": "1",
        "experience": "Upto one year",
        "level": "Mid Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-30",
        "desc": "Hands-on professional development experience with C#/Asp.Net Framework and SQL Server Experience in web development, including ASP.NET Web Services and Web API Experience with version control system like git Proficient with SQL database Excellent research and debugging skills  Ability to work independently as well as with a team to analyze business requirements and develop solutions  Clean coding skills  Investigate and develop skills in new technologies ",
        "desc1": "Gather and evaluate user requirements from project manager Collaborate with team members to complete the assigned task Produce high-quality backend solutions with a well-structured and organized code  Properly communicate databases migrations and schema when going to production Create a JSON contract with front end team  Clearly communicate your architectural ideas to team members Stay up to date with new coding trends and technologies Write reliable code acknowledging security and maintainability challenges",
        "desc2": "Job Description    Other Specification    Hands-on professional development experience with C#/Asp.Net Framework and SQL Server Experience in web development, including ASP.NET Web Services and Web API Experience with version control system like git Proficient with SQL database Excellent research and debugging skills  Ability to work independently as well as with a team to analyze business requirements and develop solutions  Clean coding skills  Investigate and develop skills in new technologies        Job Description  We are a growing team and we are seeking to hire a C# Developer to join our team. We are a motivated team of individuals handling diverse projects. If getting the highest performance and reusability for your code excites you, this is a great place for you!   you have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta through modern practices of coding. We leverage the latest serverless architecture and technologies to make our backend as reliable as possible. You will be working with our team with its highly talented members who take pride on their code and analysis. In this high-paced, creative environment, we know that our people will make all the difference in our success.  We need energy, curiosity and a relentless interest in creating the best performance! The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life!   Gather and evaluate user requirements from project manager Collaborate with team members to complete the assigned task Produce high-quality backend solutions with a well-structured and organized code  Properly communicate databases migrations and schema when going to production Create a JSON contract with front end team  Clearly communicate your architectural ideas to team members Stay up to date with new coding trends and technologies Write reliable code acknowledging security and maintainability challenges",
        "Page_URL": "https://www.kumarijob.com/recentjob/back-end-developer/28810"
    },
    {
        "name": "Senior Net Developer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/unnamed.png",
        "company": "Eightsquare Information / Computer / Technology",
        "address": "Kathmandu",
        "days_left": "Days Left : Expire Today",
        "vacancy": "2",
        "experience": "Four year or above",
        "level": "Senior Level",
        "time": "Full Time",
        "salary": "Negotiable /month",
        "education": "Bachelor degree",
        "deadline": "2020-10-10",
        "desc": "Strong knowledge of .NET web framework  Must have and ample knowledge on front end development (especially Vue, Angular...). Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiarity with Microsoft SQL Server and design/architectural patterns Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Attention to detail Experience creating database schemas that represent and support business processes Experience implementing automated testing platforms and unit tests Proficient understanding of code versioning tools such as Git, SVN, and Mercurial Some knowledge in node js, MongoDB and Redis ",
        "desc1": "Supporting the technical design process by participating in the analysis of technical application requirements Writing scalable code for .NET software applications Reviewing, debugging and upgrading existing .NET web and applications Providing support and training for junior developers Coding and testing program modules; assisting in design by collaborating with internal team Drafting software and application operating procedures Test and deploy applications and systems Develop documentation throughout the software development life cycle (SDLC) Participating in execution and documentation of tests Drive the delivery quality system utilizing automated unit testing, TDD and performance testing Collaborate with internal team to identify pain points, develop solutions and evangelize best practice",
        "desc2": "Job Description    Other Specification    Strong knowledge of .NET web framework  Must have and ample knowledge on front end development (especially Vue, Angular...). Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiarity with Microsoft SQL Server and design/architectural patterns Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Attention to detail Experience creating database schemas that represent and support business processes Experience implementing automated testing platforms and unit tests Proficient understanding of code versioning tools such as Git, SVN, and Mercurial Some knowledge in node js, MongoDB and Redis        Job Description   Supporting the technical design process by participating in the analysis of technical application requirements Writing scalable code for .NET software applications Reviewing, debugging and upgrading existing .NET web and applications Providing support and training for junior developers Coding and testing program modules; assisting in design by collaborating with internal team Drafting software and application operating procedures Test and deploy applications and systems Develop documentation throughout the software development life cycle (SDLC) Participating in execution and documentation of tests Drive the delivery quality system utilizing automated unit testing, TDD and performance testing Collaborate with internal team to identify pain points, develop solutions and evangelize best practice   Company Benefits:  Competitive Remuneration Timely Appraisal and Pay Upgradation Sophisticated Infrastructure Medical insurance inclusive Spouse, Parents & Children Accidental and Term Life Insurance Festival Allowance Onsite Engagement with Multination International Travel Exposure and Allowance. Technical and Soft Skills Trainings. Retreat Programs",
        "Page_URL": "https://www.kumarijob.com/recentjob/senior-net-developer/28809"
    },
    {
        "name": "IT Officer",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/VNLOGO.jpg",
        "company": "Venus National College",
        "address": "Jorpati",
        "days_left": "",
        "vacancy": "",
        "experience": "",
        "level": "",
        "time": "",
        "salary": "",
        "education": "",
        "deadline": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/hotjob/it-officer/28697"
    },
    {
        "name": "System Support (Network and System)",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/smart_card_logo.jpg",
        "company": "Smart Card Nepal Pvt. Ltd",
        "address": "Kathmandu",
        "days_left": "",
        "vacancy": "2",
        "experience": "Minimum 1-2 years of experience in related field",
        "level": "IT&Telecommunication",
        "time": "Mid Level",
        "salary": "As per organization rule's month",
        "education": "Bachelor's Degree",
        "deadline": "2020-10-15",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/premiumjob/system-support-network-and-system/28477"
    },
    {
        "name": "System Administrator",
        "logo": "https://www.kumarijob.com/assets/uploads/profilepics/smart_card_logo.jpg",
        "company": "Smart Card Nepal Pvt. Ltd",
        "address": "Kathmandu",
        "days_left": "",
        "vacancy": "1",
        "experience": "Minimum 2 years of experience in related field",
        "level": "IT&Telecommunication",
        "time": "Mid Level",
        "salary": "As per organization rule's month",
        "education": "Bachelor's Degree",
        "deadline": "2020-10-15",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "Page_URL": "https://www.kumarijob.com/premiumjob/system-administrator/28476"
    }
]
