[{"name": "Production Operations Support Analyst", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "address": "Hattisar, Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-12-02", "education": "Bachelors Degree (or higher) preferred (or equivalent experience in Information Technologies)", "experience": "5+ years working in a Technical/development role", "desct": "Production Operations Support AnalystCotiviti Nepal Pvt. LtdHattisar, Kathmandu1480Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-11-23Days Left : 5 days leftBasic InformationLocation:HattisarNo. of vacancy:1Experience:5+ years working in a Technical/development roleJob category:IT&TelecommunicationJob Level:Mid LevelSalary:As per organization rule'smonthEducational Qualification:Bachelors Degree (or higher) preferred (or equivalent experience in Information Technologies)Expiry date:2020-12-02Job DescriptionMonitor production PCA processing in a 24 x 7 environmentAssist in problem resolution for all production issues related to PCA applications and services, from initiation until conclusion. This will include issues related to the client facing ICMS batch and Real-time environments, and the Policy maintenance environments used by internal clientsEscalating issues as needed while communicating status and risks to managementAssists in the creation of Root Cause Analysis for production events and tracking completion of corrective actions items determined in the Root cause analysisCoordinates with Implementation Group on new client activation or expansion of existing client service expansionsCoordinates with Client Services Group on any requests from clients including testing and/or additional or non-standard monitoring as requested by clientsWorks and communicates directly with clients for any production eventsInterfaces with the Development, QA, Delivery and Release management teams for managing releases of all PCA application and services into ProductionCoordinates release and deployment activities between on shore and off shore support teamsCreates and maintains the release calendars, schedules and required software deliverables pagesCreates and maintains the release checklists and place holders for the support teamsCoordinates with the Command Center to communicate the status of releases and change requests (upcoming, start and completion)ADDITIONAL RESPONSIBILITIESMaintains production support documentation library ensuring documents are current, accurate, and available to appropriate groupsFollows and supports IT business processes including change management, configuration management, and disaster recovery and business continuityAssists and participates in Disaster Recovery/Business Continuity planning and testing. Activities to include actual live fail over and fall back exercisesProvides advanced support and direction for the integration of 3rd party systems or applications required to support the businessImplements processes and procedures using the ITIL frameworkWorks towards continual improvements of process and procedures with a goal of operational excellence.Other duties as assigned including active participation in Projects related to both the IT department and the company as a wholeJob SpecificationBachelors Degree (or higher) preferred (or equivalent experience in Information Technologies).5+ years working in a Technical/development roleGood knowledge and experience in IT Security best practiceExperience with monitoring toolsExperience in supporting the ITIL frameworkDemonstrable excellent troubleshooting and interpersonal skillsAbility to work and support off hoursWorks with a sense of urgencyPrior health plan operations experience helpfulCommunicates with ease up and down the chain of leadershipExcellent analytical skills with ability to troubleshoot problems and find root causesAbility to adapt to changing situations with easeTeam player with strong desire to assist and share knowledgeProficient in Oracle, Linux, Unix technologiesJira admin experience a plusProficient with Microsoft Office Suite (Word, Excel, Power Point)Professional with ability to properly handle confidential informationAbility to work well independently and in a team environment.Ability to handle multiple tasks, prioritize and meet deadlines.Ability to work within a matrix organizationExcellent written and verbal communication skills.On call availability – must be willing to carry cell phone and check email during off hoursMust be able to sit and use a computer keyboard for extended periods of timeMust be able to lift up to 20lbs without assistance; objects such as computer and peripheral equipmentFlexible schedule to work evenings and weekends, as neededTravel requirements low – although some travel may be necessary to out of state data centerMust be able to sit and use a computer keyboard for extended periods of time.Must have ability to positively handle/manage stress, such as high work volume and frequent change.Must have flexibility and willingness to participate in the work processes of an international organization, including conference calls scheduled to accommodate global time zones.Apply InstructionTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/production-operations-support-analyst/29197"}, {"name": "Senior Security Engineer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "1", "address": "Hattisar, Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-12-02", "education": "Bachelor's Degree", "experience": "Proven work experience as a system security engineer or network engineer.", "desct": "Senior Security EngineerCotiviti Nepal Pvt. LtdHattisar, Kathmandu747Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-11-23Days Left : 5 days leftBasic InformationLocation:HattisarNo. of vacancy:1Experience:Proven work experience as a system security engineer or network engineer.Job category:IT&TelecommunicationJob Level:Senior LevelSalary:As per organization rule'smonthEducational Qualification:Bachelor's DegreeExpiry date:2020-12-02Job DescriptionEngineer, implement and monitor security measures for the protection of computer systems, networks and information.Identify and define system security requirements.Configure and troubleshoot security infrastructure devices.Actively look for security vulnerabilities in our application and network, reporting issues and describing possible solutions.Stay up to date with security news, keeping an eye out for the latest vulnerabilities and remedies emerging in the field.Monitor our server traffic, ticketing and reporting unusual packets.Develop technical solutions and new security tools to help mitigate security vulnerabilities and automate repeatable tasks.Ensure that the company knows as much as possible, as quickly as possible about security incidents.Provide regular reports auditing our current services and latest changes, as well as our internal practices.Job SpecificationProven work experience as a system security engineer or network engineer.Experience in building and maintaining security systems.Hands on experience in security systems, including firewalls, intrusion detection systems, network security troubleshooting support, WAN routing and switching (EIGRP, OSPF, RIP, BGP, IP Routing, HDLC, PPP, Multilink, QoS, VLan, HSRP, VRRP, ACL, NAT, Port Security, SNMP etc).Experience with network security and network monitoring tools.Operational knowledge and understanding of TCP/IP, network protocols, firewall theory, and packet analysis, principles and techniques applied in securing operating systems and LAN/WAN networks, standard and nonstandard port use.Understanding of enterprise network security technologies such as encryption, VPN, firewalls, access control, and remote access.Proficient in firewalls, routers, proxies, load balancers, and UNIX-based systems.Proficient in security concepts such as identity management, least privilege, defense in depth and separation of duties.Proficient in security technologies such as IPS, VPNs, D/DoS and vulnerability management.Apply InstructionTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-security-engineer/29196"}, {"name": "DevOps Engineer (System Team)", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "address": "Hattisar, Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-12-02", "education": "Bachelor's Degree", "experience": "2+ years of experience", "desct": "DevOps Engineer (System Team)Cotiviti Nepal Pvt. LtdHattisar, Kathmandu694Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-11-23Days Left : 5 days leftBasic InformationLocation:HattisarNo. of vacancy:1Experience:2+ years of experienceJob category:IT&TelecommunicationJob Level:Mid LevelSalary:As per organization rule'smonthEducational Qualification:Bachelor's DegreeExpiry date:2020-12-02Job DescriptionSetup infrastructure for continuous integration, automated builds and automated build verification testing. Build and maintain infrastructure for development, QA, system demo and user testing. Create systems, utilities and scripts for automated deployment.Run system-level integration scripts or integrate manually where automation is not possible or hasn't yet been applied; Manage program branching models; Assist component teams in defining inter-component interfaces.End-to-End and System Performance Testing; Test system performance against NFRs and assist system architects in identifying system shortfalls and bottlenecks; Participate in Release planning and backlog refinement to define integration and testing stories; Create automated test scenariosPrepare System Demo at end of every sprint; help assure the environments are adequate to reliably demonstrate new system functionality.Release software into target environment; continuous improvement of release process including automation, tools and methods; post deployment verifications.Design and introduce software configuration management tools and practices.Job Specification2+ years of experience in information systems with at least 1 year of experience in a software development environment for Java/.Net/Python based web application.Experience supporting highly available systems running Java EE web applications, Tomcat, MS-IIS, Jboss.Experience deploying Java EE and .Net packages to systems using scripts, RPM’s, Salt stack, Octopus, Web deploy, etcExperience with PL/SQL development.Experience with Linux and Windows OS and its command.A working understanding of code and script (Bash, PowerShell, Python, Perl) to automate manual process.Experience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of multiple monitoring tools and how to mine them for advanced data.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Basic understanding of Active Directory, firewalls and networking concepts.PREFERABLE SKILLSKnowledge with Software Configuration Management tools such as Ansible, Puppet, Chef, Salt or others.Experience in providing solution design guidance to automate the deployment process and to maintain development and test environments to better match production is a plus.Experience on Docker or KubernetesUnderstanding of Cloud infrastructure like AWS.SOFT SKILLSAbility to work independently or as part of a teamUnderstanding of Kanban, Scrum and Agile is a plus.Persuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/devops-engineer-system-team/29195"}, {"name": "Information Security Analyst (ISA)", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "address": "Hattisar, Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-12-02", "education": "Bachelor’s Degree (or higher) preferred (or equivalent experience)", "experience": "Minimum of 3 years relevant work experience", "desct": "Information Security Analyst (ISA)Cotiviti Nepal Pvt. LtdHattisar, Kathmandu1301Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-11-23Days Left : 5 days leftBasic InformationLocation:HattisarNo. of vacancy:1Experience:Minimum of 3 years relevant work experienceJob category:IT&TelecommunicationJob Level:Mid LevelSalary:As per organization rule'smonthEducational Qualification:Bachelor’s Degree (or higher) preferred (or equivalent experience)Expiry date:2020-12-02Job DescriptionMust possess excellent (English) written and verbal communication skills and capable of creating clear, well-written documentation, recommendations, and reports/communications.Manages and tracks the delivery of Security Training and Awareness campaigns.Assists in the development of content for Security Awareness campaigns.Develops an internal knowledge base of Security controls that is well written, searchable and logically organized.Actively contributes to the Security knowledgebase to enable internal knowledge sharing and facilitates efficient audits and questionnaire responses.Supports the Security Audit function by reviewing evidence submissions for accuacy and completeness, following up on audit requests, and helping to establish a continuous monitoring function.Manages and performs quarterly access reviews ensuring completeness and accuracy of results and consistent evidence collection.Assist the Cotiviti vendor risk management function in the review, evaluation, and reporting related to vendors to ensure security requirements for proposed solutions, technologies, services and capabilities are properly considered.Supports the Risk Management function by reviewing and documenting Security exceptions and recommending appropriate actions.Assist in testing and verification of all off-shore controls and formulating reports documenting findings.Recommends and assists in the definition and implementation of security controls in accordance with enterprise policies, standards, and procedures.Assist in the planning, coordination, and management of  client assessments at off-shore locations.Act as interface between assigned business unit and security organization.  Develop trusted adviser relationships with key stakeholders and internal groups.Assist assigned business units with solution development activities to ensure security requirements are appropriately identified, considered, and addressed. These services will include but will not be limited to security education, control identification and development.Identify exceptions to security control standards and assist in management and tracking of risk acceptance and/or remediation for identified exceptions.Other duties as assignedCompetenciesCommunicates With Impact: Presents information and ideas in a thoughtful and compelling manner. Is clear and concise in verbal and written communications. Shares information freely and speaks openly and honestly. Seeks to understand the perspectives of others.Drives and Delivers Results: Sets clear priorities, takes action, stays focused, and overcomes barriers to deliver expected results.Solves Problems and Makes Good Decisions: Evaluates critical information needed to understand problems, determine probable causes, and develop workable solutions. Accurately assesses the costs, benefits, and risks associated with alternative courses of action and makes high quality and timely decisions.Leads Change:Sees emerging patterns and opportunities. Adapts quickly and easily to new information, changing conditions or unexpected events. Facilitates and communicates change across the team or organization to drive adoption.Lives Our Values: Behaves in a way that consistently demonstrates commitment to Cotiviti values (Integrity, Passionate Client Service, Teamwork, Accountability, Performance Excellence, and Continuous Improvement)Information Security and Compliance: Demonstrates understanding of Cotiviti security policies, standards, procedures, and external regulatory and customer requirements.  Maintains a strong working knowledge of risk and security related concepts, technologies, and industry leading practices.  Assures confidentiality, integrity, and availability of Cotiviti business process and supporting information infrastructure and data when appropriate. Demonstrates the skills, knowledge, and ability to ensure a risk-based approach to security is being consistently applied.Collaborates Effectively– Partners with internal customers, stakeholders, and interested parties to ensure positive outcomes and experiences.  Ensures security is viewed as a valued asset by internal customers and stakeholders.Job SpecificationExcellent English skills, both written and verbal are required.Bachelor’s Degree (or higher) preferred (or equivalent experience)Minimum of 3 years relevant work experienceKnowledge of NIST 800-53, NIST CSF, HITRUST, HIPAA, ISO 2700x, and other leading industry security standards and frameworksKnowledgeable in security concepts, techniques, tools, methods and practicesProven relationship management expertise with both business and technical personnelArticulates the value of security controls and their potential business ImpactsStrong risk analysis, customer service, problem solving, and consulting skillsAble to interpret and apply policies, standards and procedures in business relevant and applicable way~10% travelProficient with Microsoft Office Suite (Word, Excel, Power Point)Professional with ability to properly handle confidential informationAbility to work well independently and in a team environmentAbility to handle multiple tasks, prioritize and meet deadlinesAbility to work within a matrix organizationMust be able to sit and use a computer keyboard for extended periods of timeMust be able to lift up to 20 lbs without assistanceMust have ability to positively handle/manage stress, such as high work volume and frequent changeMust have flexibility and willingness to participate in the work processes of an international organization, including conference calls scheduled to accommodate global time zones.Industry Certifications (Must be able to obtain and maintain one or more within six months if not currently certified):Certified Information Security Auditor (CISA)Certified Information Systems Security Professional (CISSP)Certified in Risk and Information Security Controls (CRISC)Apply InstructionTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/information-security-analyst-isa/29194"}, {"name": "Assistant Developer", "company": "FOCUSONE Payment Solutions Pvt.Ltd.", "level": "Mid Level", "vacancy": "4", "address": "DD Plaza, 4th Floor, Kamaladi, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-11-30", "education": "BS/MS degree in Computer Science, Engineering or a related subject", "experience": "At least 1 year", "desct": "Assistant DeveloperFOCUSONE Payment Solutions Pvt.Ltd.DD Plaza, 4th Floor, Kamaladi, Kathmandu1406Share ItView company profileApply NowAboutusFOCUSONE Payment Solution Pvt. Ltd. (F1PS), Estd 2009; is a Payment Service Provider (PSP) licensed by Nepal Rastra Bank (NRB). Our company revolves around 3 key principles Trust, Value and Security.   F1PS since its establishment has been continuously working on innovative payment solution. We launched a mobile payment system in collaboration with SmartChoice Technology (SCT) under the brand name “MOCO” in May 2014, a one of a kind product till date. We reached 700,000 successful transactions in 2017 and are now connected to over 30 BFIs.   We are proud to be one of the few companies in Nepal to have acquired a PCI-DSS certification, which is an internationally accepted data security standard governed international payment networks, American Express, Discover, JCB International, MasterCard and Visa Inc. We have now begun works on collaboration and partnership with international card and payment association.   Come join the #FinTech revolution with F1PS. Let’s work towards building a true cashless society in Nepal. Creative minds, innovative leaders, dedicated and persistent personalities are most welcome.Posted On : 2020-11-13Days Left : 3 days leftBasic InformationLocation:KathmanduNo. of vacancy:4Experience:At least 1 yearJob category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:BS/MS degree in Computer Science, Engineering or a related subjectExpiry date:2020-11-30Job DescriptionCoordinating with stakeholders to understand the scope of workPreparing requirement specification documentCommunicating the project status with the supervisor and/or product ownerCoordinating with different stakeholders of the projectPreparing wireframes and other necessary design documentsKnowledge of data structures and algorithmKnowledge of the programming language in useAbility to self-learn / enhance programming skill of the language in useKnowledge in the programming tools you useKnowledge in the frameworks and libraries available for programming languages you use.Coding and schedulingJob SpecificationOrientation on research of additional information independentlyAbility to provide information clearly and shortlyFamiliar with Linux console, Git and Tomcat.Familiarity with basic research methods and reporting techniquesExcellent Analytical Skills and Communication SkillsExcellent Organizational and Time Management SkillsIntegrity and ConfidentialityGood in handling Work PressureExcellent Team WorkApplicants having knowledge of PHP Programming will be highly preferred.Apply InstructionIf you meet the above requirements and wish to join our dynamic team, please send your recent resume including expected salary tocareer@moco.com.np.Apply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/assistant-developer/29120"}, {"name": "Laravel Developer", "company": "kumarijob.com", "level": "Mid Level", "vacancy": "2", "address": "Tinkune, Kathmandu", "salary": "Upto 30,000month", "deadline": "2020-12-04", "education": "Bachelor's Degree", "experience": "Minimum 1-2 years experience in a related field", "desct": "Laravel Developerkumarijob.comTinkune, Kathmandu1180Share ItView company profileApply NowAboutusKumari Job is one of the leading legally certified Human Resource consulting firm operating since 2014. Kumari Job offers multiple solutions in the field of HR, Recruitment and Placement services to different organizations in diversified fields like Financial Institutions, Corporate houses, Trading houses, Schools, Colleges, I/NGOs etc. Kumari Job is morally operating by following the principles where value of clients are highly understood and recognized to provide them with the best services. Kumari Job is also known for its professional training services to produce qualified and skilled manpower in diverse fields.Posted On : 2020-11-05Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:2Experience:Minimum 1-2 years experience in a related fieldJob category:Web DevelopersJob Level:Mid LevelSalary:Upto 30,000monthEducational Qualification:Bachelor's DegreeExpiry date:2020-12-04Job DescriptionInsight Of PHP/Laravel, SQL.Knowledge of HTML5, CSS3, Javascript.Knowledge of git version control.Work effectively in OS, admin system, Web API, Web server, HTTP protocols.Creative and efficient problem solver.Job SpecificationBachelor/ Ongoing degree in Computer Science, IT/Computer Engineering or related field.Highly motivated and target driven personality.Minimum 1-2 years experience in a related fieldApply InstructionInterested candidates are requested to send their resume tosagar@kumarijob.comContact:9801178853Apply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/laravel-developer/29035"}, {"name": "Senior MS-SQL Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "4", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studies", "experience": "Minimum 5 years of experience in Software development using MS-SQL.", "desct": "Senior MS-SQL DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1892Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:4Experience:Minimum 5 years of experience in Software development using MS-SQL.Job category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Job SpecificationMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.Preferable SkillsExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-ms-sql-developer/28997"}, {"name": "Project Manager", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "2", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor's Degree", "experience": "Minimum 2 years experience in a related field", "desct": "Project ManagerCotiviti Nepal Pvt. LtdHattisar, Kathmandu3476Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:2Experience:Minimum 2 years experience in a related fieldJob category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:Bachelor's DegreeExpiry date:2020-12-04Job DescriptionConduct and facilitate the planning. Help team to define their goals on eachplanning.Facilitate all the sprint rituals of own team.Coordinate with other teams on the Agile Release Train (ART) asneeded. Participate in SOS to present own team's progress.Own team’s commitments and help team to achieve their goal.Help remove impediments and foster an environment for high-performing teamdynamics, continuous flow, and relentless improvement.Help and guide the team to optimally plan their capacity.Make sure the team’s utilization is efficiently managed and has higherproductivity.Conduct regular retrospective on every event. Make sure every action items have individual/team’s name and a date expected to get resolved with a follow up.Manage team’s RAID – Risk, Assumption, Issues and Dependencies.Compile, collect, produce and publish team’s report on different metrics.Work with Engineering manager for team’s development that helps the team tbe more productive as well as efficient.Escalate to higher authority as required on any case that needs resolution fromcross team.Coach the team in Scrum, Extreme Programming (XP), Kanban, and SAFe,ensuring that the agreed Agile process is being followed.Develop, document and conduct Agile development and process training asrequired – getting started and regular refresher training. Work with organizationtraining manager/specialistApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/project-manager/28996"}, {"name": "Test Automation Engineer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "5", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor’s degree or equivalent degree in Computer related studies", "experience": "Minimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.", "desct": "Test Automation EngineerCotiviti Nepal Pvt. LtdHattisar, Kathmandu1974Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:5Experience:Minimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.Job category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:Bachelor’s degree or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionTest Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Job SpecificationMinimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branchingand merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application ServerApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/test-automation-engineer/28994"}, {"name": "Senior Test Automation Engineer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "5", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor Degree or equivalent degree in Computer related studies", "experience": "Minimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.", "desct": "Senior Test Automation EngineerCotiviti Nepal Pvt. LtdHattisar, Kathmandu1236Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:5Experience:Minimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.Job category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:Bachelor Degree or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionTest Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Job SpecificationMinimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branchingand merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application ServerApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-test-automation-engineer/28993"}, {"name": "Oracle- PL/SQL Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "2", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studies", "experience": "Minimum 2 years of experience in Software development using PL/SQL, MS-SQL.", "desct": "Oracle- PL/SQL DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1375Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:2Experience:Minimum 2 years of experience in Software development using PL/SQL, MS-SQL.Job category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionUnderstanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Job SpecificationMinimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branchingand merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo)Other SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/oracle-plsql-developer/28992"}, {"name": "Senior Oracle-PL/SQL Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "2", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor's Degree", "experience": "At least 5 years of experience in Software development using PL/SQL, MS-SQL.", "desct": "Senior Oracle-PL/SQL DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1265Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:2Experience:At least 5 years of experience in Software development using PL/SQL, MS-SQL.Job category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:Bachelor's DegreeExpiry date:2020-12-04Job DescriptionShould have strong knowledge on all stages of Software life cycle process: Planning, design,development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Job SpecificationAt least 5 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branchingand merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-oracle-plsql-developer/28991"}, {"name": "Java Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "6", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studies", "experience": "At least 2 years of experience in Software development using J2SE and J2EE.", "desct": "Java DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1709Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:6Experience:At least 2 years of experience in Software development using J2SE and J2EE.Job category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionInvolve in all stages of the project life cycle: requirements definition, design, and development.Translate application stories and requirements into functional applications.Write neat and clean code for desktop and web application.Create test cases and follow test cases to implement the requirements.Active participation in Project level discussion/meeting.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAJob SpecificationAt least 2 years of experience in Software development using J2SE and J2EE.Experience in parallel and multithreaded programmingKnowledge of algorithms and data structuresInterest in achieving maximum performance from available hardware and softwareFamiliar with design patternsUI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery)Hands-on knowledge on Spring Framework.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching andmerging strategies.Preferable SkillsHands-on knowledge on Apache Camel FrameworkKnowledge of testing frameworks/methodologies (TestNG, JUnit, TDD)Understanding of XML, JSON, web services technologiesExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valueDesire and ability to continuously improve, discover and expand the limitsCritical thinking, has an opinion on various technological topics.Apply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/java-developer/28990"}, {"name": "Senior Java Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "7", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "BS Computer Science or related field or equivalent industry experience", "experience": "At least 5 years of experience in Software development", "desct": "Senior Java DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1175Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:7Experience:At least 5 years of experience in Software developmentJob category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:BS Computer Science or related field or equivalent industry experienceExpiry date:2020-12-04Job DescriptionExperience developing enterprise applications with proven enterprise experience level withRDBMS and SQL (Oracle and/or Microsoft SQL Server)Experience with Continuous Integration and writing automated unit and integration testsStrong object-oriented programming skills using JavaKnowledge of relevant technologies inclusive of (Angular 5, JavaScript, JOuery)Knowledge of algorithms and data structuresFamiliar with design patternsKnowledge of secure coding practices as it pertains to OWASPKnowledge of Version Control Software tools such as SVN, bitbucketExperience with Software development/management tools using the Atlassian suite (JIRA,Confluence)Experience with both Windows and Unix Operating systemJob SpecificationBS Computer Science or related field or equivalent industry experienceAt least 5 years of experience in Software developmentSoft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valueDesire and ability to continuously improve, discover and expand the limitsCritical thinking has an opinion on various technological topics.Apply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor Send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-java-developer/28989"}, {"name": "Dot Net Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "4", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studies", "experience": "Minimum 2 years of experience in Software development using C#.", "desct": "Dot Net DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1673Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:4Experience:Minimum 2 years of experience in Software development using C#.Job category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAJob SpecificationMinimum 2 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT includingbranching and merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc wouldbe an added advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/dot-net-developer/28988"}, {"name": "Senior Dot Net Developer", "company": "Cotiviti Nepal Pvt. Ltd", "level": "Senior Level", "vacancy": "10", "address": "Hattisar, Kathmandu", "salary": "Negotiablemonth", "deadline": "2020-12-04", "education": "Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studies", "experience": "Minimum 5 years of experience in Software development using C#.", "desct": "Senior Dot Net DeveloperCotiviti Nepal Pvt. LtdHattisar, Kathmandu1275Share ItView company profileApply NowAboutusEstablished in 2004, Cotiviti Nepal Pvt. Ltd. is a leading American Software company in Nepal. We are a proud to team of around 300 professionals who are involved in the design, development, testing and maintenance of an impressive lineup of trend-setting healthcare informatics solutions. Besides that, our talented people sort and analyze voluminous data to help clients in decision analytics.   We are one of the eight centers of Cotiviti Inc. which operates from seven more locations across the United States of America and constantly ranked among the best healthcare informatics companies. In Nepal, Cotiviti Nepal Pvt. Ltd. has its remarkable identity in the software industry.Posted On : 2020-10-28Days Left : 7 days leftBasic InformationLocation:KathmanduNo. of vacancy:10Experience:Minimum 5 years of experience in Software development using C#.Job category:IT&TelecommunicationJob Level:Senior LevelSalary:NegotiablemonthEducational Qualification:Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesExpiry date:2020-12-04Job DescriptionTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop applications.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in the best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAJob SpecificationMinimum 5 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit tests and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branchingand merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc would be anadded advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApply InstructionTo apply, please log in tohttp://www.cotiviti.com.np/jobsor send your CV toktmjobs@cotiviti.comApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/senior-dot-net-developer/28987"}, {"name": "Team Lead(Cloud)", "company": "Bottle Technology Pvt. Ltd", "level": "Senior Level", "vacancy": "1", "address": "Kupondole, Lalitpur, Nepal.", "salary": "60,000month", "deadline": "2020-11-27", "education": "Bachelor Graduates", "experience": "Min 2 years of experience", "desct": "Team Lead(Cloud)Bottle Technology Pvt. LtdKupondole, Lalitpur, Nepal.5536Share ItView company profileApply NowAboutusBottle is a Nepal based “Retail Experience Design” Company with (technological) research subjects varying across the sphere of Machine Learning, Internet of Things, 3D Printing and Web 3.0 but our intention is not entirely based in technology. Bottle is composed of multiple divisions and departments, but we are working a long-timeout to eliminate the notion of psychological hierarchy which is only possible if we have people working, who have no respect for the dumb-down culture that is one of the reasons we build DYRE.  Which you can visit and complete the application submission process.Posted On : 2020-10-05Days Left : Expire TodayBasic InformationLocation:KathmanduNo. of vacancy:1Experience:Min 2 years of experienceJob category:IT&TelecommunicationJob Level:Senior LevelSalary:60,000monthEducational Qualification:Bachelor GraduatesExpiry date:2020-11-27Job DescriptionDevelop, maintain, and monitor repos of deployable, tested, and documented code bases.Design, configure, implement and support an automated workflow for cloud and virtual environment provisioningWrite and maintain documentation of relevant operating procedures and processesDesign, develop, and build the business’s cloud infrastructure architectureProvide design recommendations based on long-term IT organization strategyDesign and develop full-stack technologies (Database design, frontend, backend, microservices) Current / Recent tasks:Plan, write, and maintain serverless backend for the projectDesign, Orchestrate and Maintain the data platform Recommendation EngineJob SpecificationAs a Technical LeadAct as a subject matter expert to the organization for cloud and virtualization end-to-end architecture and IaaS, PaaSAssist developers in solving problems via hands-on or verbal guideFrequently researches and maintains knowledge in emerging technologies and possible application to the businessThink, plan and organize different growth-related activities ( Sessions, Engineering meet-up )Languages:JS, python Platform: serverless framework, AWS, nodejs, terraformApply InstructionInterested candidates are requested to send their resume atganga@bottle.com.npApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/team-leadcloud/28849"}, {"name": "Project Manager", "company": "Bottle Technology Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "address": "Kupondole, Lalitpur, Nepal.", "salary": "Negotiablemonth", "deadline": "2020-11-27", "education": "Bachelor's degree in Computer Science graduate or equivalent. A Master's degree is preferable", "experience": "At least 2 years of software project management experience in an agile environment.", "desct": "Project ManagerBottle Technology Pvt. LtdKupondole, Lalitpur, Nepal.7844Share ItView company profileApply NowAboutusBottle is a Nepal based “Retail Experience Design” Company with (technological) research subjects varying across the sphere of Machine Learning, Internet of Things, 3D Printing and Web 3.0 but our intention is not entirely based in technology. Bottle is composed of multiple divisions and departments, but we are working a long-timeout to eliminate the notion of psychological hierarchy which is only possible if we have people working, who have no respect for the dumb-down culture that is one of the reasons we build DYRE.  Which you can visit and complete the application submission process.Posted On : 2020-10-05Days Left : Expire TodayBasic InformationLocation:KathmanduNo. of vacancy:1Experience:At least 2 years of software project management experience in an agile environment.Job category:IT&TelecommunicationJob Level:Mid LevelSalary:NegotiablemonthEducational Qualification:Bachelor's degree in Computer Science graduate or equivalent. A Master's degree is preferableExpiry date:2020-11-27Job DescriptionResponsible for requirement building, backlog prioritization, sprint planning, release, daily standups, reviews, and overall execution.Responsible for process implementation and improvements.Monitor resource availability and allocation.Responsible for quality assurance and control in accordance to project requirements.Perform overall project risk and issue management, and handle detailed tracking and mitigation planning.Responsible for establishing clear ownership of project tasks, ensuring every team member has the required tool & support needed and providing timely feedback.Set clear expectations, provide needed autonomy to team members, time monitor the progress, and give recognition for results.Developing schedules and methods for measuring results.Organizing and managing all phases of the project to ensure on-time completion.Planning and overseeing the preparation and dissemination of project communications.Coordinate project scope and objectives and ensure technical feasibility.Create and maintain comprehensive project documentation within the standards of the business.Job SpecificationBachelor's degree in Computer Science graduate or equivalent. A Master's degree is preferable.At least 2 years of software project management experience in an agile environment.A deep understanding of agile software development best practices.Strong leadership skills - highly pro-active, self-motivated, self-organized, decision-maker, committed, and an excellent team player.Technical background with understanding and/or hands-on experience in software development is preferred.Excellent analytical and problem-solving skills and the ability to analyze the available data and make decisions that affect the project on a regular basis.Sound knowledge and experience on project management tools (JIRA, Confluence) and frameworks such as scrum, kanban, etc.Ability to seamlessly handle multiple projects at once.Ability to work as part of the project management team, and to work independently.Excellent verbal and written communication skills – both English and Nepali.Certified Scrum Master certification is a plus.Apply InstructionInterested candidates are requested to send their resume atganga@bottle.com.npApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/project-manager/28848"}, {"name": "System Support (Network and System)", "company": "Smart Card Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "2", "address": "Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-11-27", "education": "Bachelor's Degree", "experience": "Minimum 1-2 years of experience in related field", "desct": "System Support (Network and System)Smart Card Nepal Pvt. LtdKathmandu18791Share ItView company profileApply NowAboutusSmart Card Nepal was founded in 2071 B.S. with the motive of providing remote bank deposit and digital wallet system in Nepal. Smart Card Nepal is license by Nepal Rastra Bank. Is the best Deposit & Payment Service Provider.Posted On : 2020-08-16Days Left : Expire TodayBasic InformationLocation:KathmanduNo. of vacancy:2Experience:Minimum 1-2 years of experience in related fieldJob category:IT&TelecommunicationJob Level:Mid LevelSalary:As per organization rule'smonthEducational Qualification:Bachelor's DegreeExpiry date:2020-11-27Job DescriptionResponsible for all aspects of the Hardware, Network and IT infrastructure Setup and Implementation from the initial specification, Product launching.Deal with Clients, ISP, BFI and Network providerResponsible for Setup, integration, Monitor System, Hardware and Network Connectivity along with Network and VPN Setup within the Office and Outside OfficeShould be able to Design Network Architecture, Firewall/FortiGate Setup DocumentInstall, configure, and support an organization's local area network (LAN), wide area network (WAN), and Internet system or a segment of a network system.May supervise other network support and client server specialists and plan, coordinate, and implement network security measures.Maintain and administer computernetworksand related computing environments, including computer hardware,systemssoftware, applications software, and all configurations.Job SpecificationGood knowledge of Network SecurityExpert with IPSEC/VPN and other Connectivity typesExtensive experience with OS, Hardware and Server Virtualizations and work independently and in a team environment.Hands on experience in networking, routing and switchingAbility to set up and configure server hardwareAble to lead the Team and ProjectApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/system-support-network-and-system/28477"}, {"name": "System Administrator", "company": "Smart Card Nepal Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "address": "Kathmandu", "salary": "As per organization rule'smonth", "deadline": "2020-11-27", "education": "Bachelor's Degree", "experience": "Minimum 2 years of experience in related field", "desct": "System AdministratorSmart Card Nepal Pvt. LtdKathmandu16195Share ItView company profileApply NowAboutusSmart Card Nepal was founded in 2071 B.S. with the motive of providing remote bank deposit and digital wallet system in Nepal. Smart Card Nepal is license by Nepal Rastra Bank. Is the best Deposit & Payment Service Provider.Posted On : 2020-08-16Days Left : Expire TodayBasic InformationLocation:KathmanduNo. of vacancy:1Experience:Minimum 2 years of experience in related fieldJob category:IT&TelecommunicationJob Level:Mid LevelSalary:As per organization rule'smonthEducational Qualification:Bachelor's DegreeExpiry date:2020-11-27Job DescriptionInstall and configure software and hardwareManage network servers and technology toolsSet up accounts and workstationsMonitor performance and maintain systems according to requirementsTroubleshoot issues and outagesEnsure security through access controls, backups and firewallsUpgrade systems with new releases and modelsDevelop expertise to train staff on new technologiesBuild an internal wiki with technical documentation, manuals and IT policiesJob SpecificationProven experience as a System Administrator, Network Administrator or similar role.Minimum 2 years of experience in related fieldApply NowSavePrintShare", "Page_URL": "https://www.kumarijob.com/premiumjob/system-administrator/28476"}]