[
    {
        "name": "Software Engineer - .NET /C#",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionVerisk IoT/Telematics, a unit of Verisk Analytics (VRSK), provides a start-up like excitement with the stability of a thriving public company. Verisk’s signature automotive telematics effort is the Verisk Data Exchange, which collects IoT telematics data from connected vehicles and provides advanced analytical solutions to its customers.Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers. You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.What You Get To Do Every DayDesign and develop high-performance software libraries and APIsImplement highly scalable, performant, fault-tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownershipBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsExperience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Knowledge of cloud-based applications would be a plusExperience working with large-scale production systems and/or data platformsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal) QualificationsSkills And QualificationsYou must have demonstrated experience in several of these domains and technologies:BS/MS degree in Computer Science, Engineering or a related subjectAt least 3years full-time work experience with good knowledge of AWS environmentStrong ability to build RESTful services in C# with .NET/.NET CoreProficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNKnowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus point Preferably certified in AWS skillsAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-net-c%23-at-verisk-2197785985?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Full Stack Engineer",
        "company": "Softyca Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQG82K-VofY3Kw/company-logo_100_100/0?e=1611187200&v=beta&t=s5_ruKT-lXBE3XNI61kxVnCy8X0WHD045HNS04MKxLw",
        "address": "Nepal",
        "desc": "Responsibilities:Identify innovative technology and methodology to optimize productivityEnsure safe delivery and execution of applicationsDevelop web applications utilizing modern programming languages (JavaScript, Java, Python, C#, C++, etc.)Collaborate with other professionals to understand complex ideas and drive featuresWork with remote development teams to create featuresOptimize qualities through refactoring, peer code review, and automationRequirements: Bachelor’s degree & equivalent work experience in computer science, engineering, or related field3+ years of experience in web application development3+ years of experience developing large traffic software designFamiliarity with JavaScript and JVM languagesExpertise in web development, cookies, cache, CORS, etc.Understanding of server API development",
        "level": "Not Applicable",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-engineer-at-softyca-inc-2176411324?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Database Administrator/Developer",
        "company": "Omnicom Media Group",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFOs9cg5FKb6Q/company-logo_100_100/0?e=1611187200&v=beta&t=Y27kiHUQF1Zh4ize-TtvUeEoL58aylt0NIyLOhmYj14",
        "address": "Bāgmatī, Nepal",
        "desc": "Role OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages. Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with. Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link at https://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2170970181?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "JUNIOR TRADER / ANALYST - Dubai, UAE",
        "company": "Cobblestone Energy",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQFxIuANc6IrXw/company-logo_100_100/0?e=1611187200&v=beta&t=5iSWC9iX91GVgukI8oavlf378NyG354KfzztbGOFrmw",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Junior Trader / Analyst - Commercial Development Programme - Dubai, UAE Starting Remuneration of 30,000 USD per annum, 0% Tax environment.Fast progression for strong performers.Are you bright, highly motivated and commercial-minded with a growth mindset?Company DescriptionEnergy in one form or another is fundamental to almost all of the world's economic activities. By understanding the demand, supply, and logistics of these commodities, we can better understand the world. We specialise in the proprietary trading of the short-term wholesale electricity markets across Europe. We make use of advanced data analytics and extensive research to drive profitable decision making, trading enough electricity every day to power a small country. Technology and risk management form the backbone of our businessCommercial Development ProgrammeThe Cobblestone Commercial Development Programme is your passport to an exciting and challenging career in the world's commodities markets. It is a 12-month programme designed to give you exposure across trading and analytics to help you develop the tools you need to be a highly effective team member. We are searching for exceptional graduates who thrive on intellectual challenges and can provide creative solutions to complex problems. This is a role for highly analytical and sharp individuals with strong numerical ability. One must be able to learn and think quickly. Opportunity is unlimited for exceptional talent.We are offering graduate vacancies in our Dubai office starting throughout 2020.Tasks/responsibilities:  Support the commercial decisions of the traders through the provision of timely analysis and market monitoring. Perform research into various aspects of the European Energy markets Analyse business requirements (tools and systems) and provide ideas to solutions that add value to the bottom line. What we look for:  Very strong numerical, logical reasoning and analytical skills. A in A level Mathematics. Must have studied Mathematics at A level. * Strong commercial acumen Resilience and a determination to succeed Independent thinkers with growth mindset Programming (e.g. Python, Java, C++) skills are desirable but not mandatory. Must be self-motivated and able to learn quickly. Our hiring processes After your application been added to our pipeline and evaluated, you will be invited to do an online psychometric assessment that will evaluate your numerical ability.Upon successful completion of these, you will be invited for a series of interviews with members of both our HR and commercial team.Before full time admission onto our Commercial Development Programme (CDP), all finalist candidates are invited to attend a two-week Cobblestone Training Programme (CTP). CTPs are carried out at either our main Dubai office or our partner location in Kampala. This is determined by our admin depending on where you are located.We shall cater for everything - Flights, accommodation, paper-work and expenses.During the Training Program, you work will on real-life tasks and situations with other members of the commercial and technical team. The goal is to enable you to learn as much as possible within the period while giving you the opportunity to shine in an area tailored to your strengths. You are also evaluated for cultural fit, aptitude, and your ability to work with others.Following this, you will then be offered a full-time role on the CDP.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/junior-trader-analyst-dubai-uae-at-cobblestone-energy-2195569448?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Director, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director. The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position DescriptionThe Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration. The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects. This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region. This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups. The Technical Director will support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life. She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work. The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team. Availability of position is contingent upon award to FHI 360.Key ResponsibilitiesAssist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualificationsAt least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-director-csm-nepal-at-fhi-360-2179949269?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Service Technician",
        "company": "Tetra Pak",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHIEmKGTdVrug/company-logo_100_100/0?e=1611187200&v=beta&t=0FFa4NhmHrsdzYG6UngV5X0AQbDKqraN2Grxb5wCE8c",
        "address": "Birganj, Nārāyanī, Nepal",
        "desc": "At Tetra Pak we touch millions of lives every day, ensuring better nutrition and healthier lifestyles through safe packaging and food processing solutions. Guided by our global brand promise, PROTECTS WHAT´S GOOD, we strive to make a difference by protecting food, people and our futures. To do this we need more than smart technology. We need smart people too. People like you, who wants to work with people like us.Regional System Support Specialist Are you ready to take on a challenging role as Technician within APAC Services of Tetra Pak?As Technician, you will be responsible for taking care of maintenance and troubleshooting activities for our Nepal territory customers i.e. Dabur Nepal & other customers in Nepal. This position will be based in Birgunj, Nepal and will require extensive travel.What you will doParticipate in preparing customer site for installation events, assembling machines.Participate in execution of preventive maintenance activities.Inform relevant Tetra Pak staff in a timely manner about discovered Technical Issues.Participate in the installation of relevant rebuilding/upgrade kits.Inform relevant Tetra Pak Field Staff about ongoing service activities as well as of any issues affecting the customer or the quality of Tetra Pak service.Act as an ambassador for Tetra Pak at all times, ensuring good working relationships with the customer and Tetra Pak colleagues and that Tetra Pak’s reputation is sustained.Execute all work in accordance with Tetra Pak and Customer safety regulations and requirements. Execute all work in accordance with Tetra Pak standards and requirements regarding product quality and food safety. Escalate all discovered food safety, quality assurance and regulatory issues.Comply with all reporting requirements.Who you areWe are looking for you, a curious, committed, and highly motivated colleague wanting to expertly learn and work with Tetra Pak. We believe you have minimum 2 years hands on experience in equipment maintenance, servicing or installation and commissioning in any food/packaging, processing, or automation industry. Knowledge of PLC programming and troubleshooting will be an advantage. You have a full time Diploma/Bachelor’s degree in mechanical/electrical engineering with excellent verbal and written communication skills in English.We offerAs our new Technician, you will be part of a global leading company where our vision is to make food safe and available everywhere. We can offer you highly skilled and passionate colleagues and an international challenging and high paced work environment where our employees take great pride in protecting food and protecting the planet.Apply Now!If you are inspired to contribute to the APAC Services of Tetra Pak, feel free to apply through this post.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/service-technician-at-tetra-pak-2184301010?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Chief of Party",
        "company": "",
        "logo": "",
        "address": "Nepal, Gandakī, Nepal",
        "desc": "At the heart of Pact is the promise of a better tomorrow. A nonprofit international development organization founded in 1971, Pact works on the ground in nearly 40 countries to improve the lives of those who are challenged by poverty and marginalization. We serve these communities because we envision a world where everyone owns their future. To do this, we build systemic solutions in partnership with local organizations, businesses, and governments that create sustainable and resilient communities where those we serve are heard, capable, and vibrant. Pact is a recognized global leader in international development. Our staff have a range of expertise in areas including public health, capacity development, governance and civil society, natural resource management, poverty, fragile states, monitoring and evaluation, small-scale and artisanal mining, microfinance and more. This expertise is combined in Pact’s unique integrated approach, which focuses on systemic changes needed to improve people’s lives.DepartmentProgram Delivery (PDEL) - Pact exists to help create a world where those who are poor and marginalized exercise their voice, build their own solutions, and take ownership of their future. The Program Delivery Team, contributes to realizing this purpose by: Forging smart partnerships and treating all people with dignity and respect; Applying organizational policies and regulatory compliance appropriately and consistently; Facilitating team spirit among colleagues and promoting the organization through communications; Influencing decision makers through focused, relevant communications; Continually striving to learn and share knowledge and find small ways to make the workplace more enjoyable for all; Cultivating and harvesting innovation; Contributing to the organization’s ability to think and act strategically at all times; Inspiring and spreading our desired organizational culture across the global enterprise.Position OverviewPact is recruiting for a Chief of Party (COP) for an upcoming project based in Nepal. The COP will be responsible for technical leadership and the overall management and operations of the USAID Civil Society and Media (CSM) Activity. She/he will supervise high-quality project implementation, with a focus on achieving the project goals and USAID/Nepal development objectives. The COP will take a leadership role in coordination of all activities across all relevant parties including: USAID, the Government of Nepal (GoN), key stakeholders, and implementing partners. She/he will also oversee all project staff and sub-partners for results-oriented planning, leadership, and coordination of project activities. This position is contingent upon award.Key Responsibilities Ensure high-quality, results-oriented technical programming through hands-on guidance and support grounded in the project’s strategic objectives and approved annual workplans. Serve as key representative to USAID, responsible for all communications with USAID officials. Act as liaison to and ensure effective relationships with the GoN, national policy actors, project sub-partners, other relevant donors and key stakeholders. Ensure a highly adaptive, systems-driven approach to promoting innovative and sustainable approaches to strengthening civil society and media, and promoting civic engagement. Ensure the provision of training and mentoring to partners to strengthen the capacity of civil society and media partners, and ensure their compliance with donor rules and regulations. Develop and implement a strategy for supporting local and national civil society partners to positively influence democratic and reforms at the local, provincial, and national levels. Develop and implement innovative approaches to promoting collaboration and engagement across the civil society, media, and private sectors. Lead all project planning responsibilities, including the production of annual workplans and budgets and performance monitoring plans, ensuring alignment of the budget to expected results and cost-effective use of resources. Review and approve annual budgets and progress reports, ensuring they are completed and submitted in a timely manner. Ensure compliance with USAID and Pact requirements, policies, and regulations. Oversee all local grantmaking mechanisms, ensuring compliance with USAID regulations and Pact policies; coordinate and/or conduct monitoring visits to grantee programs. Oversee integration of gender and social inclusion (GESI) considerations across all aspects of program planning, implementation, monitoring and evaluation, and learning and management. Recruit and directly supervise local and international project staff in line with Pact policies; oversee the management and development of project office human resources to ensure a diverse, skilled, and productive workforce, an effective leadership team, and an organizational culture where Pact’s values are practiced. Basic Requirements Master's or bachelor's degree in a relevant field such as social sciences, law, or development studies. A minimum of ten (10) years’ experience in the implementation of international development programs, with preference given to democracy and governance activities, human rights. A minimum of five (5) years’ experience in senior management positions, including direct supervision of professional and support staff. In-depth understanding of the role of civil society and media in development Experience building capacity for civil society organizations and networks/coalition strengthening in Nepal. Experience implementing complex and politically sensitive international development programs. Experience with GESI mainstreaming approaches. Expertise in advocacy, accountability, research, media campaigns. Experience establishing and maintaining productive working relationships with a wide network of partners and stakeholders, including international organizations, NGO partners, government institutions, private sector entities, and donor community. Demonstrated knowledge of and experience with working with USAID. Excellent interpersonal, writing, and oral presentation skills in English. Preferred Qualifications Experience managing highly adaptive programs, as well as applying systems-driven approaches and/or thinking and working politically principles. Fluency in Nepali. Experience managing USAID contracts. Nepali nationals are encouraged to apply. Pact is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity or expression, marital status, disability, genetic information, age, citizenship status, genetic information, matriculation, family responsibilities, personal appearance, credit information, tobacco use (except in the workplace), membership in an employee organization, or other protected classifications or non-merit factors.Please click  here  to apply for this position.",
        "level": "Executive",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/chief-of-party-at-pact-world-2165704872?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "PHP Developer",
        "company": "KodeStage Technology Pvt.Ltd",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQH2k_n7T_ZuRQ/company-logo_100_100/0?e=1611187200&v=beta&t=IDuCqn09J-uvzrup74uakuG-Kbvq1Q4-E4Gle2GCR7o",
        "address": "Koteshwar, Bāgmatī, Nepal",
        "desc": "Vacancy Announcement for Laravel DeveloperWe are looking for enthusiastic personnel for the following positions.To apply to send your resume atkodestage@gmail.comBackend Developer - Mid Level Laravel DeveloperNumber of Candidates: 2Experience: 2 yearsQualification- Basic knowledge of Vue js, PHP, JS, HTML, and CSS.- Must have knowledge of CRUD operation in PHP or Laravel.- Basic knowledge of database programming in MySQL.- Experience with CMS like WordPress, Drupal is a plus.- Good at participating with team members in a project and have good communication skills.For more details please follow,KodeStage Technology Pvt LtdBalaju, Near Ganga hall Kathmandu,Gmail: kodestage@gmail.comTel: 9845417277, 9840186294",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/php-developer-at-kodestage-technology-pvt-ltd-2165575761?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Software Engineer (Remote) - $60,000/year USD",
        "company": "Crossover for Work",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_m_twEzTeDA/company-logo_100_100/0?e=1611187200&v=beta&t=Eh2ZRxPY1M79443NwUJglVoPYkwaS6qcZZVOUbxi6Xw",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Do you ever feel like you're the only person on your team that has high standards for code quality? Do you get frustrated when remedial code gets committed to your codebases? Do you long for awesome specs, so you can just focus on writing code?If you are the best software developer on your team, this is the place to fast-track your career in software architecture and engineering. You will contribute to products across multiple domains, unlike the typical role where you are sticky-assigned to a single product or feature.You will learn about dozens of products and cloud technologies, refining and applying your skills on a daily basis, and building on top of the full suite of AWS services. We engineer our products to the highest quality standards, including 100% unit test coverage.Joining us is a great career move! You'll receive weekly feedback on your work and always know what it takes to get to the next level.What You Will Be DoingWriting code! From scratch. New features, new APIs, and 16X performance enhancements - you’ll get a spec and start coding. We expect code that is great, no debate - any decent architect in the world should agree that your code is great.What You Won’t Be DoingFixing other peoples’ code. You won’t debug for a living. Sure, we expect you to test and debug your own code, but you won’t be working through an endless queue of bad code from other developers.Senior Software Engineer Key ResponsibilitiesYou will focus on three major areas: feature development, API development, and performance improvements. You’ll implement specs from all three areas, and across a hundred products in our portfolio. This job is never dull, because you’re always learning new technologies and new products.Basic RequirementsExpert coder in Java, JavaScript, C++ or C#Full stack developer, including mastery of SQL and modern front end technologiesStrong Software Architecture Expertise - you are a systems thinker who understands how each feature fits into the overall design. You can make architectural decisions and document the rationaleQuick Learner. Pick up new products, technologies, and programming languages every weekHands-on experience using mocking frameworks to create unit tests with 100% code coverageAbility to work with a structured and disciplined approach - we aim for the highest quality the first time and every time, no “hacking” Nice-to-have RequirementsA university degree (BS, MS, or PhD) that included in-depth study of data structures, algorithms, object-oriented programming, computer architecture, and software engineeringExperience with cloud, docker and K8s environmentsTrack record of delivering high-quality software based on written specsAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go to www.crossover.com/testimonials to read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important! If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply. Crossover Job Code: LJ-3889-NP-Kathmand-SeniorSoftware.010",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-remote-%2460-000-year-usd-at-crossover-for-work-2207818135?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Python Developer",
        "company": "Kathmandu Jobs",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQEZPXnz5NxOIg/company-logo_100_100/0?e=1611187200&v=beta&t=9QdKXMHWvLijzv-2qp0VOKWg9OWzGvg9KgSfore4XTQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "We are seeking an enthusiastic and experienced Senior Python Engineer. Hands-on experience developing Cloud services in Python, GoLang, Object-oriented programming.- Strong expertise in Django, DevOps.- Familiarity with front-end technologies (like React, JavaScript, and HTML5)- Experience with AWS products such as API gateway, Lambda is plus.- Experience with a relational database such as Postgres (preferred) or MySQL.- Provide ongoing maintenance, support, and enhancements in existing systems and platforms.- Test software development methodology in an agile environment.- Experience with building APIs and services using REST, SOAP, GraphQL, etc.- Collaborate cross-functionally with business users, project managers, and other engineers to achieve elegant solutions.- Excellent logical and problem-solving skills, technical leadershipExperience: 4+ years Experience in Particular DomainAcademic Requirement: Graduates in a particular domain, PG is preferred",
        "level": "Not Applicable",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-python-developer-at-kathmandu-jobs-2006076122?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Finance and Administration Director- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks a Finance and Administration Director for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The Finance and Administration Director will manage the financial operations and reporting of the contract, will oversee and execute sub-contracts with local organizations, and will provide direct administrative functions of the project. This position will be full-time and based in Nepal.Responsibilities Responsible for the financial management, accounting, and financial reporting of the project;  Establish and oversee internal control systems as well as accounting and financial reporting protocols;  Support the COP and DCOP in liaising with home office (US-based) staff on project matters;  Draft, execute, and ensure compliance on sub-contracts developed with local partners in Nepal;  Oversee payroll procedures for national staff, administer payroll, and monitor employee time keeping;  Work with home office staff to develop and implement office administrative and personnel systems;  Supervise finance, HR, and administrative for the project;  Maintain financial files and support annual audits; and  Perform other duties as assigned. Qualifications Bachelor’s Degree (minimum), or a Master’s Degree (desirable), in Finance, accounting, economics, or relevant field.  At least 8 years of professional experience managing project operations, financial and contractual aspects of international development projects. Experience on USAID-funded projects required.  Strong analytical and computer skills, including significant experience with excel and accounting packages.  Experience creating Financial reports  Proven leadership, management, communication and interpersonal skills.  Experience working in Nepal or in the region is highly preferred.  English language fluency required, with excellent written and oral communications skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/finance-and-administration-director-nepal-at-social-solutions-international-inc-1995105325?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer Trainee - .Net",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: .NET TraineeRequirementsGood knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Problem solving skillsGood knowledge curve - Ability to learn quickly and implement Good attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skills QualificationsBachelors in Computer Science / Information Technology or equivalent.Up to 1 year of working experience in development are also encouraged to applyAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-trainee-net-at-verisk-2202378161?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Project Director/Chief of Party, Adolescent Reproductive Health/Family Planning - Nepal",
        "company": "Save the Children US",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQEuQWgonHRtrg/company-logo_100_100/0?e=1611187200&v=beta&t=YpK4VJ3nzO03WtOOP8ve2WFRQ4P2Yl9TH8AJbzJu2LE",
        "address": "National, WV",
        "desc": "SummarySave the Children is seeking a Project Director/Chief of Party (COP) for an anticipated USAID-funded Adolescent Reproductive Health/Family Planning (RH/FP) program in Nepal. The COP will oversee project design and implementation and provide technical expertise and quality assurance for project activities. This person will be SC’s primary point of contact with all relevant stakeholders, including USAID, Ministry of Health, and other international and local partners. The COP will lead a team of experts implementing project activities; prepare reports, annual operating plans, and project deliverables; and ensure the program is compliant with USAID and Save the Children’s regulations. As the project is expected to align with the objectives of the Government of Nepal, the COP will also ensure all activities support in-country priorities, complement existing initiatives, and include plans for sustainability.This position is contingent upon donor approval and funding.What You'll Be Doing (Essential Duties) Lead the development of all project deliverables (e.g., strategic plans, annual and quarterly work plans, detailed budgets, procurement and supply management plans); Supervise and monitor the work of project staff and performance of consortium partners, providing support to ensure high-quality implementation that aligns with USAID guidelines and FP High Impact Practices; Oversee the development and application of strong M&E systems, program monitoring tools, and efficient mechanisms that support high quality implementation; Emphasize the use of data and learning for ongoing program improvement and adaptation; Establish compliance with US Government regulations, policies, and procedures and Save the Children guidelines; Represent the project externally and maintain effective communication, coordination, and positive relationships with key counterparts, such as from USAID, Government of Nepal ministries and divisions (e.g., Ministry of Health and Population, Family Welfare Division, and the National Health Training Center), other international implementing partners, and local NGOs; Actively participate as a member of the Country Extended SMT, contributing to country strategic plans; Create and sustain a work environment of mutual respect where the project team strives to achieve excellence and ensure a cohesive workplace for optimum staff retention; Ensure staff understand SC’s vision and values and fully adhere to SC’s Code of Conduct principles; Ensure project funds are used appropriately and efficiently; and Lead coordination and maintain communication with SCUS Required Qualifications Clinical background in medicine or nursing or masters-level degree in Public Health, Non-Profit Management, or related. Minimum 7-10 years’ of professional experience designing, managing and implementing donor-funded RH/FP, adolescent health, social and behavior change, and/or health systems strengthening programs; At least five years of experience in a senior management role (e.g., as a Program Director, COP, or Deputy COP) leading large, multi-stakeholder programming in a developing country or countries; Familiarity with the processes, procedures, and policies of the Government of Nepal; In-depth knowledge of USAID approaches and regulations; Excellent interpersonal skills and demonstrated ability to lead teams effectively; Creative problem solving skills with the ability to work effectively in resource-constrained environments; Excellent oral and written communication skills in English; and Knowledge of Nepali preferred. Qualified local candidates are encouraged to apply.About Save The ChildrenSave the Children believes every child deserves a future. In the United States and around the world, we give children a healthy start in life, the opportunity to learn and protection from harm. We do whatever it takes for children - every day and in times of crisis - transforming their lives and the future we share.Save the Children is committed to conducting its programs and operations in a manner that is safe for the children it serves and helping protect the children with whom Save the Children is in contact. All Save the Children representatives are explicitly prohibited from engaging in any activity that may result in any kind of child abuse. In addition, it is Save the Children’s policy to create and proactively maintain an environment that aims to prevent and deter any actions and omissions, whether deliberate or inadvertent, that place children at the risk of any kind of child abuse. All our representatives are expected to conduct themselves in a manner consistent with this commitment and obligation. Any violations of this policy will be treated as a serious issue.We provide equal employment opportunities (EEO) to all employees and qualified applicants for employment without regard to race, color, religion, gender, gender identity or expression, ancestry, sexual orientation, national origin, age, handicap, disability, marital status, or status as a veteran. Save the Children complies with all applicable laws.  ",
        "level": "Executive",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/project-director-chief-of-party-adolescent-reproductive-health-family-planning-nepal-at-save-the-children-us-2172567620?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Associate Director, Technical, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director.  The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position Description:The Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration.  The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects.  This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region.  This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups.  The Technical Director will  support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life.  She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work.  The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team.  Availability of position is contingent upon award to FHI 360.Key responsibilities:Assist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualifications:At least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package, professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself. Please click here to continue searching FHI 360's Career Portal. About Us FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in health, education, nutrition, environment, economic development, civil society, gender, youth, research, technology, communication and social marketing — creating a unique mix of capabilities to address today's interrelated development challenges. FHI 360 serves more than 60 countries and all U.S. states and territories.As we evolve to meet the challenges of the future, we stand committed to the principles that have guided our organization for the last 40+ years. Our work continues to be grounded in research and science, strengthened by partnerships and focused on building the capacity of individuals, communities and countries to succeed.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 will never ask you for your career site username or password, and we will never request money, goods or services during the application, recruitment or employment process. If you have questions or concerns about correspondence from us, please email CareerCenterSupport@fhi360.org.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/associate-director-technical-csm-nepal-at-fhi-360-2173706271?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "HR Manager- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International Inc. seeks an HR Manager for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The HR manager will lead all HR functions of the project and will be based in Nepal.Responsibilities Lead the full-cycle recruitment process including finalization of job descriptions, advertisement of vacancies, review of applicants, scheduling and conducting interviews alongside project senior management, checking candidate references, and collecting new hire documents;  Onboarding/orientation of new project hires;  Manage employee benefits enrollment;  Coordinate the performance evaluation process;  Provide information and advice to project staff regarding HR policies and procedure.  Coordinate staff training and establish staff development plans based on appraisals and evaluations;  Create and maintain personnel files;  Provide oversight related to the updating of personnel files and other related HR documents including employment agreements, amendments, time sheets, calendar holidays and leaves;  Perform other duties as assigned. Qualifications Bachelor’s degree in human resources, business administration or a related field is required.  At least five (5) years of progressively responsible HR experience.  Excellent communication and interpersonal skills.  Excellent record keeping and documentation skills.  Familiarity with donor/client rules and regulations.  Familiarity with local employment law.  Proficiency with Microsoft Office; and  Verbal and written working proficiency in English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/hr-manager-nepal-at-social-solutions-international-inc-2010750097?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior/Principal Engineer - .Net Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionWhat you get to do every day:Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsPossess strong troubleshooting, code optimization and refactoring skills.Experience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Leadership quality and ability to guide design and technical meetingsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal)QualificationsYou must have demonstrated experience in several of these domains and technologies:Bachelor’s degree in Computer Science, Engineering or a related subjectAt least 4 years full-time work experience in .NET technologiesStrong ability to build RESTful services in C# with .NET/.NET CoreExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Proficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNExperience working on AWS based solutions and knowledge of Microsoft SharePoint Technologies would be a plus.Additional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-principal-engineer-net-developer-at-verisk-2197785986?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Evaluation Lead- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks an Evaluation Lead for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Work with the Contracting Officer’s Representative (COR) and other USAID technical staff to develop the necessary methodologies to meet the deliverables required in the SOWs for evaluation tasks.  Manage the subcontractors to assure performance to task requirements and timelines and development of quality deliverables.  Provide technical and editorial feedback on internal and external deliverables for studies.  Provide technical inputs in designing surveys, assessments, and evaluations (performance and impact)  Oversee conduct of evaluations, studies, assessments, and surveys to assess the status and impact of USAID s activities  Document lessons from evaluations and incorporated in the MEL Activity s progress reports.  Foster knowledge sharing and disseminate evaluation findings and lessons to increase awareness and knowledge.  Supervise monitoring and evaluation staff.  Liaise with Mission staff, Implementing Partners, Government of Nepal and NGO stakeholders. Qualifications A Master’s degree in a field relevant to monitoring and evaluation or international development (e. g., economics, public policy, international relations, statistics, political science, health, education, agriculture, etc.).  At least 10 years of experience working in monitoring and evaluation of international development programs  At least 3 years of experience serving as the team lead for evaluations  Experience guiding recruitment and hiring of consultants related to M&E work.  Experience leading the development of evaluation scopes of work (SOWs)  Significant experience in qualitative and/or quantitative analysis, data collection, and reporting  Knowledge of USAID evaluation policies and regulations.  Excellent oral and written communication in English and Nepali; and  Strong interpersonal skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/evaluation-lead-nepal-at-social-solutions-international-inc-2176224191?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Advisor (Family Planning & Sexual and Reproductive Health Services) USAID Nepal Family Planning",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories.We are currently seeking qualified candidates for the position of: Technical Advisor (Family Planning & Sexual and Reproductive Health Services) (FP/SRH)for an anticipated Family Planning Opportunity in Nepal. This position is subject to project award and funding. Position DescriptionThe Technical Advisor (FP/SRH) will contribute to the overall project through strategic planning, evidence generation and dissemination, coordination, and advocacy. S/he will also work with the project team to deliver, document and disseminate results in an effort to improve knowledge management. S/he will be responsible for the oversight and technical direction of service delivery, and community and household-level strategies and interventions to further reduce the unmet need for FP/SRH including adolescent sexual and reproductive health (ASRH) services.S/he will also provide technical support in i mproving access to FP/SRH including ASRH services, in the areas of reaching underserved populations, reaching male and female , adolescent girl and young women coordinating with a social marketing program, expanding community-based FP/SRH services, including contraception, increasing access to SRH information, including comprehensive sexuality education, develop different community outreach strategies, developing innovative approaches to increasing the contraceptive prevalence rate (CPR) identifying the needs of specific target groups such as very young adolescents, young mothers, and vulnerable girls.This position is based in Kathmandu, Nepal, and will report to the Chief of Party.Key ResponsibilitiesLead the team in designing, implementation and management of the FP/SRH including ASRH component project; ensure high-quality program implementation through monitoring and oversight in close coordination with project staff.Provide technical assistance to strengthen the capacity of project staff, partners and other government staff to design and implement quality FP/SRH including ASRH programing using global best practicesProvide technical guidance and strengthen capacity of district health institutions and other implementing partners for the delivery of a range of quality FP/SRH including ASRH services in line with the project guidelines.Work with government and other stakeholders on informing policy, guideline development, as well as advocacy on key health service delivery issues.Ensure technical quality of training activities through facilitative supervision and monitoring; jointly with government and partners, where feasible;Lead all FP/SRH activities of the project in the geographical jurisdiction assigned. The person will coordinate, identify and mobilize stakeholders who will be collaborators in the implementation of activities, oversee activity roll out, implement and sustain knowledge and demand for servicesConduct needs assessments undertaken by the project in the area, including those for training needs, other assessments to be undertaken in the program in regards FP/RH.Establish and maintain effective follow-up and support system for partner agencies on FP/RH components as planned, ensuring performance of all FP/SRH indicators.Strengthen collaboration with the key stakeholders and partners including other USAID-funded projects for shared results through addressing both supply and demand side issues in the overlapping program districts.Represent project at the center and provincial level meetings/workshops among the Government of Nepal (GoN) officials, key stakeholders and partners including USAID partners FP team meetings and FP Sub-Committee, ASRH Sub-Committee meeting and other relevant Technical Working Group meetings led by the Family Welfare Division.Strengthen collaboration with other key players on ASRH, GoN and stakeholders at sub-national levels for improving quality Adolescent Friendly Services from the GoN designated service delivery sites.Minimum RequirementsAt least a master’s degree or bachelor’s degree in Medicine; an additional qualification in Public Health with specialization on SRH, would be advantageous;At least have 5 – 8 years of experience and knowledge of FP/SRH including ASRH especially in the areas of implementation, and managing of public health/international development programs funded by US government or other international donors;Excellent skills in capacity building and experience in conducting trainings of different categories of stakeholders.Knowledge of public health related issues, sensitivity to cultural differences and understanding of the political and ethical issues surrounding public health issues; written and verbal communication skills.Excellent oral and written communication skills in English; knowledge of local language will be an advantage.This job description summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-advisor-family-planning-sexual-and-reproductive-health-services-usaid-nepal-family-planning-at-fhi-360-2005156503?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer - Front End Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionResponsibilities -  Make design and technical decisions for Angular projects Perform unit testing by using different frameworks like Jasmine, Karma Be involved in all phases of the agile software development lifecycle Proactively seek out and minimize pain points within the infrastructure and code base Keep up to date with the latest technologies and introduce them as needed Create next-gen solutions for unique and challenging use cases Communicate proactively with Business stakeholders and provide design suggestions Analyze, debug and fix defects QualificationsEducation Level: Bachelor’s in Computer Science, or related field or equivalent experienceExperience Required: At least 3 years of professional experience in JavaScript / Angular TechnologySkills And Knowledge - Passion for programming in general, rather than a specific language Be focused, passionate, and strive to find simple solutions to complex problems Ability to learn new, emerging technologies You have a solid general understanding of application components, what happens on the front end, what happens on the back end. You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the above Ability to effectively work on multiple projects simultaneously and effectively contend with competing priorities Possess strong troubleshooting, code optimization and refactoring skills Have strong sense of ownership with demonstrated ability to work independently without supervisionTechnical Expertise JavaScript frameworks (Angular 4+ - preferably the latest verison, AngularJS, React, jQuery), RxJs, Redux, Web markup languages (HTML/HTML5, XML) and Style sheet language (CSS/CSS3), SASS, LESS Well versed in using UX and UI design tools like Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe XD Experience in working with using html frameworks like Bootstrap and Foundation Writing tested and documented JavaScript with Expertise in build processes (Angular CLI, Webpack) Experienced in writing test cases and performing unit testing using frameworks (ex. Jasmine, Karma) Used DevOps and CI/CD in previous work experience Developed software in SCRUM environment using Agile methodologies and involved in SDLC processAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-front-end-developer-at-verisk-2202377424?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Monitoring & CLA Expert, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a Monitoring & CLA Expert for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Primarily responsible for delivering learning results and tracking adaptations for lessons learned;  S/he will provide vision and leadership to the Mission’s “learning” agenda; ensure the quality, timeliness and technological sophistication of services related to improving the integrity and usefulness of USAID/Nepal monitoring and reporting systems; ensure the quality, relevance, technological sophistication and timeliness of Contractor-provided evaluations, analyses and assessments; deepen USAID/Nepal’s existing learning capabilities and introduce improved avenues to learning;  Leads contractor contributions to USAID/Nepal’s efforts to deliberately draw contextual, programmatic and operational learning from its monitoring, evaluation, analytical and assessment efforts; and facilitate learning’s transformation into adapting.  Promote CLA Activities for strategic collaboration in order to identify possible program and context gaps at the strategy level as well as offer periodic opportunities to reflect on progress, such as after-action reviews and partner meetings to inform on possible adaptation changes.  Conduct and lead meetings, workshops and presentations for USAID/Nepal and other staff and outside stakeholders, as appropriate.  Support a series of workshops and conferences to convene USAID staff, implementing partners, and local stakeholders to discuss challenges, share best practices, and foster collaboration on specific topics related to USAID’s areas of intervention.  Support Mission staff in aligning policies, practices and processes with lessons learned.  Collaborate closely with and manage other activity staff from the Evaluation, CLA, and GIS Teams.  Ensure that all products and services meet USAID and Social Solutions quality expectations.  Support the Mission in the development of Data Quality Assessments (DQAs). This task will entail field visits to review and analyze the quality of data collection procedures and ensure that the standard definition of indicators is being properly understood and applied.  Identify, jointly with USAID/Nepal, relevant context indicators for the Mission’s programming at the national, departmental and municipal level, and collect and update data for the context indicators identified in available secondary sources and USAID datasets derived from evaluations and assessments.  Contribute to the construction of tables and dashboards for consulting context indicator data.  Support the Mission and its implementing partners (IPs) in the data collection of baseline and monitoring data. In particular, support implementing partners to identify and gather data on context and impact indicators.  Review and analyze context and performance data collected by the contractor or USAID implementing partners, particularly for MEL purposes.  Contribute to data collection and standardization of cross-cutting issues, such as gender equality and female empowerment. Qualifications A Master’s Degree in social sciences, statistics, or related fields.  At least 10 years of progressive experience in designing, implementing, managing, and analyzing monitoring related tasks for development projects, including the development of context and complementary indicators or similar monitoring approaches at the Mission-level.  At least three years of experience in Southeast Asia is strongly preferred.  Field experience that includes at least some but not necessarily all of the following: Survey research experience, including development of structured and semi-structured interviews.  Structured or semi-structured group interviews and/or focus groups, including the creation of written instruments and transcripts for same; content analysis and other techniques for coding and transforming group/open-ended data into analyzed information.  Experience implementing quantitative and qualitative data collection and analysis for evaluations and assessments, including experience with sampling methods, database management and statistical analysis.  Applied experience with non-experimental theory testing techniques for examining program/project effects (baseline reconstruction, outcome mapping, outcome harvesting, general elimination method (modus operandi), contribution analysis, lagged regressions and/or others).  At least five years of experience leading evaluation or research teams.  Excellent team management and interpersonal skills, including some workshop facilitation skills.  Excellent team management and interpersonal skills.  Fluency in spoken and written English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/monitoring-cla-expert-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-2010545309?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Software Engineer- ETL Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Senior Software Engineer/ETL DeveloperExperience Required: 4+ years of overall industry experience with experience in ETL design/development. ReceivedResponsibilitiesSupport, development and data operation workload.Coordinate and communicate effectively with team members and various stakeholders.Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements.Identify and test for bugs and bottlenecks in the ETL solution.Ensure the best possible performance and quality in the packages.Participate in different support activities.Skills And ExpertiseExperience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting.Experience with ETL tools and processes (Pentaho/PDI preferred)Experience or Knowledge in Data masking and Data integrity check.Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc.Experience in writing advanced SQL scripts.Experience or Knowledge in AWS Services.Experience working in an Agile development process.Excellent problem solving and data analysis skills.Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features.Demonstrated ability to work independently with minimal supervision.Good communication skill in verbal and written.Ability to troubleshoot and maintain mid-level to complex applications. QualificationsEducation Level: Bachelor’s degree in Computer Science, Engineering or a related subjectAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-etl-developer-at-verisk-2197792079?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "MEL Specialist, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a MEL Specialist for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Work with the Contracting Officer’s Representative (COR) and other USAID technical staff to develop the methodologies necessary to meet the deliverables required in the SOWs for evaluation tasks.  Serve as lead analyst for interpreting the results of surveys and other field data and responsible for report preparation.  Assist in the assessment of impact evaluations and performance monitoring.  Develop M&E plans, define project indicators, and collect and review monitoring data.  Contribute to performance and impact evaluations through questionnaire development, key informant in-depth interviewing, managing survey data collection, reviewing data, preparing datasets, analyzing quantitative or qualitative data, and report writing.  Interpret outcomes of implementation through data or other evidenced-based sources and provide program recommendations as needed.  Assist in the management of field monitoring, evaluation design, empirical and statistical analysis, environmental compliance, and management of information systems.  Provide quality assurance/quality control for local subcontractors.  Collect and verify data on technical implementation, coordinate with both technical and operation staff and contribute to overall project reporting requirements as per contractual agreements. This might entail, and not be limited to, quarterly and weekly reports, evaluation and case studies, success stories, etc.  Work closely with project leadership and manage directly project efforts to effectively design and implement dissemination strategies and activities to communicate analytical products developed under the project as part of learning and/or strategic communications and public outreach agenda.  The successful candidate will take the lead in supporting learning agendas, collaboration, learning and adapting, and knowledge management activities; all aimed at facilitating effective collaboration and promote learning and sharing among stakeholders. Qualifications A Bachelor's degree or higher in a relevant field, such as applied social sciences, development economics, or monitoring and evaluation.  A minimum of 5 years of progressive responsibility working in M&E for donor­ funded development programs. Previous USAID experience is a plus.  Experience in developing performance management plans (PMPs) and conducting data quality assessments (DQAs); analyzing both qualitative and quantitative data; using online M&E databases to collect performance indicators; conducting routine monitoring of data for a donor-funded project; and conducting participatory or impact evaluations.  Experience writing findings and recommendations in assessment or evaluation reports.  Experience in report writing, especially under USAID contracts, and development of dissemination; knowledge management and communication strategies.  Strong organizational, writing and communication skills.  Strong proficiency in MS Office suite (Word, Excel, Outlook, PowerPoint).  Ability to coordinate well with personnel within and outside the project, meet deadlines and work with minimal supervision.  Computer literacy, with ability to analyze and interpret data using Excel, online reporting tools, or statistical packages such as SAS, SPSS, or STATA.  Fluency in spoken and written English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/mel-specialist-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-1884438225?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer- ETL Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Software EngineerExperience Required: 2+ years of overall industry experience with experience in ETL design/development.ResponsibilitiesSupport, development and data operation workload.Coordinate and communicate effectively with team members and various stakeholders.Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements.Identify and test for bugs and bottlenecks in the ETL solution.Ensure the best possible performance and quality in the packages.Participate in different support activities.Skills And ExpertiseExperience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting.Experience with ETL tools and processes (Pentaho/PDI preferred)Experience or Knowledge in Data masking and Data integrity check.Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc.Experience in writing advanced SQL scripts.Experience or Knowledge in AWS Services.Experience working in an Agile development process.Excellent problem solving and data analysis skills.Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features.Demonstrated ability to work independently with minimal supervision.Good communication skill in verbal and written.Ability to troubleshoot and maintain mid-level to complex applications. QualificationsEducation Level: Bachelor’s degree in Computer Science, Engineering or a related subjectAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-etl-developer-at-verisk-2197787818?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "GIS Advisor, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a GIS Advisor for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support the USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Assess and review the status of the GIS capacities of the Mission and implementing partners (IPs), including a review of the products and analyses done.  Develop the necessary GIS standards and templates for the Mission and IPs in order to standardize GIS-related deliverables and data submission.  Implement GIS best practices in areas such as geospatial metadata standards, workflows, and data-sharing protocols.  Using visualization tools, assist USAID subject matter experts with spatial analytical thinking for improved planning, monitoring, evaluation, learning, and reporting of programs.  Assist USAID/Nepal in planning and collection of all GIS-related data elements of monitoring, evaluation, and learning, e.g., surveys, evaluations, and baseline collections, as well as in the preparation of the corresponding maps, as required.  Collect geographic location coordinate data from USAID implementing partners and conduct onsite visits to complement available data.  Prepare clear visualizations showing the results of data analysis to USAID and relevant stakeholders, using various formats as appropriate (paper, web-based, GEO PDF, story maps, etc.). Define and apply a production workflow to streamline data management from collection to cartographic output. When relevant, collect, clean, and process the data from disparate sources and format for reporting on ad-hoc GIS-related requests.  Collaborate with the geospatial community both locally and internationally and build working-level contacts with international and bilateral donor organizations responsible for the coordination of donor assistance. Qualifications University Degree in a related field required; advanced degree preferred.  Experience with GIS/information systems required.  Minimum of 5 years’ project implementation experience with USAID or other development donors.  Fluent oral and written communication skills in English; strong oral and written communication in Nepali strongly preferred.  Knowledge of development issues in Nepal/Southeast Asia region.  Ability and willingness to travel throughout Nepal and the region.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Associate",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/gis-advisor-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-2000709312?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer/Data QA Automation Engineer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Software Engineer/Data QA Automation EngineerExperience Required: 1 to 3 years of professional experience in Software Quality Assurance, back-end data testing and Data QA AutomationResponsibilitiesAct as QA lead on a wide variety of data intense projectsLead analysis for the purposes of developing test cases and test data for back-end data intense applicationPerform hands-on manual testing while scripting automated tests to ensure application and data quality.Test ETL systems in Pentaho which includes Data Analysis, Test Data Creation in different format/input files and Testing regulated data – majority in a scripted automated environment.Continuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation Suites. Serve as a liaison to business analyst and product owner, providing feedback on application readiness for migrations.Skills And ExpertiseProficient in SQL queries and Relational Database concepts, Aurora Postgres, data structures and data operations in general.Expertise in data workflow testing, data analysis, Test Data Creation in different format/input files along detailed data verification testing with handling regulated dataExperience in ETL testing - Pentaho / Microsoft SQL Server Integration Services (SSIS)Technically familiar with development concepts and formats such as SQL, XML, JSON and scripting languagesExperience in testing non-GUI applications (SQL, Flat Files, XML, JSON etc.)Strong understanding of object-oriented programmingGood knowledge of a programming/scripting language – JAVA, Scripting, PythonKnowledge or Experience in AWS Services is a plus, but not required. Sound technical background, great communication skills, and a motivation to achieve results in a fast-paced environmentA wholesome QA resource with an ability to put together test plan and test case scenarios, create test data and verify output using scripted scenariosPossess excellent problem-solving abilitiesKnack for writing clean, readable, and easily maintainable QA automation workflowsProficient in developing and implementing automated testsProficient understanding of code versioning tool and familiarity with Continuous Integration atmosphereQualificationsEducation Level: Bachelor’s in Computer Science, or related field or equivalent experienceAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-data-qa-automation-engineer-at-verisk-2197790579?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    }
]
