[{"name": "Javascript Developer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "Javascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowJavascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveJavascript DeveloperatMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletHiring For React Native DeveloperJob description:Develop React Native applications for both iOS and AndroidBuild reusable components and front-end libraries for future useLeverage native APIs for deep integrations with both platforms.Create UI Screen and Modules in both iOS and Android and integrate with React Native applicationDiagnose and fix bugs and performance bottlenecks for performance that feels native.Create software code, unit tests and assist with encoding, testing, debugging, and documentation.Review requirements, wireframes, and designs for technical feasibility, work with the scrum team to translate these into user stories that can be implementedImprove product quality through code reviews, writing effective unit tests, and collaborating with QA to implement automation testing where appropriateWork closely with Backend team for the product’s admin setup.Required Candidate profileMinimum 2 year relevant and real time experience in ReactNative.Strong JavaScript fundamentals and ES6 knowledge, ReactNative / NodeJS, MVC, Design Patterns, REST APIs, Swagger, AWS and GAEFamiliarity with state/data management libraries (Redux, Mobx) is a plus.Strong debugging skills with the ability to reach out and work with peers to solve complex problemsFamiliarity with code versioning tools such as GitKnowledge of general mobile landscape, architectures, trends, and emerging technologies.Experience in automated testing suites, like Jest/ Mocha/ Express is a plus.Experience with Agile Development mythology.Candidate should have strong communication skills, should be able to work independently & provide guidance to junior/other team membersAmbitious, willing to work hard and invest in building a great career.Candidate who care more about what they learn and the impact they make.Take ownership of all tasks.Believe in work-life integration. passion > work-life balance.Must have experience into Android/ IOS DevelopmentMust have experience in Hybrid apps DevelopmentWilling to work with cross-platform frameworksExperience with consuming REST API’sKindly share your CV on sp@moru.com.npShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/javascript-developer-at-moru-digital-wallet-2211129923?refId=b354368a-e1b0-44df-a325-2477111df48a&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Web Developer", "company": "JoBins", "address": "Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "Web DeveloperJoBinsBāgmatī, NepalApply NowWeb DeveloperJoBinsBāgmatī, Nepal1 week ago25 applicantsSee who JoBins has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveWeb DeveloperatJoBins.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from JoBinsTokunaga YujiJoBinsWe are currently seeking a Laravel developer.As a developer, you will be a vital member of our top-shelf engineering team with lots of growth potential.You will be joining the team committed to working on high-quality code and will work closely with the product team to develop new features for our platform.PHP Developer QualificationsPHP 7 >Know the differences between PHP CLI, PHP FPM and PHP Apache ModCapable of configuring a stable PHP application using php.ini on a variety of platformsCapable of configuring and utilizing Xdebug in your programming workflowCapable of writing code that is compliant with PSR12 StandardsLaravel FrameworkDeep understanding of the Laravel framework and their toolsetComfortable working with the Laravel Service Container and dependency injectionCapable of writing Artisan CLI commands and working with message queuingAccomplished architecting a Laravel web application from start to finishMySQL, PostgreSQLCan work directly with the MySQL,PostgreSQL data layer using either CLI or GUI toolingCan import/export data setsYou should be able to set up indexes and foreign key constraintsUnderstand relational data setup and performance bottlenecksBonus experience includesDev Ops – AWS, Linux/Bash, Apache2, Nginx, Docker/Vagrant/Virtual ServersPHP Core – PHP 5, PHP 7, MySQLPHP Frameworks – Laravel, SymfonyPHP Tooling – Xdebug, Composer, PHP-CS, PSR2 Coding StandardsFront End – NPM/Yarn, Webpack, React/Angular/Vue, Bootstrap/Reactive DesignTooling – Version Control (git)Qualifications3+ years’ of experience in web development and software designBachelors degree in computer science or related fieldGreat communication skills in addition to good English speaking skillsProblem solver with a motivation for quality software craftsmanshipBenefitssalary: 500 yen/hour　（ about 96,700yen/ month ）holiday:Saturday( depends on company calendar )Regular conferences, purchase of books and e-learning to improve technical skillsProject selection and technical platform exposure optionsSmall company, family-style culture doing large and impactful workpossibility of work in JapanShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetProgram DevelopmentReferrals increase your chances of interviewing at JoBins by 2xSee who you knowTurn on job alertsWeb Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/web-developer-at-jobins-2213513336?refId=b354368a-e1b0-44df-a325-2477111df48a&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Full stack Developer", "company": "Tech Ball Solutions", "address": "Nepal", "deadline": "3 weeks ago", "desct": "Full stack DeveloperTech Ball SolutionsNepalApply NowFull stack DeveloperTech Ball SolutionsNepal3 weeks ago25 applicantsSee who Tech Ball Solutions has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveFull stack DeveloperatTech Ball Solutions.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Tech Ball SolutionsPrashant AdhikariDigital Marketing Manager| Web Developer| Branding| Content Marketing| Blogging| Data AnalystJOB DESCRIPTIONLooking to hire experienced full stack developer who can handle the projects and has extensive skill on project management.Please message for queries!Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Tech Ball Solutions by 2xSee who you knowTurn on job alertsFull Stack Developer in NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-developer-at-tech-ball-solutions-2176653189?refId=b354368a-e1b0-44df-a325-2477111df48a&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer - Java Developer", "company": "Verisk", "address": "Lalitpur, Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Software Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, NepalApply NowSoftware Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who Verisk has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveSoftware Engineer - Java DeveloperatVerisk.Email or phonePasswordShowForgot password?Sign inReport this jobCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized byForbesas a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionDesign, implement and maintain java applicationTo take part in software and architectural development activitiesWrite well designed, testable, efficient codeEnsure designs follow specificationsPrepare and produce releases of software componentsRecommend changes to improve established java application processesQualificationsBS degree in Computer Science, Engineering or a related subject2 to 3 years of professional experience in Java based application developmentSkills And KnowledgeMust have passion for development and ability to learn latest technologiesExcellent understanding of object-oriented design concepts and software development processes and methods.Expertise in application, data and infrastructure architecture disciplinesGood knowledge of architecture, design and business processesDemonstrated ability to work independently with minimal supervision.Possess strong troubleshooting, code optimization and refactoring skills.Technical ExperienceMandatory skills – the person must be STRONG in each discipline and will have to explain in detailJava, J2EE Framework, RESTful web services pattern, Spring Framework, JavaScript frameworks (JQuery, AngularJS, and EmberJS), SQL and NoSQL databases (preferably MongoDB, MSSQL and/or Postgres), RabbitMQ/SQS, Solr/Lucene/Elastic Search, Tomcat, SVN, GIT, Test-Driven DevelopmentExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Experience in cloud and serverless technology (preferably AWS) would be a major plus pointProficient experience working with Maven, Jenkins, Chef, CodeDeploy, Bamboo, Octopus or any CI/CD tools and understand of continuous integration/continuous delivery. Willing and able to work with DevOps team and contribute to CI/CDExperience working in an Agile development processKnowledge of AWS LAMBDA and monitoring tools such as Solar winds and New Relic would be a plusAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy NoticeShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareFinancial ServicesReferrals increase your chances of interviewing at Verisk by 2xSee who you knowTurn on job alertsSoftware Engineer in Lalitpur, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-java-developer-at-verisk-2223180824?refId=b354368a-e1b0-44df-a325-2477111df48a&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Front End Web Developer", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "Front End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, NepalApply NowFront End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, Nepal1 week ago55 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveFront End Web DeveloperatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionCloudFactory’s mission is to help visionary companies power disruptive technology while connecting 1 million people in the developing world to meaningful work. We are looking for ambitious people who seek greater meaning in their work and want to use their talents to make the world a better place.For companies from startup to enterprise, CloudFactory provides a tech-forward, professionally managed workforce solution for routine data work. Our teams are agile, scale fast, and help innovators get their technology to market fast. Trusted by 100+ companies, CloudFactory processes millions of tasks every week for companies including Microsoft, Drive.ai, Expensify, Ibotta, and GM-Cruise Automation.At CloudFactory, we believe that talent is equally distributed, but opportunity is not. Founded in Nepal in 2008, we connect people to digital work and give them the skills to be leaders in their own communities. We’re on a mission to create economic and leadership opportunities for talented people in developing nations. As an impact sourcing service provider (ISSP) and recipient of a program related investment from The Rockefeller Foundation, we are a global leader in the impact sourcing movement.With $13 million in venture capital raised and 100%+ growth year over year, we are expanding our business quickly and sustainably. Our headquarters is in Reading, U.K., and we have offices in Kathmandu, Nepal; Nairobi, Kenya; and Durham, N.C.Join us and make a difference in the world!ResponsibilitiesUsing HubSpot’s CMS, work with the CloudFactory marketing team to maintain and build upon CloudFactory’s website, microsites, and other digital assetsProvide technical assistance in maintaining CloudFactory’s digital assets in an agile environmentOptimize our website and landing pages for speed and related search engine indexing and performance metrics (SEO)Analyse marketing data, understand user behavior and experience, and systematically map out UI/UX improvement suggestionsProvide technical assistance as the team launches and iterates on various marketing campaignsRequirements1+ year of experience in web developmentFluency in HTML and CSS. Ability to handcraft web pages and formsKnowledge of JavaScript (and jQuery) for client-side scriptingAbility to add interactive behaviors in web pagesAble to work with JSON data using JavaScriptProficient understanding of responsive design and cross-browser (Google Chrome, Firefox, & IE) compatibilityUnderstanding of web design and development best practicesExcellent analytical, problem-solving, and communication skillsInsatiable curiosity about the latest and greatest tools, hacks, and optimization strategiesExcellent written communication skills (English) with keen attention to detailHelpful SkillsFamiliar with Photoshop or other graphic design tools such as Canva are desirableKnowledge of Google analytics, SEO, Google Search Console, and Inbound Marketing are big plusesExperience using Hotjar or similar apps is a big plusExperience in B2B — high-tech products and services preferredThese HubSpot certifications (in this priority order) are a plus:Growth Driven DesignDesignMarketing SoftwareSEOInboundBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsFrontend Web Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/front-end-web-developer-at-cloudfactory-2209358538?refId=b354368a-e1b0-44df-a325-2477111df48a&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Android Developer", "company": "Softyca Inc.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "1 month ago", "desct": "Android DeveloperSoftyca Inc.Kathmandu, Bāgmatī, NepalApply NowAndroid DeveloperSoftyca Inc.Kathmandu, Bāgmatī, Nepal1 month agoBe among the first 25 applicantsSee who Softyca Inc. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveAndroid DeveloperatSoftyca Inc..Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Softyca Inc.Vijay NeupaneVisit softyca.orgResponsibilitiesWork closely with the product team and other teams globally to deliver robust end-to-end featuresBe responsible for unit testing and ensuring quality of own codeSupport internal customers using our products - write great sample code and documentation and respond to technical queriesInfluence technical strategy to build products developers will loveMake others better through mentoring, sharing knowledge and promoting a collaborative team cultureFollow and help define our development best practices for coding standards, code reviews, source control management, build processes, testing, and deploymentMinimum Qualifications2+ years' experience building native mobile applications & mobile SDKs/libraries (both is ideal)Experience with Swift & Kotlin (both is ideal)Automation experience, including CITest design and implementation experienceExperience integrating with backend API servicesAn understanding of what should be considered when building and deploying librariesExcellent critical thinking, problem solving and communication skills and able to take ownership of tasksAbility to pick up new technologiesPreferred QualificationsExperience with Java (Android) or Objective-C (both is ideal)Hybrid/JavaScript development with React Native, Cordova or similarInterest in mobile software architectureMobile/Web/Hybrid UI developmentShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Softyca Inc. by 2xSee who you knowTurn on job alertsAndroid Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/android-developer-at-softyca-inc-2179238438?refId=b354368a-e1b0-44df-a325-2477111df48a&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Android Developer", "company": "Cloudyfox", "address": "Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "Android DeveloperCloudyfoxBāgmatī, NepalApply NowAndroid DeveloperCloudyfoxBāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Cloudyfox has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveAndroid DeveloperatCloudyfox.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from CloudyfoxSanjeev ThapaDirector Of Technology Services at Aximpro GmbHWe are looking for experienced kotlin developer to join our team ideally with an experience of leading a small team.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Cloudyfox by 2xSee who you knowTurn on job alertsAndroid Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/android-developer-at-cloudyfox-2204901586?refId=b354368a-e1b0-44df-a325-2477111df48a&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Senior MS-SQL Developer", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "5 days ago", "desct": "Senior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal5 days agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveSenior MS-SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Position: Senior MS-SQL DeveloperResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.QUALIFICATIONS AND EDUCATION REQUIREMENTSBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLSMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.PREFERABLE SKILLSExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)SOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSQL Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-ms-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220508772?refId=b354368a-e1b0-44df-a325-2477111df48a&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Database Administrator/Developer", "company": "Omnicom Media Group", "address": "Bāgmatī, Nepal", "deadline": "4 weeks ago", "desct": "Database Administrator/DeveloperOmnicom Media GroupBāgmatī, NepalApply NowDatabase Administrator/DeveloperOmnicom Media GroupBāgmatī, Nepal4 weeks ago27 applicantsSee who Omnicom Media Group has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveDatabase Administrator/DeveloperatOmnicom Media Group.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Omnicom Media GroupKalpana ThamsuhangHuman Resources at Omnicom Media Group NepalRole OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages.Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with.Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link athttps://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionMarketingInformation TechnologyOtherIndustriesMarketing and AdvertisingReferrals increase your chances of interviewing at Omnicom Media Group by 2xSee who you knowTurn on job alertsDatabase Administrator in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2170970181?refId=b354368a-e1b0-44df-a325-2477111df48a&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Developer (Remote) - $30,000/year USD", "company": "Crossover for Work", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "3 days ago", "desct": "Software Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, NepalApply NowSoftware Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who Crossover for Work has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveSoftware Developer (Remote) - $30,000/year USDatCrossover for Work.Email or phonePasswordShowForgot password?Sign inReport this jobIf you're early in your software engineering career and have big goals to become a top tier developer, this is the career-building role you have been searching for.In this role, you'll be part of an engineering team comprised of the top 1% of global talent focused on re-building and re-factoring essential B2B products before re-deploying them as true cloud-native applications. We have an obsession with software code quality (In our last quarter, shipping every 7 days, we pushed over 16,000 code changes across 120 products with less than a dozen regressions!). We expect nothing less than perfection and have invested in building the standards and tools that will allow you to off-load highly manual, labor-intensive, and low-level development work and focus on building great software.This is a unique opportunity to build a strong career foundation working in a role with a laser focus on high quality code across multiple products at once. We will teach you how to meet our demanding quality standards so you can ship perfect code. Don't waste your time working in those other teams that lack the right work structure and commitment to code quality. Join us in rebuilding products as cloud-native applications and take your career to the next level.What You Will Be DoingWrite production code for hundreds of commercial SaaS products following a TDD methodologyPerform more substantive work due to the huge investment we've made in tooling and automation based on the ideas provided by our engineers.What You Won’t Be DoingGetting spoon-fed easy changes or small parts of complex problems already solved by senior team members.Getting bored being focused on a single, slowly-evolving codebase. In this role you'll learn new codebases and tech stacks week to week.Reviewing someone else's code to find issues and errors.Software Developer Key ResponsibilitiesWe hire the top 1% of engineering talent and place you in a highly specialized role working on multiple products at a time. In this role you will:Write high quality code every dayCreate elegant solutions to resolve difficult bugsBasic RequirementsTo produce high-quality work in this role you must hold firm:A belief in test-driven developmentA love for simple, clear, bullet proof-code and elegant solutions, andAn obsession with eliminating bad code that drives you to refactor badly written code before inserting a line of your ownAbility to ramp up quickly, learning new codebases and technologies every weekYou must have a deep specialization with a minimum of 2 years of professional experience in one of our 4 core languages: Java, C#, C++ or JavascriptAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go towww.crossover.com/testimonialsto read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important!If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply.Crossover Job Code: LJ-3890-NP-Kathmand-SoftwareDevelo.021Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionBusiness DevelopmentEngineeringInformation TechnologyIndustriesBankingElectrical/Electronic ManufacturingFinancial ServicesReferrals increase your chances of interviewing at Crossover for Work by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-developer-remote-%2430-000-year-usd-at-crossover-for-work-2247869176?refId=b354368a-e1b0-44df-a325-2477111df48a&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Jitpur, Nepal", "deadline": "4 days ago", "desct": "Azure Developer – Remote, Full-timeToptalJitpur, NepalApply on company websiteAzure Developer – Remote, Full-timeToptalJitpur, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveAzure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Azure Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProficiency in Azure is requiredProject management skillsA keen attention to detailNote: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Jitpur, NepalOnOff", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/azure-developer-%E2%80%93-remote-full-time-at-toptal-2253675587?refId=b354368a-e1b0-44df-a325-2477111df48a&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Python Developer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "Python DeveloperMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowPython DeveloperMoru Digital WalletKathmandu, Bāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to savePython DeveloperatMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletJob description:The really great things you will be doing:Building simple, efficient and reusable applications.Identify and communicate back-end best practices.Participate in the project life-cycle to develop applications using agile methodologies.Analyse and improve the performance, scalability, stability and security of the product.Improving the engineering standards, tooling and process.Collaborate and manage a team of Python developers.Collaborate with the HR team to participate in hiring Python developers.Required Candidate profileWhat we look for in you:A team player with 2+ years of working experience in developing, releasing, and maintaining large-scale software applications.Minimum 2 years of working experience in Python and Python Frameworks (preferably Django and Flask).Proven experience in effective team management.Must have Experienced in AWS web Services (like EC2, RDS, Lambda, S3, LoadBalancer, BeanStalk etc).Experience with creating RESTful endpoints using the Django REST framework.Strong understanding of OOP Concepts, Data Structure and Design Patterns.Strong understanding of Web Services, Caching, Scalability, REST/SOAP Principles.Have knowledge of the databases like MySQL, Postgresql etc.Familiarity with some ORM (Object Relational Mapper) libraries.Knowledge of CI/CD tools like (Jenkins, AWS Pipeline).Experience with tools like Celery, Nginx, Gunicorn etc.Good communication skills.Ability to work independently in a fast-paced and agile development environment.Keen to explore new technologies.What is good to have:Experience with Docker and Kubernetes.Experience with Microservice Architecture.Knowledge of TDD (Test Driven Development) in Python.Knowledge of NoSQL Databases (MongoDB, DynamoDB).Knowledge of front-end technologies (React, Angular).Comfortable with Git.Kindly share your CV on sp@moru.com.npShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsPython Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/python-developer-at-moru-digital-wallet-2211128926?refId=b354368a-e1b0-44df-a325-2477111df48a&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer - JAVA Developer", "company": "Verisk", "address": "Lalitpur, Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Software Engineer - JAVA DeveloperVeriskLalitpur, Bāgmatī, NepalApply NowSoftware Engineer - JAVA DeveloperVeriskLalitpur, Bāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who Verisk has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveSoftware Engineer - JAVA DeveloperatVerisk.Email or phonePasswordShowForgot password?Sign inReport this jobCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized byForbesas a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionResponsibilities -Design, implement and maintain JAVA applicationTake part in software and architectural development activitiesBe involved in all phases of the agile software development lifecycleEngage in technical grooming discussions where you should be able to learn as well as contributeWrite well designed, testable, efficient codeProactively seek out and minimize pain points within the infrastructure and code baseKeep up to date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesEnsure designs follow specificationsPrepare and produce releases of software componentsRecommend changes to improve established java application processesQualificationsEducation Level:Bachelor’s in Computer Science, or related field or equivalent experienceExperience Required:2 to 3 years of professional experience in Java based application developmentSkills And Knowledge -Have strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsExcellent understanding of OOP design concepts and software development processes and methodsAbility to learn new, emerging technologiesYou have a solid general understanding of application components and search engines – what happens on the front end, what happens on the back end.You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the aboveAbility to effectively work on multiple projects simultaneously and effectively contend with competing prioritiesPossess strong troubleshooting, code optimization and refactoring skillsTechnical ExpertiseStrong in JAVA programming and JAVA based technologies – JAVA 8+ features, J2EE Framework, Spring FrameworkExperience working in heavily multithreaded applicationExperience or knowledge of Search Engines like Solr, Lucene and Elastic SearchExperience in microservices architecture and RESTful API developmentKnowledge of SQL and NoSQL databases (preferably MongoDB, MSSQL and/or Postgres),Knowledge of queuing and messaging technologies like RabbitMQ, SNS and SQSProficient experience working with Maven, Jenkins, Bamboo, Octopus or any CI/CD tool and deep understanding of continuous integration/continuous delivery. Willing and able to work with DevOps team and contribute to CI/CDKnowledge of AWS services like EC2, S3, Lambda, API Gateway, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus pointAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy NoticeShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareFinancial ServicesReferrals increase your chances of interviewing at Verisk by 2xSee who you knowTurn on job alertsSoftware Engineer in Lalitpur, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-java-developer-at-verisk-2223213677?refId=b354368a-e1b0-44df-a325-2477111df48a&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "iOS Developer", "company": "Cloudyfox", "address": "Bāgmatī, Nepal", "deadline": "1 week ago", "desct": "iOS DeveloperCloudyfoxBāgmatī, NepalApply NowiOS DeveloperCloudyfoxBāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Cloudyfox has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveiOS DeveloperatCloudyfox.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from CloudyfoxSanjeev ThapaDirector Of Technology Services at Aximpro GmbHWe are looking for experienced swift developer to join our team ideally with an experience of leading a small team.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Cloudyfox by 2xSee who you knowTurn on job alertsiOS Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/ios-developer-at-cloudyfox-2204900584?refId=b354368a-e1b0-44df-a325-2477111df48a&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "iOS Developer", "company": "Jobssniper.com", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "4 weeks ago", "desct": "iOS DeveloperJobssniper.comKathmandu, Bāgmatī, NepalApply NowiOS DeveloperJobssniper.comKathmandu, Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who Jobssniper.com has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailPlease enter a valid email address.ContinueWelcome backSign in to saveiOS DeveloperatJobssniper.com.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Jobssniper.comUjjwal PoudelCo-Founder at Jobssniper.comURGENT REQUIREMENT for \"A Leading IT Company\"Position: Mid-level iOS_DeveloperNumber: 1/2Salary: NegotiableEducation: B.Sc. Computer Science & IT TechExperience: 1/2 years in relevant field.Location: Sanepa-2, Lalitpur.JD/JS:· Understand the project requirements clearly· Generate queries in case there is any confusion in understanding the project· Discuss any technical challenges that might come affront while working on the project· Realize the project delivery date and understand the communication channels· Write iOS codes to develop a quality product on time· Conduct first hand testing of the project tasks before submitting the task to the Project Manager· Verify the product with SRS· Experience working with automated testing on the iOS platformFor more details:Jobs Sniper (P) Ltd.Baneshwor-10, Kathmandu, Nepal.Contact No.: 9864689377Email: hr@jobssniper.comShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Jobssniper.com by 2xSee who you knowTurn on job alertsiOS Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/ios-developer-at-jobssniper-com-2189038850?refId=b354368a-e1b0-44df-a325-2477111df48a&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}]