[{"name": "Full Stack Engineer", "company": "Softyca Inc.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "4 days ago", "desct": "Full Stack EngineerSoftyca Inc.Kathmandu, Bāgmatī, NepalApply NowFull Stack EngineerSoftyca Inc.Kathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Softyca Inc. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveFull Stack EngineeratSoftyca Inc..Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Softyca Inc.Vijay NeupaneVisit softyca.orgEducation: Bachelor's degree in Computer Science or relevant field/ Masters' Degree preferredExperience: 6+ years (graduate before 2014 proffered)Type: Full TimeSalary: No bar for the deserving candidateWe are looking for a highly skilled Full Stack developer who is comfortable in developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside graphic designers for web design features, among other duties.Full Stack Developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.Full Stack Developer Requirements:.Strong organizational and project management skills.Proficiency with fundamental front end languages such as HTML, CSS and JavaScript.Familiarity with JavaScript frameworks such as Angular JS, React and Amber.Proficiency with server-side languages such as Python, Ruby, Java, PHP and .Net.Familiarity with database technology such as MySQL, Oracle and MongoDB.Excellent verbal communication skills.Good problem-solving skills.Attention to detail.Full Stack Developer Responsibilities:Developing front end website architecture.Designing user interactions on web pages.Developing back end website applications.Creating servers and databases for functionality.Ensuring cross-platform optimization for mobile phones.Ensuring responsiveness of applications.Working alongside graphic designers for web design features.Seeing through a project from conception to finished product.Designing and developing APIs.Meeting both technical and consumer needs.Staying abreast of developments in web applications and programming languages.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Softyca Inc. by 2xSee who you knowTurn on job alertsFull Stack Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-engineer-at-softyca-inc-2308779715?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Software EngineerMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowSoftware EngineerMoru Digital WalletKathmandu, Bāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware EngineeratMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletJob DescriptionWe are looking for Technical ninja who wants to help us Design/Develop/Deploy cutting edge scalable products to meet our business requirements. We are building out a team and looking for multiple levels but you should have at least 3 years of programming experience.We need a Full stack developer role to lead, manage a team of App & Web. UX/ UI design understanding. Development with Flutter, React JS, React Native, Node, Python, Java etc. API plugging’s workflow, concurrency, multithreading. Server integration- Exp in Product management. Cross-functional knowledge in development, testing deployment, maintenance. Team Management, hiring, guiding, training. Lead R&D. Strong in Flutter, Python development environment.Job Specifications1. Salary: Negotiable *2. Roles and Responsibilities• Experience in developing functional code for front-end and back-end• Designing and developing and Integrating API’s using server-side programming languages such as Node, Python, Java• Experience in front-end JavaScript frameworks such Angular, React, Vue JS, React Native, Native Script, Flutter• Effective programming skills in TypeScript• Working experience with databases such as MongoDB, SQL, and Oracle.• Knowledge of UI rendering programming languages such as HTML, CSS, JQuery• Excellent at QA Testing Procedures and Cloud (AWS and Azure)• Should be an active contributor to developer communities like Stack overflow, Top coder, GitHub, Google Developer Groups (GDGs).• Customer-focused, react well to changes, work with teams and able to multi-task.• Excellent data structure & algorithm and problem-solving skills.• Working knowledge with JavaScript frameworks and libraries• Build features and applications with mobile responsive design• Develop and design documents based on functional specifications• Good communication and teamwork skills• Develop medium to large scale applications using required technology, Database design and analysis.• Stay abreast of changes in technology and learn new technologies as needed.• Develop complex software components.• Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.• Protect operations by keeping information confidential.• Accomplish engineering and organization mission by completing related results as needed.• Mentor junior-level developers.• Collaborate with the team to brainstorm and create new products.• Grow engineering teams by interviewing, recruiting and hiring.• Understand business needs and know how to create the tools to manage them.• Comply with the project plan and stay on the leading edge of development practices.• Advise team on software development and code creation.• Demonstrate strong knowledge proficiency in the development methodologies including Object-Oriented Development, Component-based Development, Test-Driven Development, Behavior-Driven Development, Design Patterns and Design for Reuse.• Work closely with stakeholders to obtain requirements, break them down to tasks, and manage a team of several developers.• Perform unit testing and integration testing of Apps and web applications with the test automation tools. Analyze and resolve performance issues in them.• Should be capable of Handling a product from planning phase to getting the product/project running which include, Product planning, Task bi-furcation, assigning tasks to the team and self-involvement, Setting the deadlines and working on the deadlines, Requirements Testing, Deployment, Maintenance, Security testing, etc.• Must be a proven performer and team player that enjoy challenging assignments in a high- energy, fast-growing and start-up workplace.• Must be a self- starter who can work well with minimal guidance and in fluid environment.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-at-moru-digital-wallet-2211134309?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Front End Web Developer", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "4 weeks ago", "desct": "Front End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, NepalApply NowFront End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveFront End Web DeveloperatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionCloudFactory’s mission is to help visionary companies power disruptive technology while connecting 1 million people in the developing world to meaningful work. We are looking for ambitious people who seek greater meaning in their work and want to use their talents to make the world a better place.For companies from startup to enterprise, CloudFactory provides a tech-forward, professionally managed workforce solution for routine data work. Our teams are agile, scale fast, and help innovators get their technology to market fast. Trusted by 100+ companies, CloudFactory processes millions of tasks every week for companies including Microsoft, Drive.ai, Expensify, Ibotta, and GM-Cruise Automation.At CloudFactory, we believe that talent is equally distributed, but opportunity is not. Founded in Nepal in 2008, we connect people to digital work and give them the skills to be leaders in their own communities. We’re on a mission to create economic and leadership opportunities for talented people in developing nations. As an impact sourcing service provider (ISSP) and recipient of a program related investment from The Rockefeller Foundation, we are a global leader in the impact sourcing movement.With $13 million in venture capital raised and 100%+ growth year over year, we are expanding our business quickly and sustainably. Our headquarters is in Reading, U.K., and we have offices in Kathmandu, Nepal; Nairobi, Kenya; and Durham, N.C.Join us and make a difference in the world!ResponsibilitiesUsing HubSpot’s CMS, work with the CloudFactory marketing team to maintain and build upon CloudFactory’s website, microsites, and other digital assetsProvide technical assistance in maintaining CloudFactory’s digital assets in an agile environmentOptimize our website and landing pages for speed and related search engine indexing and performance metrics (SEO)Analyse marketing data, understand user behavior and experience, and systematically map out UI/UX improvement suggestionsProvide technical assistance as the team launches and iterates on various marketing campaignsRequirements1+ year of experience in web developmentFluency in HTML and CSS. Ability to handcraft web pages and formsKnowledge of JavaScript (and jQuery) for client-side scriptingAbility to add interactive behaviors in web pagesAble to work with JSON data using JavaScriptProficient understanding of responsive design and cross-browser (Google Chrome, Firefox, & IE) compatibilityUnderstanding of web design and development best practicesExcellent analytical, problem-solving, and communication skillsInsatiable curiosity about the latest and greatest tools, hacks, and optimization strategiesExcellent written communication skills (English) with keen attention to detailHelpful SkillsFamiliar with Photoshop or other graphic design tools such as Canva are desirableKnowledge of Google analytics, SEO, Google Search Console, and Inbound Marketing are big plusesExperience using Hotjar or similar apps is a big plusExperience in B2B — high-tech products and services preferredThese HubSpot certifications (in this priority order) are a plus:Growth Driven DesignDesignMarketing SoftwareSEOInboundBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsFrontend Web Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/front-end-web-developer-at-cloudfactory-2285206476?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer - Java Developer", "company": "Verisk", "address": "Lalitpur, Bāgmatī, Nepal", "deadline": "1 month ago", "desct": "Software Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, NepalApply on company websiteSoftware Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, Nepal1 month agoBe among the first 25 applicantsSee who Verisk has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - Java DeveloperatVerisk.Email or phonePasswordShowForgot password?Sign inReport this jobCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized byForbesas a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionDesign, implement and maintain java applicationTo take part in software and architectural development activitiesWrite well designed, testable, efficient codeEnsure designs follow specificationsPrepare and produce releases of software componentsRecommend changes to improve established java application processesQualificationsBS degree in Computer Science, Engineering or a related subject2 to 3 years of professional experience in Java based application developmentSkills And KnowledgeMust have passion for development and ability to learn latest technologiesExcellent understanding of object-oriented design concepts and software development processes and methods.Expertise in application, data and infrastructure architecture disciplinesGood knowledge of architecture, design and business processesDemonstrated ability to work independently with minimal supervision.Possess strong troubleshooting, code optimization and refactoring skills.Technical ExperienceMandatory skills – the person must be STRONG in each discipline and will have to explain in detailJava, J2EE Framework, RESTful web services pattern, Spring Framework, JavaScript frameworks (JQuery, AngularJS, and EmberJS), SQL and NoSQL databases (preferably MongoDB, MSSQL and/or Postgres), RabbitMQ/SQS, Solr/Lucene/Elastic Search, Tomcat, SVN, GIT, Test-Driven DevelopmentExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Experience in cloud and serverless technology (preferably AWS) would be a major plus pointProficient experience working with Maven, Jenkins, Chef, CodeDeploy, Bamboo, Octopus or any CI/CD tools and understand of continuous integration/continuous delivery. Willing and able to work with DevOps team and contribute to CI/CDExperience working in an Agile development processKnowledge of AWS LAMBDA and monitoring tools such as Solar winds and New Relic would be a plusAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy NoticeShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareFinancial ServicesReferrals increase your chances of interviewing at Verisk by 2xSee who you knowTurn on job alertsSoftware Engineer in Lalitpur, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-java-developer-at-verisk-2277306957?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "PHP/Python Software Engineer", "company": "Outcode Software", "address": "Bāgmatī, Nepal", "deadline": "7 days ago", "desct": "PHP/Python Software EngineerOutcode SoftwareBāgmatī, NepalApply NowPHP/Python Software EngineerOutcode SoftwareBāgmatī, Nepal7 days agoBe among the first 25 applicantsSee who Outcode Software has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePHP/Python Software EngineeratOutcode Software.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Outcode SoftwareEmmanuel Martinez 웃TechAbout OutcodeOutcode is a global software development firm that delivers technology solutions that improve business-facing quality of life by increasing ROI, effectiveness, & efficiency.Our DNA is made of ex-startup founders and the top talent in Product, UX/UI, Software development, and Machine Deep Learning. We came together from various backgrounds with one vision: to bring a lean, user-centric approach to product innovation and software development by completely understanding the business needs before building anything.Responsibilities• Learns quickly and able to grasp complicated topics• Knows about and is comfortable with modern, progressive architectures, platforms, and languages.• Significant development experience with PHP.• Experience with SQL. You've designed database schemas with an emphasis on scalability and performance.• Working knowledge of Git. You've collaborated with other developers.• Experience using Linux systems. You're comfortable using the command line.• Knowledge of other languages a strong plus.• This is a more backend focused role but frontend experience is helpfulQualifications• Excellent background with professional appearance and communication skills required.• Ability to work effectively with others in a team environment and/or independently with minimal supervision, guidance, and taking ownership of a task.• Strong organizational and time management skills.• Enjoys building and improving software and receives satisfaction knowing users are happy.• Possesses a drive to constantly improve upon your own work.• Commonly thinks \"How do I make this work more efficient and better?\"• Prior experience working remotely full-time.Specific Technical Stack Experience:• PHP 3+ years of experience• Python 3+ years of experience• RDBMS, MySQL, working with large databases• Javascript (Bonus)• Docker (Bonus)• Git experience• Agile and SCRUM Methodology understandingBenefitsCompetitive payFully remote company cultureOpportunity to work on cool projects with amazing people!Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Outcode Software by 2xSee who you knowTurn on job alertsSoftware Engineer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/php-python-software-engineer-at-outcode-software-2264275201?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Database Administrator/Developer", "company": "Omnicom Media Group", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "5 days ago", "desct": "Database Administrator/DeveloperOmnicom Media GroupKathmandu, Bāgmatī, NepalApply NowDatabase Administrator/DeveloperOmnicom Media GroupKathmandu, Bāgmatī, Nepal5 days agoBe among the first 25 applicantsSee who Omnicom Media Group has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveDatabase Administrator/DeveloperatOmnicom Media Group.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Omnicom Media GroupKalpana ThamsuhangHuman Resources at Omnicom Media Group NepalRole OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages.Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with.Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link athttps://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionMarketingInformation TechnologyOtherIndustriesMarketing and AdvertisingReferrals increase your chances of interviewing at Omnicom Media Group by 2xSee who you knowTurn on job alertsDatabase Administrator in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2277133377?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Senior Java Developer", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Senior Java DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior Java DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Java DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.POSITION: SENIOR JAVA DEVELOPERExperience developing enterprise applications with proven enterprise experience level with RDBMS and SQL (Oracle and/or Microsoft SQL Server)Experience with Continuous Integration and writing automated unit and integration testsStrong object-oriented programming skills using JavaKnowledge of relevant technologies inclusive of (Angular 5, JavaScript, JOuery)Knowledge of algorithms and data structuresFamiliar with design patternsKnowledge of secure coding practices as it pertains to OWASPKnowledge of Version Control Software tools such as SVN, bitbucketExperience with Software development/management tools using the Atlassian suite (JIRA, Confluence)Experience with both Windows and Unix Operating systemQUALIFICATIONS AND EDUCATION REQUIREMENTSBS Computer Science or related field or equivalent industry experienceAt least 5 years of experience in Software developmentSOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valueDesire and ability to continuously improve, discover and expand the limitsCritical thinking has an opinion on various technological topics.Show moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSenior Java Software Engineer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-java-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220506871?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "React Developer (Remote)", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "6 hours ago", "desct": "React Developer (Remote)ToptalKathmandu, Bāgmatī, NepalApply on company websiteReact Developer (Remote)ToptalKathmandu, Bāgmatī, Nepal6 hours agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveReact Developer (Remote)atToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAre you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you'll find remote freelance opportunities with leading global companies, on your terms.Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world's leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won't have to bid against other freelancers and can maintain a steady stream of work. It's the type of work/life balance that empowers you to travel the world, or stay at home. You're in control of shaping your environment to however you work best while establishing yourself as an elite developer.To learn more from Toptalers that made it big through freelancing, check out the following article: https://topt.al/V6cyVZReact Developers In Our Elite Network Share3+ years of professional experienceExperience with React is requiredProject management skillsA keen attention to detailFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/react-developer-remote-at-toptal-2313120116?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Javascript Developer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Javascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowJavascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJavascript DeveloperatMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletHiring For React Native DeveloperJob description:Develop React Native applications for both iOS and AndroidBuild reusable components and front-end libraries for future useLeverage native APIs for deep integrations with both platforms.Create UI Screen and Modules in both iOS and Android and integrate with React Native applicationDiagnose and fix bugs and performance bottlenecks for performance that feels native.Create software code, unit tests and assist with encoding, testing, debugging, and documentation.Review requirements, wireframes, and designs for technical feasibility, work with the scrum team to translate these into user stories that can be implementedImprove product quality through code reviews, writing effective unit tests, and collaborating with QA to implement automation testing where appropriateWork closely with Backend team for the product’s admin setup.Required Candidate profileMinimum 2 year relevant and real time experience in ReactNative.Strong JavaScript fundamentals and ES6 knowledge, ReactNative / NodeJS, MVC, Design Patterns, REST APIs, Swagger, AWS and GAEFamiliarity with state/data management libraries (Redux, Mobx) is a plus.Strong debugging skills with the ability to reach out and work with peers to solve complex problemsFamiliarity with code versioning tools such as GitKnowledge of general mobile landscape, architectures, trends, and emerging technologies.Experience in automated testing suites, like Jest/ Mocha/ Express is a plus.Experience with Agile Development mythology.Candidate should have strong communication skills, should be able to work independently & provide guidance to junior/other team membersAmbitious, willing to work hard and invest in building a great career.Candidate who care more about what they learn and the impact they make.Take ownership of all tasks.Believe in work-life integration. passion > work-life balance.Must have experience into Android/ IOS DevelopmentMust have experience in Hybrid apps DevelopmentWilling to work with cross-platform frameworksExperience with consuming REST API’sKindly share your CV on sp@moru.com.npShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/javascript-developer-at-moru-digital-wallet-2211129923?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer - Javascript", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2 weeks ago", "desct": "Software Engineer - JavascriptCloudFactory.Kathmandu, Bāgmatī, NepalApply on company websiteSoftware Engineer - JavascriptCloudFactory.Kathmandu, Bāgmatī, Nepal2 weeks ago38 applicantsSee who CloudFactory. has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - JavascriptatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionWe are looking for a Full-Stack Javascript Developer for our Platform team. The person we are looking for lives and breathes front end engineering. On our team, you will be designing, developing, and supporting the core functionality that drives our technology and services using the latest technology available.Our codebase includes Go and Ruby as a backend, Javascript and TypeScript for the frontend languages. We use ReactJS to build user interfaces.Key ResponsibilitiesDevelopment, and testing of features/functions for the product team to support business needs.Working with product team using agile methodologies to deliver high quality solutions on timeCollaborate with other engineers, and architects to build a CloudFactory platformHelp development teams build features faster by researching, evaluating and integrating emerging technologies into the platformDesign and build maintainable, extensible, and performant modules and shared components in React/JSX that that will be used or extended by other teamsAble to work effectively with a remote teamRequirementsBe proactive and anticipate/handle most issues before they go off.Demonstrate a high level of curiosity and keep abreast of the latest technologies.Show ownership and strive for excellence in everything you do.Experience with application/service development using Node.js and HTML/CSS/JavaScript required.Work experience of UI framework ReactJS and stay up on latest versionExperience in building, unit testing, documenting and refactoring JavaScript code.Experience in testing strategies, cross-browser compatibility & client-side performance optimization.3+ years work experienceBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-javascript-at-cloudfactory-2266777125?refId=a9042b7b-4de2-4082-9680-063ac78c79cd&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}]