[
    {
        "name": "Software Engineer - .NET /C#",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionVerisk IoT/Telematics, a unit of Verisk Analytics (VRSK), provides a start-up like excitement with the stability of a thriving public company. Verisk’s signature automotive telematics effort is the Verisk Data Exchange, which collects IoT telematics data from connected vehicles and provides advanced analytical solutions to its customers.Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers. You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.What You Get To Do Every DayDesign and develop high-performance software libraries and APIsImplement highly scalable, performant, fault-tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownershipBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsExperience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Knowledge of cloud-based applications would be a plusExperience working with large-scale production systems and/or data platformsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal) QualificationsSkills And QualificationsYou must have demonstrated experience in several of these domains and technologies:BS/MS degree in Computer Science, Engineering or a related subjectAt least 3years full-time work experience with good knowledge of AWS environmentStrong ability to build RESTful services in C# with .NET/.NET CoreProficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNKnowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus point Preferably certified in AWS skillsAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-net-c%23-at-verisk-2197785985?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Full Stack Engineer",
        "company": "Softyca Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQG82K-VofY3Kw/company-logo_100_100/0?e=1611187200&v=beta&t=s5_ruKT-lXBE3XNI61kxVnCy8X0WHD045HNS04MKxLw",
        "address": "Nepal",
        "desc": "Responsibilities:Identify innovative technology and methodology to optimize productivityEnsure safe delivery and execution of applicationsDevelop web applications utilizing modern programming languages (JavaScript, Java, Python, C#, C++, etc.)Collaborate with other professionals to understand complex ideas and drive featuresWork with remote development teams to create featuresOptimize qualities through refactoring, peer code review, and automationRequirements: Bachelor’s degree & equivalent work experience in computer science, engineering, or related field3+ years of experience in web application development3+ years of experience developing large traffic software designFamiliarity with JavaScript and JVM languagesExpertise in web development, cookies, cache, CORS, etc.Understanding of server API development",
        "level": "Not Applicable",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-engineer-at-softyca-inc-2176411324?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Database Administrator/Developer",
        "company": "Omnicom Media Group",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFOs9cg5FKb6Q/company-logo_100_100/0?e=1611187200&v=beta&t=Y27kiHUQF1Zh4ize-TtvUeEoL58aylt0NIyLOhmYj14",
        "address": "Bāgmatī, Nepal",
        "desc": "Role OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages. Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with. Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link at https://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2170970181?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "JUNIOR TRADER / ANALYST - Dubai, UAE",
        "company": "Cobblestone Energy",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQFxIuANc6IrXw/company-logo_100_100/0?e=1611187200&v=beta&t=5iSWC9iX91GVgukI8oavlf378NyG354KfzztbGOFrmw",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Junior Trader / Analyst - Commercial Development Programme - Dubai, UAE Starting Remuneration of 30,000 USD per annum, 0% Tax environment.Fast progression for strong performers.Are you bright, highly motivated and commercial-minded with a growth mindset?Company DescriptionEnergy in one form or another is fundamental to almost all of the world's economic activities. By understanding the demand, supply, and logistics of these commodities, we can better understand the world. We specialise in the proprietary trading of the short-term wholesale electricity markets across Europe. We make use of advanced data analytics and extensive research to drive profitable decision making, trading enough electricity every day to power a small country. Technology and risk management form the backbone of our businessCommercial Development ProgrammeThe Cobblestone Commercial Development Programme is your passport to an exciting and challenging career in the world's commodities markets. It is a 12-month programme designed to give you exposure across trading and analytics to help you develop the tools you need to be a highly effective team member. We are searching for exceptional graduates who thrive on intellectual challenges and can provide creative solutions to complex problems. This is a role for highly analytical and sharp individuals with strong numerical ability. One must be able to learn and think quickly. Opportunity is unlimited for exceptional talent.We are offering graduate vacancies in our Dubai office starting throughout 2020.Tasks/responsibilities:  Support the commercial decisions of the traders through the provision of timely analysis and market monitoring. Perform research into various aspects of the European Energy markets Analyse business requirements (tools and systems) and provide ideas to solutions that add value to the bottom line. What we look for:  Very strong numerical, logical reasoning and analytical skills. A in A level Mathematics. Must have studied Mathematics at A level. * Strong commercial acumen Resilience and a determination to succeed Independent thinkers with growth mindset Programming (e.g. Python, Java, C++) skills are desirable but not mandatory. Must be self-motivated and able to learn quickly. Our hiring processes After your application been added to our pipeline and evaluated, you will be invited to do an online psychometric assessment that will evaluate your numerical ability.Upon successful completion of these, you will be invited for a series of interviews with members of both our HR and commercial team.Before full time admission onto our Commercial Development Programme (CDP), all finalist candidates are invited to attend a two-week Cobblestone Training Programme (CTP). CTPs are carried out at either our main Dubai office or our partner location in Kampala. This is determined by our admin depending on where you are located.We shall cater for everything - Flights, accommodation, paper-work and expenses.During the Training Program, you work will on real-life tasks and situations with other members of the commercial and technical team. The goal is to enable you to learn as much as possible within the period while giving you the opportunity to shine in an area tailored to your strengths. You are also evaluated for cultural fit, aptitude, and your ability to work with others.Following this, you will then be offered a full-time role on the CDP.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/junior-trader-analyst-dubai-uae-at-cobblestone-energy-2195569448?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Director, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director. The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position DescriptionThe Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration. The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects. This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region. This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups. The Technical Director will support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life. She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work. The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team. Availability of position is contingent upon award to FHI 360.Key ResponsibilitiesAssist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualificationsAt least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-director-csm-nepal-at-fhi-360-2179949269?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Service Technician",
        "company": "Tetra Pak",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHIEmKGTdVrug/company-logo_100_100/0?e=1611187200&v=beta&t=0FFa4NhmHrsdzYG6UngV5X0AQbDKqraN2Grxb5wCE8c",
        "address": "Birganj, Nārāyanī, Nepal",
        "desc": "At Tetra Pak we touch millions of lives every day, ensuring better nutrition and healthier lifestyles through safe packaging and food processing solutions. Guided by our global brand promise, PROTECTS WHAT´S GOOD, we strive to make a difference by protecting food, people and our futures. To do this we need more than smart technology. We need smart people too. People like you, who wants to work with people like us.Regional System Support Specialist Are you ready to take on a challenging role as Technician within APAC Services of Tetra Pak?As Technician, you will be responsible for taking care of maintenance and troubleshooting activities for our Nepal territory customers i.e. Dabur Nepal & other customers in Nepal. This position will be based in Birgunj, Nepal and will require extensive travel.What you will doParticipate in preparing customer site for installation events, assembling machines.Participate in execution of preventive maintenance activities.Inform relevant Tetra Pak staff in a timely manner about discovered Technical Issues.Participate in the installation of relevant rebuilding/upgrade kits.Inform relevant Tetra Pak Field Staff about ongoing service activities as well as of any issues affecting the customer or the quality of Tetra Pak service.Act as an ambassador for Tetra Pak at all times, ensuring good working relationships with the customer and Tetra Pak colleagues and that Tetra Pak’s reputation is sustained.Execute all work in accordance with Tetra Pak and Customer safety regulations and requirements. Execute all work in accordance with Tetra Pak standards and requirements regarding product quality and food safety. Escalate all discovered food safety, quality assurance and regulatory issues.Comply with all reporting requirements.Who you areWe are looking for you, a curious, committed, and highly motivated colleague wanting to expertly learn and work with Tetra Pak. We believe you have minimum 2 years hands on experience in equipment maintenance, servicing or installation and commissioning in any food/packaging, processing, or automation industry. Knowledge of PLC programming and troubleshooting will be an advantage. You have a full time Diploma/Bachelor’s degree in mechanical/electrical engineering with excellent verbal and written communication skills in English.We offerAs our new Technician, you will be part of a global leading company where our vision is to make food safe and available everywhere. We can offer you highly skilled and passionate colleagues and an international challenging and high paced work environment where our employees take great pride in protecting food and protecting the planet.Apply Now!If you are inspired to contribute to the APAC Services of Tetra Pak, feel free to apply through this post.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/service-technician-at-tetra-pak-2184301010?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Chief of Party",
        "company": "",
        "logo": "",
        "address": "Nepal, Gandakī, Nepal",
        "desc": "At the heart of Pact is the promise of a better tomorrow. A nonprofit international development organization founded in 1971, Pact works on the ground in nearly 40 countries to improve the lives of those who are challenged by poverty and marginalization. We serve these communities because we envision a world where everyone owns their future. To do this, we build systemic solutions in partnership with local organizations, businesses, and governments that create sustainable and resilient communities where those we serve are heard, capable, and vibrant. Pact is a recognized global leader in international development. Our staff have a range of expertise in areas including public health, capacity development, governance and civil society, natural resource management, poverty, fragile states, monitoring and evaluation, small-scale and artisanal mining, microfinance and more. This expertise is combined in Pact’s unique integrated approach, which focuses on systemic changes needed to improve people’s lives.DepartmentProgram Delivery (PDEL) - Pact exists to help create a world where those who are poor and marginalized exercise their voice, build their own solutions, and take ownership of their future. The Program Delivery Team, contributes to realizing this purpose by: Forging smart partnerships and treating all people with dignity and respect; Applying organizational policies and regulatory compliance appropriately and consistently; Facilitating team spirit among colleagues and promoting the organization through communications; Influencing decision makers through focused, relevant communications; Continually striving to learn and share knowledge and find small ways to make the workplace more enjoyable for all; Cultivating and harvesting innovation; Contributing to the organization’s ability to think and act strategically at all times; Inspiring and spreading our desired organizational culture across the global enterprise.Position OverviewPact is recruiting for a Chief of Party (COP) for an upcoming project based in Nepal. The COP will be responsible for technical leadership and the overall management and operations of the USAID Civil Society and Media (CSM) Activity. She/he will supervise high-quality project implementation, with a focus on achieving the project goals and USAID/Nepal development objectives. The COP will take a leadership role in coordination of all activities across all relevant parties including: USAID, the Government of Nepal (GoN), key stakeholders, and implementing partners. She/he will also oversee all project staff and sub-partners for results-oriented planning, leadership, and coordination of project activities. This position is contingent upon award.Key Responsibilities Ensure high-quality, results-oriented technical programming through hands-on guidance and support grounded in the project’s strategic objectives and approved annual workplans. Serve as key representative to USAID, responsible for all communications with USAID officials. Act as liaison to and ensure effective relationships with the GoN, national policy actors, project sub-partners, other relevant donors and key stakeholders. Ensure a highly adaptive, systems-driven approach to promoting innovative and sustainable approaches to strengthening civil society and media, and promoting civic engagement. Ensure the provision of training and mentoring to partners to strengthen the capacity of civil society and media partners, and ensure their compliance with donor rules and regulations. Develop and implement a strategy for supporting local and national civil society partners to positively influence democratic and reforms at the local, provincial, and national levels. Develop and implement innovative approaches to promoting collaboration and engagement across the civil society, media, and private sectors. Lead all project planning responsibilities, including the production of annual workplans and budgets and performance monitoring plans, ensuring alignment of the budget to expected results and cost-effective use of resources. Review and approve annual budgets and progress reports, ensuring they are completed and submitted in a timely manner. Ensure compliance with USAID and Pact requirements, policies, and regulations. Oversee all local grantmaking mechanisms, ensuring compliance with USAID regulations and Pact policies; coordinate and/or conduct monitoring visits to grantee programs. Oversee integration of gender and social inclusion (GESI) considerations across all aspects of program planning, implementation, monitoring and evaluation, and learning and management. Recruit and directly supervise local and international project staff in line with Pact policies; oversee the management and development of project office human resources to ensure a diverse, skilled, and productive workforce, an effective leadership team, and an organizational culture where Pact’s values are practiced. Basic Requirements Master's or bachelor's degree in a relevant field such as social sciences, law, or development studies. A minimum of ten (10) years’ experience in the implementation of international development programs, with preference given to democracy and governance activities, human rights. A minimum of five (5) years’ experience in senior management positions, including direct supervision of professional and support staff. In-depth understanding of the role of civil society and media in development Experience building capacity for civil society organizations and networks/coalition strengthening in Nepal. Experience implementing complex and politically sensitive international development programs. Experience with GESI mainstreaming approaches. Expertise in advocacy, accountability, research, media campaigns. Experience establishing and maintaining productive working relationships with a wide network of partners and stakeholders, including international organizations, NGO partners, government institutions, private sector entities, and donor community. Demonstrated knowledge of and experience with working with USAID. Excellent interpersonal, writing, and oral presentation skills in English. Preferred Qualifications Experience managing highly adaptive programs, as well as applying systems-driven approaches and/or thinking and working politically principles. Fluency in Nepali. Experience managing USAID contracts. Nepali nationals are encouraged to apply. Pact is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity or expression, marital status, disability, genetic information, age, citizenship status, genetic information, matriculation, family responsibilities, personal appearance, credit information, tobacco use (except in the workplace), membership in an employee organization, or other protected classifications or non-merit factors.Please click  here  to apply for this position.",
        "level": "Executive",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/chief-of-party-at-pact-world-2165704872?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "PHP Developer",
        "company": "KodeStage Technology Pvt.Ltd",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQH2k_n7T_ZuRQ/company-logo_100_100/0?e=1611187200&v=beta&t=IDuCqn09J-uvzrup74uakuG-Kbvq1Q4-E4Gle2GCR7o",
        "address": "Koteshwar, Bāgmatī, Nepal",
        "desc": "Vacancy Announcement for Laravel DeveloperWe are looking for enthusiastic personnel for the following positions.To apply to send your resume atkodestage@gmail.comBackend Developer - Mid Level Laravel DeveloperNumber of Candidates: 2Experience: 2 yearsQualification- Basic knowledge of Vue js, PHP, JS, HTML, and CSS.- Must have knowledge of CRUD operation in PHP or Laravel.- Basic knowledge of database programming in MySQL.- Experience with CMS like WordPress, Drupal is a plus.- Good at participating with team members in a project and have good communication skills.For more details please follow,KodeStage Technology Pvt LtdBalaju, Near Ganga hall Kathmandu,Gmail: kodestage@gmail.comTel: 9845417277, 9840186294",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/php-developer-at-kodestage-technology-pvt-ltd-2165575761?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Software Engineer (Remote) - $60,000/year USD",
        "company": "Crossover for Work",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_m_twEzTeDA/company-logo_100_100/0?e=1611187200&v=beta&t=Eh2ZRxPY1M79443NwUJglVoPYkwaS6qcZZVOUbxi6Xw",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Do you ever feel like you're the only person on your team that has high standards for code quality? Do you get frustrated when remedial code gets committed to your codebases? Do you long for awesome specs, so you can just focus on writing code?If you are the best software developer on your team, this is the place to fast-track your career in software architecture and engineering. You will contribute to products across multiple domains, unlike the typical role where you are sticky-assigned to a single product or feature.You will learn about dozens of products and cloud technologies, refining and applying your skills on a daily basis, and building on top of the full suite of AWS services. We engineer our products to the highest quality standards, including 100% unit test coverage.Joining us is a great career move! You'll receive weekly feedback on your work and always know what it takes to get to the next level.What You Will Be DoingWriting code! From scratch. New features, new APIs, and 16X performance enhancements - you’ll get a spec and start coding. We expect code that is great, no debate - any decent architect in the world should agree that your code is great.What You Won’t Be DoingFixing other peoples’ code. You won’t debug for a living. Sure, we expect you to test and debug your own code, but you won’t be working through an endless queue of bad code from other developers.Senior Software Engineer Key ResponsibilitiesYou will focus on three major areas: feature development, API development, and performance improvements. You’ll implement specs from all three areas, and across a hundred products in our portfolio. This job is never dull, because you’re always learning new technologies and new products.Basic RequirementsExpert coder in Java, JavaScript, C++ or C#Full stack developer, including mastery of SQL and modern front end technologiesStrong Software Architecture Expertise - you are a systems thinker who understands how each feature fits into the overall design. You can make architectural decisions and document the rationaleQuick Learner. Pick up new products, technologies, and programming languages every weekHands-on experience using mocking frameworks to create unit tests with 100% code coverageAbility to work with a structured and disciplined approach - we aim for the highest quality the first time and every time, no “hacking” Nice-to-have RequirementsA university degree (BS, MS, or PhD) that included in-depth study of data structures, algorithms, object-oriented programming, computer architecture, and software engineeringExperience with cloud, docker and K8s environmentsTrack record of delivering high-quality software based on written specsAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go to www.crossover.com/testimonials to read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important! If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply. Crossover Job Code: LJ-3889-NP-Kathmand-SeniorSoftware.010",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-remote-%2460-000-year-usd-at-crossover-for-work-2207818135?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Python Developer",
        "company": "Kathmandu Jobs",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQEZPXnz5NxOIg/company-logo_100_100/0?e=1611187200&v=beta&t=9QdKXMHWvLijzv-2qp0VOKWg9OWzGvg9KgSfore4XTQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "We are seeking an enthusiastic and experienced Senior Python Engineer. Hands-on experience developing Cloud services in Python, GoLang, Object-oriented programming.- Strong expertise in Django, DevOps.- Familiarity with front-end technologies (like React, JavaScript, and HTML5)- Experience with AWS products such as API gateway, Lambda is plus.- Experience with a relational database such as Postgres (preferred) or MySQL.- Provide ongoing maintenance, support, and enhancements in existing systems and platforms.- Test software development methodology in an agile environment.- Experience with building APIs and services using REST, SOAP, GraphQL, etc.- Collaborate cross-functionally with business users, project managers, and other engineers to achieve elegant solutions.- Excellent logical and problem-solving skills, technical leadershipExperience: 4+ years Experience in Particular DomainAcademic Requirement: Graduates in a particular domain, PG is preferred",
        "level": "Not Applicable",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-python-developer-at-kathmandu-jobs-2006076122?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Finance and Administration Director- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks a Finance and Administration Director for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The Finance and Administration Director will manage the financial operations and reporting of the contract, will oversee and execute sub-contracts with local organizations, and will provide direct administrative functions of the project. This position will be full-time and based in Nepal.Responsibilities Responsible for the financial management, accounting, and financial reporting of the project;  Establish and oversee internal control systems as well as accounting and financial reporting protocols;  Support the COP and DCOP in liaising with home office (US-based) staff on project matters;  Draft, execute, and ensure compliance on sub-contracts developed with local partners in Nepal;  Oversee payroll procedures for national staff, administer payroll, and monitor employee time keeping;  Work with home office staff to develop and implement office administrative and personnel systems;  Supervise finance, HR, and administrative for the project;  Maintain financial files and support annual audits; and  Perform other duties as assigned. Qualifications Bachelor’s Degree (minimum), or a Master’s Degree (desirable), in Finance, accounting, economics, or relevant field.  At least 8 years of professional experience managing project operations, financial and contractual aspects of international development projects. Experience on USAID-funded projects required.  Strong analytical and computer skills, including significant experience with excel and accounting packages.  Experience creating Financial reports  Proven leadership, management, communication and interpersonal skills.  Experience working in Nepal or in the region is highly preferred.  English language fluency required, with excellent written and oral communications skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/finance-and-administration-director-nepal-at-social-solutions-international-inc-1995105325?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer Trainee - .Net",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: .NET TraineeRequirementsGood knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Problem solving skillsGood knowledge curve - Ability to learn quickly and implement Good attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skills QualificationsBachelors in Computer Science / Information Technology or equivalent.Up to 1 year of working experience in development are also encouraged to applyAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-trainee-net-at-verisk-2202378161?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Project Director/Chief of Party, Adolescent Reproductive Health/Family Planning - Nepal",
        "company": "Save the Children US",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQEuQWgonHRtrg/company-logo_100_100/0?e=1611187200&v=beta&t=YpK4VJ3nzO03WtOOP8ve2WFRQ4P2Yl9TH8AJbzJu2LE",
        "address": "National, WV",
        "desc": "SummarySave the Children is seeking a Project Director/Chief of Party (COP) for an anticipated USAID-funded Adolescent Reproductive Health/Family Planning (RH/FP) program in Nepal. The COP will oversee project design and implementation and provide technical expertise and quality assurance for project activities. This person will be SC’s primary point of contact with all relevant stakeholders, including USAID, Ministry of Health, and other international and local partners. The COP will lead a team of experts implementing project activities; prepare reports, annual operating plans, and project deliverables; and ensure the program is compliant with USAID and Save the Children’s regulations. As the project is expected to align with the objectives of the Government of Nepal, the COP will also ensure all activities support in-country priorities, complement existing initiatives, and include plans for sustainability.This position is contingent upon donor approval and funding.What You'll Be Doing (Essential Duties) Lead the development of all project deliverables (e.g., strategic plans, annual and quarterly work plans, detailed budgets, procurement and supply management plans); Supervise and monitor the work of project staff and performance of consortium partners, providing support to ensure high-quality implementation that aligns with USAID guidelines and FP High Impact Practices; Oversee the development and application of strong M&E systems, program monitoring tools, and efficient mechanisms that support high quality implementation; Emphasize the use of data and learning for ongoing program improvement and adaptation; Establish compliance with US Government regulations, policies, and procedures and Save the Children guidelines; Represent the project externally and maintain effective communication, coordination, and positive relationships with key counterparts, such as from USAID, Government of Nepal ministries and divisions (e.g., Ministry of Health and Population, Family Welfare Division, and the National Health Training Center), other international implementing partners, and local NGOs; Actively participate as a member of the Country Extended SMT, contributing to country strategic plans; Create and sustain a work environment of mutual respect where the project team strives to achieve excellence and ensure a cohesive workplace for optimum staff retention; Ensure staff understand SC’s vision and values and fully adhere to SC’s Code of Conduct principles; Ensure project funds are used appropriately and efficiently; and Lead coordination and maintain communication with SCUS Required Qualifications Clinical background in medicine or nursing or masters-level degree in Public Health, Non-Profit Management, or related. Minimum 7-10 years’ of professional experience designing, managing and implementing donor-funded RH/FP, adolescent health, social and behavior change, and/or health systems strengthening programs; At least five years of experience in a senior management role (e.g., as a Program Director, COP, or Deputy COP) leading large, multi-stakeholder programming in a developing country or countries; Familiarity with the processes, procedures, and policies of the Government of Nepal; In-depth knowledge of USAID approaches and regulations; Excellent interpersonal skills and demonstrated ability to lead teams effectively; Creative problem solving skills with the ability to work effectively in resource-constrained environments; Excellent oral and written communication skills in English; and Knowledge of Nepali preferred. Qualified local candidates are encouraged to apply.About Save The ChildrenSave the Children believes every child deserves a future. In the United States and around the world, we give children a healthy start in life, the opportunity to learn and protection from harm. We do whatever it takes for children - every day and in times of crisis - transforming their lives and the future we share.Save the Children is committed to conducting its programs and operations in a manner that is safe for the children it serves and helping protect the children with whom Save the Children is in contact. All Save the Children representatives are explicitly prohibited from engaging in any activity that may result in any kind of child abuse. In addition, it is Save the Children’s policy to create and proactively maintain an environment that aims to prevent and deter any actions and omissions, whether deliberate or inadvertent, that place children at the risk of any kind of child abuse. All our representatives are expected to conduct themselves in a manner consistent with this commitment and obligation. Any violations of this policy will be treated as a serious issue.We provide equal employment opportunities (EEO) to all employees and qualified applicants for employment without regard to race, color, religion, gender, gender identity or expression, ancestry, sexual orientation, national origin, age, handicap, disability, marital status, or status as a veteran. Save the Children complies with all applicable laws.  ",
        "level": "Executive",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/project-director-chief-of-party-adolescent-reproductive-health-family-planning-nepal-at-save-the-children-us-2172567620?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Associate Director, Technical, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director.  The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position Description:The Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration.  The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects.  This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region.  This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups.  The Technical Director will  support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life.  She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work.  The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team.  Availability of position is contingent upon award to FHI 360.Key responsibilities:Assist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualifications:At least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package, professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself. Please click here to continue searching FHI 360's Career Portal. About Us FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in health, education, nutrition, environment, economic development, civil society, gender, youth, research, technology, communication and social marketing — creating a unique mix of capabilities to address today's interrelated development challenges. FHI 360 serves more than 60 countries and all U.S. states and territories.As we evolve to meet the challenges of the future, we stand committed to the principles that have guided our organization for the last 40+ years. Our work continues to be grounded in research and science, strengthened by partnerships and focused on building the capacity of individuals, communities and countries to succeed.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 will never ask you for your career site username or password, and we will never request money, goods or services during the application, recruitment or employment process. If you have questions or concerns about correspondence from us, please email CareerCenterSupport@fhi360.org.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/associate-director-technical-csm-nepal-at-fhi-360-2173706271?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "HR Manager- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International Inc. seeks an HR Manager for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The HR manager will lead all HR functions of the project and will be based in Nepal.Responsibilities Lead the full-cycle recruitment process including finalization of job descriptions, advertisement of vacancies, review of applicants, scheduling and conducting interviews alongside project senior management, checking candidate references, and collecting new hire documents;  Onboarding/orientation of new project hires;  Manage employee benefits enrollment;  Coordinate the performance evaluation process;  Provide information and advice to project staff regarding HR policies and procedure.  Coordinate staff training and establish staff development plans based on appraisals and evaluations;  Create and maintain personnel files;  Provide oversight related to the updating of personnel files and other related HR documents including employment agreements, amendments, time sheets, calendar holidays and leaves;  Perform other duties as assigned. Qualifications Bachelor’s degree in human resources, business administration or a related field is required.  At least five (5) years of progressively responsible HR experience.  Excellent communication and interpersonal skills.  Excellent record keeping and documentation skills.  Familiarity with donor/client rules and regulations.  Familiarity with local employment law.  Proficiency with Microsoft Office; and  Verbal and written working proficiency in English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/hr-manager-nepal-at-social-solutions-international-inc-2010750097?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior/Principal Engineer - .Net Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionWhat you get to do every day:Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsPossess strong troubleshooting, code optimization and refactoring skills.Experience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Leadership quality and ability to guide design and technical meetingsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal)QualificationsYou must have demonstrated experience in several of these domains and technologies:Bachelor’s degree in Computer Science, Engineering or a related subjectAt least 4 years full-time work experience in .NET technologiesStrong ability to build RESTful services in C# with .NET/.NET CoreExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Proficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNExperience working on AWS based solutions and knowledge of Microsoft SharePoint Technologies would be a plus.Additional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-principal-engineer-net-developer-at-verisk-2197785986?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Evaluation Lead- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks an Evaluation Lead for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Work with the Contracting Officer’s Representative (COR) and other USAID technical staff to develop the necessary methodologies to meet the deliverables required in the SOWs for evaluation tasks.  Manage the subcontractors to assure performance to task requirements and timelines and development of quality deliverables.  Provide technical and editorial feedback on internal and external deliverables for studies.  Provide technical inputs in designing surveys, assessments, and evaluations (performance and impact)  Oversee conduct of evaluations, studies, assessments, and surveys to assess the status and impact of USAID s activities  Document lessons from evaluations and incorporated in the MEL Activity s progress reports.  Foster knowledge sharing and disseminate evaluation findings and lessons to increase awareness and knowledge.  Supervise monitoring and evaluation staff.  Liaise with Mission staff, Implementing Partners, Government of Nepal and NGO stakeholders. Qualifications A Master’s degree in a field relevant to monitoring and evaluation or international development (e. g., economics, public policy, international relations, statistics, political science, health, education, agriculture, etc.).  At least 10 years of experience working in monitoring and evaluation of international development programs  At least 3 years of experience serving as the team lead for evaluations  Experience guiding recruitment and hiring of consultants related to M&E work.  Experience leading the development of evaluation scopes of work (SOWs)  Significant experience in qualitative and/or quantitative analysis, data collection, and reporting  Knowledge of USAID evaluation policies and regulations.  Excellent oral and written communication in English and Nepali; and  Strong interpersonal skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/evaluation-lead-nepal-at-social-solutions-international-inc-2176224191?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Advisor (Family Planning & Sexual and Reproductive Health Services) USAID Nepal Family Planning",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611187200&v=beta&t=Co6xQWxgETMl1_SuCk2bBrJ_tZnPIZ3JhPre2MsxeQQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories.We are currently seeking qualified candidates for the position of: Technical Advisor (Family Planning & Sexual and Reproductive Health Services) (FP/SRH)for an anticipated Family Planning Opportunity in Nepal. This position is subject to project award and funding. Position DescriptionThe Technical Advisor (FP/SRH) will contribute to the overall project through strategic planning, evidence generation and dissemination, coordination, and advocacy. S/he will also work with the project team to deliver, document and disseminate results in an effort to improve knowledge management. S/he will be responsible for the oversight and technical direction of service delivery, and community and household-level strategies and interventions to further reduce the unmet need for FP/SRH including adolescent sexual and reproductive health (ASRH) services.S/he will also provide technical support in i mproving access to FP/SRH including ASRH services, in the areas of reaching underserved populations, reaching male and female , adolescent girl and young women coordinating with a social marketing program, expanding community-based FP/SRH services, including contraception, increasing access to SRH information, including comprehensive sexuality education, develop different community outreach strategies, developing innovative approaches to increasing the contraceptive prevalence rate (CPR) identifying the needs of specific target groups such as very young adolescents, young mothers, and vulnerable girls.This position is based in Kathmandu, Nepal, and will report to the Chief of Party.Key ResponsibilitiesLead the team in designing, implementation and management of the FP/SRH including ASRH component project; ensure high-quality program implementation through monitoring and oversight in close coordination with project staff.Provide technical assistance to strengthen the capacity of project staff, partners and other government staff to design and implement quality FP/SRH including ASRH programing using global best practicesProvide technical guidance and strengthen capacity of district health institutions and other implementing partners for the delivery of a range of quality FP/SRH including ASRH services in line with the project guidelines.Work with government and other stakeholders on informing policy, guideline development, as well as advocacy on key health service delivery issues.Ensure technical quality of training activities through facilitative supervision and monitoring; jointly with government and partners, where feasible;Lead all FP/SRH activities of the project in the geographical jurisdiction assigned. The person will coordinate, identify and mobilize stakeholders who will be collaborators in the implementation of activities, oversee activity roll out, implement and sustain knowledge and demand for servicesConduct needs assessments undertaken by the project in the area, including those for training needs, other assessments to be undertaken in the program in regards FP/RH.Establish and maintain effective follow-up and support system for partner agencies on FP/RH components as planned, ensuring performance of all FP/SRH indicators.Strengthen collaboration with the key stakeholders and partners including other USAID-funded projects for shared results through addressing both supply and demand side issues in the overlapping program districts.Represent project at the center and provincial level meetings/workshops among the Government of Nepal (GoN) officials, key stakeholders and partners including USAID partners FP team meetings and FP Sub-Committee, ASRH Sub-Committee meeting and other relevant Technical Working Group meetings led by the Family Welfare Division.Strengthen collaboration with other key players on ASRH, GoN and stakeholders at sub-national levels for improving quality Adolescent Friendly Services from the GoN designated service delivery sites.Minimum RequirementsAt least a master’s degree or bachelor’s degree in Medicine; an additional qualification in Public Health with specialization on SRH, would be advantageous;At least have 5 – 8 years of experience and knowledge of FP/SRH including ASRH especially in the areas of implementation, and managing of public health/international development programs funded by US government or other international donors;Excellent skills in capacity building and experience in conducting trainings of different categories of stakeholders.Knowledge of public health related issues, sensitivity to cultural differences and understanding of the political and ethical issues surrounding public health issues; written and verbal communication skills.Excellent oral and written communication skills in English; knowledge of local language will be an advantage.This job description summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-advisor-family-planning-sexual-and-reproductive-health-services-usaid-nepal-family-planning-at-fhi-360-2005156503?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer - Front End Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionResponsibilities -  Make design and technical decisions for Angular projects Perform unit testing by using different frameworks like Jasmine, Karma Be involved in all phases of the agile software development lifecycle Proactively seek out and minimize pain points within the infrastructure and code base Keep up to date with the latest technologies and introduce them as needed Create next-gen solutions for unique and challenging use cases Communicate proactively with Business stakeholders and provide design suggestions Analyze, debug and fix defects QualificationsEducation Level: Bachelor’s in Computer Science, or related field or equivalent experienceExperience Required: At least 3 years of professional experience in JavaScript / Angular TechnologySkills And Knowledge - Passion for programming in general, rather than a specific language Be focused, passionate, and strive to find simple solutions to complex problems Ability to learn new, emerging technologies You have a solid general understanding of application components, what happens on the front end, what happens on the back end. You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the above Ability to effectively work on multiple projects simultaneously and effectively contend with competing priorities Possess strong troubleshooting, code optimization and refactoring skills Have strong sense of ownership with demonstrated ability to work independently without supervisionTechnical Expertise JavaScript frameworks (Angular 4+ - preferably the latest verison, AngularJS, React, jQuery), RxJs, Redux, Web markup languages (HTML/HTML5, XML) and Style sheet language (CSS/CSS3), SASS, LESS Well versed in using UX and UI design tools like Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe XD Experience in working with using html frameworks like Bootstrap and Foundation Writing tested and documented JavaScript with Expertise in build processes (Angular CLI, Webpack) Experienced in writing test cases and performing unit testing using frameworks (ex. Jasmine, Karma) Used DevOps and CI/CD in previous work experience Developed software in SCRUM environment using Agile methodologies and involved in SDLC processAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-front-end-developer-at-verisk-2202377424?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Monitoring & CLA Expert, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a Monitoring & CLA Expert for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Primarily responsible for delivering learning results and tracking adaptations for lessons learned;  S/he will provide vision and leadership to the Mission’s “learning” agenda; ensure the quality, timeliness and technological sophistication of services related to improving the integrity and usefulness of USAID/Nepal monitoring and reporting systems; ensure the quality, relevance, technological sophistication and timeliness of Contractor-provided evaluations, analyses and assessments; deepen USAID/Nepal’s existing learning capabilities and introduce improved avenues to learning;  Leads contractor contributions to USAID/Nepal’s efforts to deliberately draw contextual, programmatic and operational learning from its monitoring, evaluation, analytical and assessment efforts; and facilitate learning’s transformation into adapting.  Promote CLA Activities for strategic collaboration in order to identify possible program and context gaps at the strategy level as well as offer periodic opportunities to reflect on progress, such as after-action reviews and partner meetings to inform on possible adaptation changes.  Conduct and lead meetings, workshops and presentations for USAID/Nepal and other staff and outside stakeholders, as appropriate.  Support a series of workshops and conferences to convene USAID staff, implementing partners, and local stakeholders to discuss challenges, share best practices, and foster collaboration on specific topics related to USAID’s areas of intervention.  Support Mission staff in aligning policies, practices and processes with lessons learned.  Collaborate closely with and manage other activity staff from the Evaluation, CLA, and GIS Teams.  Ensure that all products and services meet USAID and Social Solutions quality expectations.  Support the Mission in the development of Data Quality Assessments (DQAs). This task will entail field visits to review and analyze the quality of data collection procedures and ensure that the standard definition of indicators is being properly understood and applied.  Identify, jointly with USAID/Nepal, relevant context indicators for the Mission’s programming at the national, departmental and municipal level, and collect and update data for the context indicators identified in available secondary sources and USAID datasets derived from evaluations and assessments.  Contribute to the construction of tables and dashboards for consulting context indicator data.  Support the Mission and its implementing partners (IPs) in the data collection of baseline and monitoring data. In particular, support implementing partners to identify and gather data on context and impact indicators.  Review and analyze context and performance data collected by the contractor or USAID implementing partners, particularly for MEL purposes.  Contribute to data collection and standardization of cross-cutting issues, such as gender equality and female empowerment. Qualifications A Master’s Degree in social sciences, statistics, or related fields.  At least 10 years of progressive experience in designing, implementing, managing, and analyzing monitoring related tasks for development projects, including the development of context and complementary indicators or similar monitoring approaches at the Mission-level.  At least three years of experience in Southeast Asia is strongly preferred.  Field experience that includes at least some but not necessarily all of the following: Survey research experience, including development of structured and semi-structured interviews.  Structured or semi-structured group interviews and/or focus groups, including the creation of written instruments and transcripts for same; content analysis and other techniques for coding and transforming group/open-ended data into analyzed information.  Experience implementing quantitative and qualitative data collection and analysis for evaluations and assessments, including experience with sampling methods, database management and statistical analysis.  Applied experience with non-experimental theory testing techniques for examining program/project effects (baseline reconstruction, outcome mapping, outcome harvesting, general elimination method (modus operandi), contribution analysis, lagged regressions and/or others).  At least five years of experience leading evaluation or research teams.  Excellent team management and interpersonal skills, including some workshop facilitation skills.  Excellent team management and interpersonal skills.  Fluency in spoken and written English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/monitoring-cla-expert-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-2010545309?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Software Engineer- ETL Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Senior Software Engineer/ETL DeveloperExperience Required: 4+ years of overall industry experience with experience in ETL design/development. ReceivedResponsibilitiesSupport, development and data operation workload.Coordinate and communicate effectively with team members and various stakeholders.Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements.Identify and test for bugs and bottlenecks in the ETL solution.Ensure the best possible performance and quality in the packages.Participate in different support activities.Skills And ExpertiseExperience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting.Experience with ETL tools and processes (Pentaho/PDI preferred)Experience or Knowledge in Data masking and Data integrity check.Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc.Experience in writing advanced SQL scripts.Experience or Knowledge in AWS Services.Experience working in an Agile development process.Excellent problem solving and data analysis skills.Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features.Demonstrated ability to work independently with minimal supervision.Good communication skill in verbal and written.Ability to troubleshoot and maintain mid-level to complex applications. QualificationsEducation Level: Bachelor’s degree in Computer Science, Engineering or a related subjectAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-etl-developer-at-verisk-2197792079?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "MEL Specialist, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a MEL Specialist for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Work with the Contracting Officer’s Representative (COR) and other USAID technical staff to develop the methodologies necessary to meet the deliverables required in the SOWs for evaluation tasks.  Serve as lead analyst for interpreting the results of surveys and other field data and responsible for report preparation.  Assist in the assessment of impact evaluations and performance monitoring.  Develop M&E plans, define project indicators, and collect and review monitoring data.  Contribute to performance and impact evaluations through questionnaire development, key informant in-depth interviewing, managing survey data collection, reviewing data, preparing datasets, analyzing quantitative or qualitative data, and report writing.  Interpret outcomes of implementation through data or other evidenced-based sources and provide program recommendations as needed.  Assist in the management of field monitoring, evaluation design, empirical and statistical analysis, environmental compliance, and management of information systems.  Provide quality assurance/quality control for local subcontractors.  Collect and verify data on technical implementation, coordinate with both technical and operation staff and contribute to overall project reporting requirements as per contractual agreements. This might entail, and not be limited to, quarterly and weekly reports, evaluation and case studies, success stories, etc.  Work closely with project leadership and manage directly project efforts to effectively design and implement dissemination strategies and activities to communicate analytical products developed under the project as part of learning and/or strategic communications and public outreach agenda.  The successful candidate will take the lead in supporting learning agendas, collaboration, learning and adapting, and knowledge management activities; all aimed at facilitating effective collaboration and promote learning and sharing among stakeholders. Qualifications A Bachelor's degree or higher in a relevant field, such as applied social sciences, development economics, or monitoring and evaluation.  A minimum of 5 years of progressive responsibility working in M&E for donor­ funded development programs. Previous USAID experience is a plus.  Experience in developing performance management plans (PMPs) and conducting data quality assessments (DQAs); analyzing both qualitative and quantitative data; using online M&E databases to collect performance indicators; conducting routine monitoring of data for a donor-funded project; and conducting participatory or impact evaluations.  Experience writing findings and recommendations in assessment or evaluation reports.  Experience in report writing, especially under USAID contracts, and development of dissemination; knowledge management and communication strategies.  Strong organizational, writing and communication skills.  Strong proficiency in MS Office suite (Word, Excel, Outlook, PowerPoint).  Ability to coordinate well with personnel within and outside the project, meet deadlines and work with minimal supervision.  Computer literacy, with ability to analyze and interpret data using Excel, online reporting tools, or statistical packages such as SAS, SPSS, or STATA.  Fluency in spoken and written English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/mel-specialist-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-1884438225?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer- ETL Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Software EngineerExperience Required: 2+ years of overall industry experience with experience in ETL design/development.ResponsibilitiesSupport, development and data operation workload.Coordinate and communicate effectively with team members and various stakeholders.Understand the business requirement, produce code and conduct testing to ensure that product meets the requirements.Identify and test for bugs and bottlenecks in the ETL solution.Ensure the best possible performance and quality in the packages.Participate in different support activities.Skills And ExpertiseExperience in creating ETL pipeline including extraction, transformation, merging, filtering, joining, cleansing, scheduling, monitoring, troubleshooting.Experience with ETL tools and processes (Pentaho/PDI preferred)Experience or Knowledge in Data masking and Data integrity check.Experience or Knowledge in any programing language like Java, Python, Shell Scripting etc.Experience in writing advanced SQL scripts.Experience or Knowledge in AWS Services.Experience working in an Agile development process.Excellent problem solving and data analysis skills.Superior organization skills, skilled at recognizing priorities and keeping a team focused on most important features.Demonstrated ability to work independently with minimal supervision.Good communication skill in verbal and written.Ability to troubleshoot and maintain mid-level to complex applications. QualificationsEducation Level: Bachelor’s degree in Computer Science, Engineering or a related subjectAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-etl-developer-at-verisk-2197787818?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "GIS Advisor, Nepal Monitoring, Evaluation, and Learning Activity",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611187200&v=beta&t=i4ubyj5Or6j337hx0lQkNuNJ5bSZELtT5r5dW2zG4ho",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned firm consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions is seeking a GIS Advisor for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support the USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Assess and review the status of the GIS capacities of the Mission and implementing partners (IPs), including a review of the products and analyses done.  Develop the necessary GIS standards and templates for the Mission and IPs in order to standardize GIS-related deliverables and data submission.  Implement GIS best practices in areas such as geospatial metadata standards, workflows, and data-sharing protocols.  Using visualization tools, assist USAID subject matter experts with spatial analytical thinking for improved planning, monitoring, evaluation, learning, and reporting of programs.  Assist USAID/Nepal in planning and collection of all GIS-related data elements of monitoring, evaluation, and learning, e.g., surveys, evaluations, and baseline collections, as well as in the preparation of the corresponding maps, as required.  Collect geographic location coordinate data from USAID implementing partners and conduct onsite visits to complement available data.  Prepare clear visualizations showing the results of data analysis to USAID and relevant stakeholders, using various formats as appropriate (paper, web-based, GEO PDF, story maps, etc.). Define and apply a production workflow to streamline data management from collection to cartographic output. When relevant, collect, clean, and process the data from disparate sources and format for reporting on ad-hoc GIS-related requests.  Collaborate with the geospatial community both locally and internationally and build working-level contacts with international and bilateral donor organizations responsible for the coordination of donor assistance. Qualifications University Degree in a related field required; advanced degree preferred.  Experience with GIS/information systems required.  Minimum of 5 years’ project implementation experience with USAID or other development donors.  Fluent oral and written communication skills in English; strong oral and written communication in Nepali strongly preferred.  Knowledge of development issues in Nepal/Southeast Asia region.  Ability and willingness to travel throughout Nepal and the region.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.#DNPAJE",
        "level": "Associate",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/gis-advisor-nepal-monitoring-evaluation-and-learning-activity-at-social-solutions-international-inc-2000709312?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer/Data QA Automation Engineer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611187200&v=beta&t=_lhGfriS5r6XCc73uTk4ATexwN-u8EhQzLtKTWxyMQg",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: Software Engineer/Data QA Automation EngineerExperience Required: 1 to 3 years of professional experience in Software Quality Assurance, back-end data testing and Data QA AutomationResponsibilitiesAct as QA lead on a wide variety of data intense projectsLead analysis for the purposes of developing test cases and test data for back-end data intense applicationPerform hands-on manual testing while scripting automated tests to ensure application and data quality.Test ETL systems in Pentaho which includes Data Analysis, Test Data Creation in different format/input files and Testing regulated data – majority in a scripted automated environment.Continuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation Suites. Serve as a liaison to business analyst and product owner, providing feedback on application readiness for migrations.Skills And ExpertiseProficient in SQL queries and Relational Database concepts, Aurora Postgres, data structures and data operations in general.Expertise in data workflow testing, data analysis, Test Data Creation in different format/input files along detailed data verification testing with handling regulated dataExperience in ETL testing - Pentaho / Microsoft SQL Server Integration Services (SSIS)Technically familiar with development concepts and formats such as SQL, XML, JSON and scripting languagesExperience in testing non-GUI applications (SQL, Flat Files, XML, JSON etc.)Strong understanding of object-oriented programmingGood knowledge of a programming/scripting language – JAVA, Scripting, PythonKnowledge or Experience in AWS Services is a plus, but not required. Sound technical background, great communication skills, and a motivation to achieve results in a fast-paced environmentA wholesome QA resource with an ability to put together test plan and test case scenarios, create test data and verify output using scripted scenariosPossess excellent problem-solving abilitiesKnack for writing clean, readable, and easily maintainable QA automation workflowsProficient in developing and implementing automated testsProficient understanding of code versioning tool and familiarity with Continuous Integration atmosphereQualificationsEducation Level: Bachelor’s in Computer Science, or related field or equivalent experienceAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-data-qa-automation-engineer-at-verisk-2197790579?refId=d95cd94b-c1d7-4d52-8efa-f57c17f5f99c&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Director, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611792000&v=beta&t=oLqLhAfEaWKmwDruaZYCf2t5Rf0ZQRHLOXlT-hmNXJk",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director. The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position DescriptionThe Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration. The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects. This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region. This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups. The Technical Director will support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life. She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work. The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team. Availability of position is contingent upon award to FHI 360.Key ResponsibilitiesAssist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualificationsAt least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-director-csm-nepal-at-fhi-360-2191733532?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer Trainee - .Net",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611792000&v=beta&t=KGu2l_RB1I-TbIG2STQFHP9O3LGCYfE4ecUmIEgtj4g",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: .NET TraineeRequirementsGood knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Problem solving skillsGood knowledge curve - Ability to learn quickly and implement Good attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skills QualificationsBachelors in Computer Science / Information Technology or equivalent.Up to 1 year of working experience in development are also encouraged to applyAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-trainee-net-at-verisk-2223232018?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Research Consultant (National)",
        "company": "UNDP",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQFIruBoghVYeQ/company-logo_100_100/0?e=1611792000&v=beta&t=2sbcxLeETIdANAbkRpnDClYRhbYYFVUYACBwfa9QmzQ",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "BackgroundBackground and JustificationGrounded in the vision of equality enshrined in the Charter of the United Nations, UN Women works for the elimination of discrimination against women and girls; the empowerment of women; and the achievement of equality between women and men as partners and beneficiaries of development, human rights, humanitarian action and peace and security. Placing women’s rights at the center of all its efforts, UN Women will lead and coordinate efforts of the United Nations System to ensure that commitments on gender equality and gender mainstreaming translate into action throughout the world. It will provide strong and coherent leadership in support of national priorities and efforts, building effective partnerships with government, civil society and other relevant actors.Under the framework of the current UN Women Nepal Country Office (NCO) Strategic Note 2018-2022, UN Women in Nepal continues its work to strengthen women’s leadership and participation in national and local level decision-making processes and empower women economically by supporting women, especially those from the most vulnerable and excluded groups [1] . Furthermore, NCO’s strategy for women’s economic empowerment (WEE) outlines a holistic feminist approach to WEE which extends beyond enhancing the economic competency and income generation capacity of women to also developing women’s leadership, voice and representation, and to addressing structural discrimination and barriers. In order to reinforce the ongoing WEE efforts in the country, UN Women NCO aims to support women in advancing their economic opportunities in the formal market by leveraging their vocational skills, life skills, leadership, voice and representation.Within the scope of the SN, UN Women Nepal has prioritized interventions with women from the most excluded groups. This includes conflict affected single women who continue to face multiple level of violence and discrimination, social and economic barriers including stigmatization and challenges to re-integrating in society as a consequence of the ten -year long armed conflict in Nepal (1997-2006).A study on the impact of Nepal’s conflict on women [2] revealed that the socio-economic barriers that conflict affected women face, especially single women and Conflict Related Sexual Violence (CRSV) families of disappeared, women who faced injury and disability due to violence in conflict . It shows that the armed conflict in Nepal impacted women not only at the individual level but also at family and community level. In Nepali culture the identity and status of married women are intimately tied to their relationship with their husbands and/or their extended families. The social and cultural practices have maintained implicit and explicit rules whereby women have restricted mobility, limited decision-making and access to resources/property to sustain their livelihood. In general, women’s access and control over productive resources is severely restricted. In the case of single women and CRSV survivors, wives of disappeared, women who faced disability and injury due to violence in conflict they face additional discrimination and challenges in claiming inheritance/from their husbands and family members, which in turn impedes their ability access financial services and capital resource for business investment.Learnings from UN Women’s past programming with conflict affected single women also point to challenges faced by them in availing business loans from local financial institutions, due to their inability to provide collateral and/or solicit family support. Further, perceptions around women’s poor business skills, their low repayment capacity pose as additional barriers. Prevailing social norms around their identity as conflict affected single women, results in social stigma and discrimination at the community level [3] .According to a 2015 global study on the Implementation of UN Security Council Resolution 1325 [4] CRSV survivors were neglected by the government’s provisional programme of interim relief, reparation and financial assistance for the women and children affected by the armed conflict implemented in the post conflict period in NepalThe CEDAW committee in its concluding observations (2018) to the sixth periodic report of Nepal explicitly raised concerns that women and girls who are victims of the armed conflict, including victims of rape and other forms of sexual violence, do not benefit from interim relief or full reparations.In this context, the draft NAP-II has identified livelihood support, in particular technical skills and financial inclusion, as key areas to enable conflict affected single women to live a dignified life in the post conflict period of Nepal.In the context of Covid-19 where a health-related humanitarian crisis has evolved simultaneously into a socio-economic crisis with an unprecedented cessation of economic activities, the need for financial inclusion to conflict affected single women has become more critical than ever before. COVID-19 has not only affected livelihoods across the world, it has also exacerbated many existing gender-based inequalities and multiple discrimination in affected countries, including Nepal.A rapid assessment carried out by UNDP reported that the mean severity of the impact of Covid-19 to women is high due to their inability to find alternative source of income which is followed by incapacity to pay loans, psychological problems and incapability to find new job [5] . Micro and small business are often characterized as having low asset to cash ratio, entailing high dependence on their business. This is more intense in the cases MSMEs owned and managed by women given their limited access to property and capital. Also, women led small and micro business, typically have poor access to finance, and during times of crisis such as the ongoing COVID 19 pandemics are likely to resort to informal money lenders and fall prey to usury.During the Socio-Economic Recovery (SER) consultations, it was reported that single women-led households, women from the Dalit community, conflict affected women and poor women have become the most vulnerable groups during the lockdown; and are more at risk of the sexual violence . Further the issue of psycho-social wellbeing, regular medical needs and livelihood issues was also raised by conflict affected women’s group during the consultation. One of the key recommendations of the single women’s group was the need for the government to focus on subsidizing local resources for sustenance of their local business so as to enable them to be better prepared for disasters such as Covid-19 [6] .For the short term, SER has prioritised to work with key partners to support the exploration and implementation of measures to alleviate financial hardships. These measures may include the provision of subsidies for operating costs, particularly for workers’ wages, tax rebates and easing loan payments by waiving penalties and extending payment timelines. Also, in the medium and long term, SER has prioritized to support entrepreneurship and the establishment of new businesses, particularly for youth and women, as well as ensuring that new and existing MSMEs are resilient to future shocks. This will involve capacity building and improving access to services related to business registration, business development, business continuity and business financing. To make these interventions inclusive and prevent the most vulnerable groups from falling through cracks, it is imperative to design interventions that address the specific needs of women from excluded groups such as conflict affected single women. In line with the priorities listed in the SER, UN Women Nepal aims to design an initiative on “Financial Inclusion of Conflict affected Single Women to advance their Economic Security and Rights” in Sudurpaschim province of Nepal. This initiative will target in particular women who became single due to conflict, CRSV survivors, wives of disappeared, women who suffered mental and physical torture and women who faced disability and injury due to conflict. To inform the design of this initiative, UN Women is seeking the services of a consultant to conduct a feasibility analysis.[1] Excluded women’s groups include rural women, conflict affected women, survivors of trafficking, returnee women migrant workers, home-based workers and women living with HIV.[2] Across the lines-The impact of Nepal’s conflict on Women-2010, https://www.ictj.org/sites/default/files/ICTJ-Nepal-Across-Lines-2010-English.pdf[3] UN Women documented this issues from the interaction meeting with conflict affected single women in 2019[4] Global Study on the Implementation of the UNSCR 1325 “Preventing Conflict Transforming Justice, Securing the Peace. Available at: http://wps.unwomen.org/~/ media/files/un%20women/wps/highlights/unw-global-study-1325-2015.pdf[5] Rapid Assessment of Socio-Economic Impact of Covid-19 in Nepal, UNDP 2020[6] United Nations Socio-Economic Recovery Framework 2020ObjectiveThe objective of the study to identify the most feasible programmatic interventions to accelerate the financial inclusion of conflict affected single women at the local level in the post Covid-19 recovery phase. It specifically aims to:To map the existing financial institutions, their services and identify regulatory, policy, operational and programmatic gaps from a gender perspective.To identify key barriers and challenges that conflict affected single women continue to face in accessing financial services from existing financial institutions in Nepal, including social and cultural norms especially in Sudurpaschim province.To map the major locally available/ongoing financial inclusion programmes of GON, private sectors and development actors in Nepal and analyze their strength and weakness from a gender perspective.To develop a set of recommendations to inform UN Women, government and development partner’s programming on financial inclusion from a substantive equality approach.Scope Of WorkDuties and ResponsibilitiesIn line with the objectives mentioned above, the scope of assignment is as follows: To map the existing financial institutions, their services and identify regulatory, policy, operational and programmatic gaps from a gender perspectiveCollect, review and analyze relevant documents of existing Financial Institutions (FIs) [1] and their services across Nepal from a gender perspective. Given UN Women’s proposal to implement this initiative in Sudurpaschim province, the study should focus on FIs that have a strong presence in Sudurpaschim province.Conduct interviews/discussions [2] with representatives from FIs (physically or virtually) to assess their institutional policy, operational structure and financial tools and services, regulatory measures from GESI lens, with a particular focus on conflict affected single women in the Covid-19 context.Analyse gaps if any in the existing policies, operational and programmatic frameworks of these FIs to address the specific needs of conflict affected single women on financial inclusion. This will entail an assessment of services available; the supply of financial services– who is currently being served and under what conditions, associated restrictive conditions such as collateral requirements for loans.Prepare a list of most relevant FIs (cooperatives, micro-finance and/or commercial banks) to work on financial inclusion to conflict affected single women in Nepal, particularly in Sudurpaschim province in the Covid-19 context.To identify key barriers and challenges that conflict affected single women continue to face in accessing financial services from existing financial institutions in Nepal, including social and cultural norms especially from Sudurpaschim provinceCollect, review and analyze all relevant documents on financial inclusion to conflict affected single women in the rural context within country and beyond.Collect primary data from field and/or remotely [3] on key barriers and challenges of conflict affected single women in relation to financial inclusion, taking into account social and cultural norms from Sudurpaschim province of Nepal in the context of Covid-19.Analyze the primary and secondary data to identify key barriers and challenges and associated capacity gaps of conflict affected single women to address those challenges. This will also entail an assessment of the demand side of financial services from women; what issues are raised and what barriers may women face when seeking to become customers of financial institutions, such as illiteracy, workload or the lack of control over household financial resources?To map the major locally available/ongoing financial inclusion programmes of GON, private sectors and development actors in Nepal and analyze their strength and weakness from a gender perspectiveCollect, review and analyse all relevant programmes on financial inclusion in Nepal or beyond.Collect primary data from field and/or remotely from the relevant representatives of government, private sectors and development partners implementing financial inclusion programmes [4] at national/sub-national level in Nepal in the federal context.Analyze strength and gaps of the financial inclusion programmes and identify the most relevant financial model/entry points to address gender gaps and strengthen financial inclusion of women, especially for conflict affected single women. To develop a set of recommendations to inform UN Women, government and development partner’s programming on financial inclusion from a substantive equality approachDevelop a set of recommendations to inform UN Women, government and development partner’s programming on economic security and rights; with a focus on enhancing financial inclusion, and what that would entail from a substantive equality approach.Provide a set of strategic recommendations for evidence-based advocacy with key stakeholders- government, private sector, FIs, development partners, with possible entry points.Document at least two successful financial inclusion models that can be adapted to address the needs and interests of conflict affected single women at the local level.DeliverablesDELIVERABLESTARGET DATE (for final submission)Inception Report with details of data collection methodologies and tools, proposed work planWithin two weeks after the signing of a contractA Draft Report with the key findings of the study inclusive of the following.Summary report of desk reviewSummary report with preliminary findings of primary data collection (Interview and analysis)A list of most relevant FIs to work on financial inclusion to conflict affected single womenA list of key barriers and challenges and associated gaps in relation to financial inclusionA list of the most relevant financial model/entry points to strengthen financial inclusion of women, especially for conflict affected single womenA set of recommendations to inform UN Women, government and development partner’s programming on economic security and rights; with a focus on enhancing financial inclusion, and what that would entail from a substantive equality approach.A compilation of at least two successful financial inclusion models that can be adapted to address the needs and interests of conflict affected single women at the local level.Within 12 weeks after the signing of the contractFinal Report with a set of focused recommendations to future programme design on financial inclusion, in particular, to conflict affected single women from a substantive equality approach. Final Report should incorporate at least two successful case studies of financial inclusion model/programme to women in the rural context from Nepal or beyond and a policy brief. Consultant should make a presentation on the key findings.Within 16 weeks after signing of the contractTime Duration15 November 2020 – 15 March 2021Payment ScheduleThe payment will be made upon the successful completion of the deliverables20% payment upon submission and approval of the inception report40% payment upon submission and approval of the first draft report40% payment upon submission and approval of the final report.LocationThe primary data collection will be conducted in Kathmandu and Sudurpaschim province of Nepal either directly from the field or remotely.Quality AssuranceWith support from UN Women, the consultant will ensure the quality measures of the proposed assignment. The quality measures will be finalized during the inception meeting which should be incorporated in the inception report.Guiding PrinciplesGender equality and social inclusion (including Leaving No One Behind )Context and culturally sensitive approachHuman rights-based approachDo No HarmInnovationIntegrityProfessionalism[1] The financial institutions should include commercial bank, agriculture development bank, micro-finance, cooperatives, and Nepal Rastra bank.[2] key informant interviews with 10-15 representatives from financial institutions from Sudurpaschim province and Kathmandu as well as representative from Department of Cooperatives under Ministry of Land Management, Cooperatives and Poverty Alleviation.[3] Key informant interview/discussions with at least 15 primary respondents from conflict affected single women, in particular the groups prioritized for this TOR, through telephone and other relevant communication platforms in case the mobility restriction continues.[4] key informant interview with at least 8-12 representatives from relevant programmes on financial inclusion designed and implemented by government, private sector and development actors.Competencies Functional CompetenciesSound knowledge of the governance system of Nepal, in particular the new context of federalism and Covid-19Sound knowledge of women, peace and security including impacts of conflict on women in Nepal and ranges of conflict specific issues.Sound knowledge and technical expertise on gender and financial inclusionProven knowledge of international and national human rights conventions and normative instruments related to gender equality, women’s economic, social and cultural rights.Demonstrated experience in conducting research on gender equality and women’s economic empowerment, and formulation of action-oriented programming recommendationsDemonstrated commitment to working with women, girls, other genders that are economically, socially, culturally excluded and/or marginalizedA minimum ten years of proven experience in conducting research, working with national/international development partners in the areas of GEWE and financial inclusion, including the production of publication-ready reportsDetailed understanding of the full range of ethical and safety issues associated with conducting this type of research and demonstrated ability to address theseResearchers must have excellent written and verbal communication skills as well as strong gender analysis skills",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/research-consultant-national-at-undp-2229287964?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Full Stack Engineer",
        "company": "Softyca Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4E0BAQG82K-VofY3Kw/company-logo_100_100/0?e=1611792000&v=beta&t=UbUaXqKRMcxFMAErJR_DlqsDI45iY2ck9iIZA7_aYrg",
        "address": "Nepal",
        "desc": "Responsibilities:Identify innovative technology and methodology to optimize productivityEnsure safe delivery and execution of applicationsDevelop web applications utilizing modern programming languages (JavaScript, Java, Python, C#, C++, etc.)Collaborate with other professionals to understand complex ideas and drive featuresWork with remote development teams to create featuresOptimize qualities through refactoring, peer code review, and automationRequirements: Bachelor’s degree & equivalent work experience in computer science, engineering, or related field3+ years of experience in web application development3+ years of experience developing large traffic software designFamiliarity with JavaScript and JVM languagesExpertise in web development, cookies, cache, CORS, etc.Understanding of server API development",
        "level": "Not Applicable",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-engineer-at-softyca-inc-2176411324?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Database Administrator/Developer",
        "company": "Omnicom Media Group",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFOs9cg5FKb6Q/company-logo_100_100/0?e=1611792000&v=beta&t=aCc0m0aNnBYrjKnM4uQLB1f39j_-wRQPyU0R3CMOmMg",
        "address": "Bāgmatī, Nepal",
        "desc": "Role OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages. Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with. Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link at https://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2170970181?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Service Technician",
        "company": "Tetra Pak",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQHIEmKGTdVrug/company-logo_100_100/0?e=1611792000&v=beta&t=HgeSK1euTO92p7vBT5Iy_gSa8pY-hcFP61J6l-jWBEc",
        "address": "Birganj, Nārāyanī, Nepal",
        "desc": "At Tetra Pak we touch millions of lives every day, ensuring better nutrition and healthier lifestyles through safe packaging and food processing solutions. Guided by our global brand promise, PROTECTS WHAT´S GOOD, we strive to make a difference by protecting food, people and our futures. To do this we need more than smart technology. We need smart people too. People like you, who wants to work with people like us.Regional System Support Specialist Are you ready to take on a challenging role as Technician within APAC Services of Tetra Pak?As Technician, you will be responsible for taking care of maintenance and troubleshooting activities for our Nepal territory customers i.e. Dabur Nepal & other customers in Nepal. This position will be based in Birgunj, Nepal and will require extensive travel.What you will doParticipate in preparing customer site for installation events, assembling machines.Participate in execution of preventive maintenance activities.Inform relevant Tetra Pak staff in a timely manner about discovered Technical Issues.Participate in the installation of relevant rebuilding/upgrade kits.Inform relevant Tetra Pak Field Staff about ongoing service activities as well as of any issues affecting the customer or the quality of Tetra Pak service.Act as an ambassador for Tetra Pak at all times, ensuring good working relationships with the customer and Tetra Pak colleagues and that Tetra Pak’s reputation is sustained.Execute all work in accordance with Tetra Pak and Customer safety regulations and requirements. Execute all work in accordance with Tetra Pak standards and requirements regarding product quality and food safety. Escalate all discovered food safety, quality assurance and regulatory issues.Comply with all reporting requirements.Who you areWe are looking for you, a curious, committed, and highly motivated colleague wanting to expertly learn and work with Tetra Pak. We believe you have minimum 2 years hands on experience in equipment maintenance, servicing or installation and commissioning in any food/packaging, processing, or automation industry. Knowledge of PLC programming and troubleshooting will be an advantage. You have a full time Diploma/Bachelor’s degree in mechanical/electrical engineering with excellent verbal and written communication skills in English.We offerAs our new Technician, you will be part of a global leading company where our vision is to make food safe and available everywhere. We can offer you highly skilled and passionate colleagues and an international challenging and high paced work environment where our employees take great pride in protecting food and protecting the planet.Apply Now!If you are inspired to contribute to the APAC Services of Tetra Pak, feel free to apply through this post.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/service-technician-at-tetra-pak-2184301010?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior Software Engineer (Remote) - $60,000/year USD",
        "company": "Crossover for Work",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQE_m_twEzTeDA/company-logo_100_100/0?e=1611792000&v=beta&t=BDwx-ofZDl2FewYoBf-hgTWpD4d2Uf1J35yeSG8HmAo",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Are you a voracious learner with a genuine curiosity about new programming languages, frameworks and technologies? With the rapidly changing pace of tech, you need to work for a place that encourages you to refine and grow your technical skills, and requires you to the adopt new technologies that simplify and enhance our applications.The strength and capability of our engineering team is at the center of our bold vision for enterprise software and our ambitious growth strategy. For this essential role, we hire only the best software developers with the highest standards for quality and fast-track your career in software architecture and engineering.Unlike the typical role where you are sticky-assigned to a single product or feature, you will contribute to writing products across multiple domains and engineer them to the highest quality standards.What You Will Be DoingWriting code! From scratch. New features, new APIs, and 2X performance enhancements - you’ll get a spec and start coding. Your GitHub commits will tell the story of the impact you made on our codebase. Because there is never any shortage of new features to code, there will rarely be a day when you don’t commit a PR. Between teams staffed exclusively with A-players and quality standards that require comprehensive test coverage, you will confidently ship new features to production each week!To accomplish this you’ll be expected to grow your expertise to multiple languages, to become full-stack capable, and to quickly integrate new technologies and frameworks.What You Won’t Be DoingGetting bored modifying the same product for new requirements or debugging other peoples’ code. Sure, we expect you to test and debug your own code. But you won’t be forced to be the team’s firefighter, endlessly interrupted from writing your own great code to be asked to put out a fire caused by the resident arsonist who commits code that isn’t tested or testable or makes changes in one library that breaks the application elsewhere. That’s because we don’t have any arsonists on our engineering team due to our rigorous hiring process that identifies and selects only the top 1% of talent.Senior Software Engineer Key ResponsibilitiesYou will focus on three major areas: feature development, API development, and performance improvements. You’ll implement specs from all three areas, and across a hundred products in our portfolio. You will be laser-focused on new development work.Basic RequirementsExpert coder in Java, JavaScript, C++ or C# with a desire to become full-stack, capable of integrating and debugging front-end technologies.A minimum of 2 years of professional experience shipping commercial software.Systems thinker who understands how each feature fits into the overall design. You can make architectural decisions and document the rationaleQuick Learner. Pick up new products, technologies, and programming languages every weekHands-on experience using mocking frameworks to create unit tests with 100% code coverageAbility to work with a structured and disciplined approach - we aim for the highest quality the first time and every time, no “hacking” Nice-to-have RequirementsA university degree (BS, MS, or PhD) that included in-depth study of data structures, algorithms, object-oriented programming, computer architecture, and software engineeringExperience with cloud, docker and K8s environmentsAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go to www.crossover.com/testimonials to read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important! If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply. Crossover Job Code: LJ-3889-NP-Kathmand-SeniorSoftware.011",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-remote-%2460-000-year-usd-at-crossover-for-work-2204979287?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "JUNIOR TRADER / ANALYST - Dubai, UAE",
        "company": "Cobblestone Energy",
        "logo": "https://media-exp1.licdn.com/dms/image/C510BAQFxIuANc6IrXw/company-logo_100_100/0?e=1611792000&v=beta&t=38NLpoplmz9dTYfm1zYgJFP8GIlumvO5LIf1jntSBFc",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Junior Trader / Analyst - Commercial Development Programme - Dubai, UAE Starting Remuneration of 30,000 USD per annum, 0% Tax environment.Fast progression for strong performers.Are you bright, highly motivated and commercial-minded with a growth mindset?Company DescriptionEnergy in one form or another is fundamental to almost all of the world's economic activities. By understanding the demand, supply, and logistics of these commodities, we can better understand the world. We specialise in the proprietary trading of the short-term wholesale electricity markets across Europe. We make use of advanced data analytics and extensive research to drive profitable decision making, trading enough electricity every day to power a small country. Technology and risk management form the backbone of our businessCommercial Development ProgrammeThe Cobblestone Commercial Development Programme is your passport to an exciting and challenging career in the world's commodities markets. It is a 12-month programme designed to give you exposure across trading and analytics to help you develop the tools you need to be a highly effective team member. We are searching for exceptional graduates who thrive on intellectual challenges and can provide creative solutions to complex problems. This is a role for highly analytical and sharp individuals with strong numerical ability. One must be able to learn and think quickly. Opportunity is unlimited for exceptional talent.We are offering graduate vacancies in our Dubai office starting throughout 2020.Tasks/responsibilities:  Support the commercial decisions of the traders through the provision of timely analysis and market monitoring. Perform research into various aspects of the European Energy markets Analyse business requirements (tools and systems) and provide ideas to solutions that add value to the bottom line. What we look for:  Very strong numerical, logical reasoning and analytical skills. A in A level Mathematics. Must have studied Mathematics at A level. * Strong commercial acumen Resilience and a determination to succeed Independent thinkers with growth mindset Programming (e.g. Python, Java, C++) skills are desirable but not mandatory. Must be self-motivated and able to learn quickly. Our hiring processes After your application been added to our pipeline and evaluated, you will be invited to do an online psychometric assessment that will evaluate your numerical ability.Upon successful completion of these, you will be invited for a series of interviews with members of both our HR and commercial team.Before full time admission onto our Commercial Development Programme (CDP), all finalist candidates are invited to attend a two-week Cobblestone Training Programme (CTP). CTPs are carried out at either our main Dubai office or our partner location in Kampala. This is determined by our admin depending on where you are located.We shall cater for everything - Flights, accommodation, paper-work and expenses.During the Training Program, you work will on real-life tasks and situations with other members of the commercial and technical team. The goal is to enable you to learn as much as possible within the period while giving you the opportunity to shine in an area tailored to your strengths. You are also evaluated for cultural fit, aptitude, and your ability to work with others.Following this, you will then be offered a full-time role on the CDP.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/junior-trader-analyst-dubai-uae-at-cobblestone-energy-2228651148?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "TECHNICAL COORDINATOR- DISASTER RISK REDUCTION AND RESILIENCE",
        "company": "Oxfam",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGxggEAfTho3A/company-logo_100_100/0?e=1611792000&v=beta&t=CGBzgNgRA2hnnp5VqlyYpxLviOoe1tzcPyVQmOtQhCU",
        "address": "Pokhara, Gandakī, Nepal",
        "desc": "TECHNICAL COORDINATOR- DISASTER RISK REDUCTION AND RESILIENCE\"Applicable for Nepali Nationals only\"Level: D1Duration: One-year fixed term contract with possibility of extensionLocation: Kathmandu or one of the project districtsThe RoleTechnical Coordinator- Disaster Risk Reduction and Resilience is responsible for facilitating the project, \"Strengthening Community Preparedness, Rapid Response and Recovery in Nepal\" in Kanchanpur and Dadeldhura districts. As a technical coordinator, the post holder will be overall responsible for project management and providing technical support to the project, financial and budget management, project administration, Monitoring Evaluation, Accountability and Learning (MEAL), partnership management and all matters relating to the project implementation in Nepal. This position is also responsible for coordination and relation building with stakeholders of the project and enhancing technical and managerial capacities of the partner NGOs for disaster risk reduction and resilience.What We Are Looking ForTechnical Coordinator- Disaster Risk Reduction and Resilience will require to be exceptional, dedicated, and highly motivated professional, with a strong commitment to Oxfam's values and beliefs with the following qualification and competencies: Bachelor’s Degree in disaster risk reduction, climate change, natural resource management, social sciences or development studies. Master’s degree in relevant field is desirable.  Hands on programme management experience and technical knowledge with at least 5 years’ experience (strategy development, project cycle management, HR and Financial Management, online MIS, and the use of excel) in disaster management and climate change Gender, feminist and rights-based programming.  Proven track record in achieving objectives We offerThis role will provide you with an opportunity to make a difference in Oxfam by working closely with a group of passionate people that are specialists in their field of Gender, WASH and Water Governance, Resilience and Climate Justice and so forth along with the national and international training and development opportunities. Our offer consists of fair pay and competitive benefits package.Our values and commitment to safeguardingOxfam is committed to preventing any type of unwanted behaviour at work including sexual harassment, exploitation and abuse, lack of integrity and financial misconduct; and committed to promoting the welfare of children, young people, adults and beneficiaries with whom Oxfam GB engages. Oxfam expects all staff and volunteers to share this commitment through our code of conduct. We place a high priority on ensuring that only those who share and demonstrate our values are recruited to work for us.The post holder will undertake the appropriate level of training and is responsible for ensuring that they understand and work within the safeguarding policies of the organization.All offers of employment will be subject to satisfactory references and appropriate screening checks, which can include criminal records and terrorism finance checks. Oxfam GB also participates in the Inter Agency Misconduct Disclosure Scheme . In line with this Scheme, we will request information from job applicants’ previous employers about any findings of sexual exploitation, sexual abuse and/or sexual harassment during employment, or incidents under investigation when the applicant left employment. By submitting an application, the job applicant confirms his/her understanding of these recruitment procedures.We are committed to ensuring diversity and gender equality within our organisation and encourage applicants from diverse backgrounds to apply.If this sounds like you, please go to the link: https://jobs.oxfam.org.uk/vacancy/13083/descriptionApplication for the above position can be sent by 31 October 2020, Saturday.** If you would like to learn more about this role, please refer to job profile.About UsOxfam is a global community who believe poverty isn’t inevitable. It’s an injustice that can be overcome. We are shop volunteers, women’s right activists, marathon runners, aid workers, coffee farmers, street fundraisers, goat herders, policy experts, campaigners, water engineers and more. And we won’t stop until everyone can live life without poverty for good.Oxfam GB is a member of international confederation of 19 organisations working together with partners and local communities in the areas of humanitarian, development and campaigning, in more than 90 countries.",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-coordinator-disaster-risk-reduction-and-resilience-at-oxfam-2224055924?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Evaluation Lead- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611792000&v=beta&t=lM9XGqOLETlXwHgxf6k0DDvvYZheFuA2Qmip42zPgt8",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks an Evaluation Lead for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes.This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming. This position will be full-time and based in Nepal.Responsibilities Work with the Contracting Officer’s Representative (COR) and other USAID technical staff to develop the necessary methodologies to meet the deliverables required in the SOWs for evaluation tasks.  Manage the subcontractors to assure performance to task requirements and timelines and development of quality deliverables.  Provide technical and editorial feedback on internal and external deliverables for studies.  Provide technical inputs in designing surveys, assessments, and evaluations (performance and impact)  Oversee conduct of evaluations, studies, assessments, and surveys to assess the status and impact of USAID s activities  Document lessons from evaluations and incorporated in the MEL Activity s progress reports.  Foster knowledge sharing and disseminate evaluation findings and lessons to increase awareness and knowledge.  Supervise monitoring and evaluation staff.  Liaise with Mission staff, Implementing Partners, Government of Nepal and NGO stakeholders. Qualifications A Master’s degree in a field relevant to monitoring and evaluation or international development (e. g., economics, public policy, international relations, statistics, political science, health, education, agriculture, etc.).  At least 10 years of experience working in monitoring and evaluation of international development programs  At least 3 years of experience serving as the team lead for evaluations  Experience guiding recruitment and hiring of consultants related to M&E work.  Experience leading the development of evaluation scopes of work (SOWs)  Significant experience in qualitative and/or quantitative analysis, data collection, and reporting  Knowledge of USAID evaluation policies and regulations.  Excellent oral and written communication in English and Nepali; and  Strong interpersonal skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Entry level",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/evaluation-lead-nepal-at-social-solutions-international-inc-2176224191?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Head of External Relations",
        "company": "UN World Food Programme WFP",
        "logo": "",
        "address": "Pokhara, Gandakī, Nepal",
        "desc": "WFP seeks candidates of the highest integrity and professionalism who share our humanitarian principles. Selection of staff is made on a competitive basis, and we are committed to promoting diversity and gender balance.About WfpThe United Nations World Food Programme is the world's largest humanitarian agency fighting hunger worldwide. The mission of WFP is to help the world achieve Zero Hunger in our lifetimes. Every day, WFP works worldwide to ensure that no child goes to bed hungry and that the poorest and most vulnerable, particularly women and children, can access the nutritious food they need.ORGANIZATIONAL CONTEXTThese jobs are found in Headquarters (HQ), Regional Bureaux (RBs) and Country Offices (COs). Job holders in HQ typically report to the Division Director or the designate. Job holders in the field typically report to the Regional/Country Director or the designate.JOB PURPOSEGuided by the Corporate Partnership Strategy, to manage effective relationships and collaboration with external partners in order to meet WFP strategic objectives. To represent WFP externally to safeguard and promote WFP interests. To ensure a flow of relevant information between WFP and partners, and propose opportunities for synergies that maximise results.BACKGROUNDNepal Country Office (CO) requires a Partnerships Officer to act as the Head of Unit of the Partnerships, Reports and Communications functions. The Partnerships Officer will lead and manage the Partnerships, Reports & Communications/External Relations Unit, develop and implement the CO Resource Mobilization Strategy and its related action plan for the Nepal Country Office’s Country Strategic Plan 2019-2023 (CSP), and will drive the Resource Mobilization efforts of the CO to ensure the maximum possible funding is secured to implement operations.TERMS AND CONDITIONSFunctional AreaPartnerships, Reports and CommunicationsPosition TitleHead of External RelationsType Of ContractInternational Consultant (Regular)Duty StationKathmandu, NepalDuration11 months from entry on duty (Renewable)KEY ACCOUNTABILITIES (not all-inclusive)OverallAs the Head of the Partnerships, Reports and Communications/ External Relations Unit the consultant will directly report to the Country Director and will support the CO in the following ways: Lead and manage the Partnerships, Reports & Communications functions.   Plan and supervise the work of the team to ensure that tasks are accomplished in a manner consistent with organizational requirements, ensuring strong team dynamics and a productive working environment.   Act as a member of the Senior Management team providing advice, guidance and support to all Strategic Outcome leads, Activity Managers and others on the three areas of Partnerships, Reports and Communications.   Provide other relevant support as assigned by the Country Director. Specific Partnerships Accountabilities In consultation with all relevant stakeholders, further develop the CO Resource Mobilization Strategy with a focus on raising funds to implement the programmes stipulated in the CSP; Ensure the related Action Plan is aligned to the Strategy with specific actions for raising funds for each Strategic Objective / Activity of the CSP; Implement the Action Plan in order to ensure timely and cost effective delivery of results.   Lead the Resource Mobilisation efforts for the CO; Research and identify opportunities for funding in existing and new funding mechanisms (local and international) for WFP’s work in the CSP with specific recommendations for strategic relationship-building; Draft comprehensive project proposals to raise funds for CSP activities in line with the identified opportunities and the Resource Mobilization Strategy; Build and maintain effective relationships with member states, UN agencies, NGOs, host government and other partners, in order to keep them informed on important, strategic operational WFP issues, advising them on the strategy, design, and impact of programmes to advocate the work of WFP, and by developing information programmes to increase WFP’s profile.   Identify opportunities to develop new and existing synergies with other emerging stakeholders, especially new donors, and make suggestions to the Country Director in order to support more effective and efficient food security solutions in Nepal.   Prepare briefing documents for Senior Management meetings with government and donors.   Draft a standard operating procedures for the CO relating to the Resource Mobilization Strategy implementation.  Specific Reports and Communications accountabilities, in support to the Reports Officer (NOA) and to the Communications Officer (NOA): The Terms of Reference of both posts that report to the Head of Unit detail the specific accountabilities. Deliverables At The End Of The ContractProposals are prepared as requiredSOP for Resouce Mobilization Strategy draftedIncreased donor visibility and communication4Ps CORE ORGANISATIONAL CAPABILITIESPurpose  Understand and communicate the Strategic Objectives: Utilizes understanding of WFP’s Strategic Objectives to communicate linkages to team objectives and work.  Be a force for positive change: Proactively identifies and develops new methods or improvements for self and immediate team to address work challenges within own work area.  Make the mission inspiring to our team: Identifies opportunities to further align individual contributions with WFP’s mission of making an impact on local communities.  Make our mission visible in everyday actions: Helps colleagues to see the link between their individual tasks and the contributions of their unit’s goals to the broader context of WFP’s mission. People  Look for ways to strengthen people's skills: Is able to identify, support and encourage focused on-the-job learning opportunities to address gaps between current skillsets and needed future skillsets for WFP.  Create an inclusive culture: Recognizes the contributions of teammates, and encourages contributions from culturally different team mates to recognise the value of diversity above and beyond just including it in programming for beneficiaries.  Be a coach & provide constructive feedback: Provides and solicits ongoing constructive feedback on strengths and development opportunities to help develop individual skills, whilst also helping others identify areas for improvement.  Create an “I will”/”We will” spirit: Sets clear targets for self and others to focus team efforts in ambiguous situations (e.g., unprecedented issues and/or scenarios). Performance  Encourage innovation & creative solutions: Thinks beyond team’s conventional approaches to formulate creative methods for delivering food aid and assistance to beneficiaries.  Focus on getting results: Maintains focus on achieving individual results in the face of obstacles such as volatile or fragile environments and/or organizational roadblocks.  Make commitments and make good on commitments: Takes personal accountability for upholding and delivering upon team’s commitments and provides assurance to stakeholders.  Be Decisive: Demonstrates ability to adjust to team’s plans and priorities to optimize outcomes in light of evolving directives, while also responding quickly in high-pressure environments, such as in emergency settings. Partnership Connect and share across WFP units: Demonstrates an understanding of when and how to tactfully engage other units in conversations on impact, timing, or planning.  Build strong external partnerships: Networks regularly with key external partners using formal and informal opportunities to understand each partner’s unique value proposition, and to build and strengthen relationships.  Be politically agile & adaptable: Demonstrates ability to adapt engagement approach in the context of evolving partner circumstances and expectations.  Be clear about the value WFP brings to partnerships: Demonstrates ability to articulate to internal and external audiences the value that individual contributions and immediate teams bring to partnerships. FUNCTIONAL CAPABILITIESCapability Name Description of the behaviour expected for the proficiency levelRelationship Management  Demonstrates ability to formulate and maintain strong relationships and develop networks with appropriate stakeholders. Leads in implementing identified strategy to raise the profile of WFP, build relationships and further organisational aims.Communication Expertise  Facilitates and contributes to open verbal or written communication with stakeholders as required (i.e. through preparation of targeted written or visual communications materials, presentations, and official documentation) to convey tailored messages. Engages in mutually informative discussion with partners and influencers.Information Analytics, Reporting and Management Gathers, analyses and reports information in a manner that draws out fact-based insights to inform approach to partner relationships and support substantive discussion with partners. Captures relevant information and progress, and ensures internal information sharing.Sociopolitical Contextual Understanding Shows good understanding of the multilateral/interagency environment and the dynamics in which WFP operates to formulate recommendations to management which will inform decision making.NGO, UN and Other Partner Collaboration Guides interpretation of WFP’s partnering approach. Contributes to the determination of engagement strategies that inform WFP’s relationships with specific partners. Analyses and identifies new synergies with existing partners and explores new partnership opportunities.Standard Minimum QualificationsEducation: Advanced university degree in Political Science, International Development, Development Economics, Journalism, International Relations, Communications or other relevant field, or First University degree with additional years of related work experience and/or training/courses.Language: International Professional: Fluency (level C) in English language. Intermediate knowledge (level B) of a second official UN language: Arabic, Chinese, French, Russian, Spanish, and/or WFP’s working language, Portuguese.Desired Experiences For Entry Into The RoleHas contributed to the implementation of the work plan for assigned area.Has maintained effective relationships with member states, UN agencies, NGOs, host government and other partners.Has guided and supervised more junior staff, supporting them with more complex analysis and queries.Knoweldge And SkillsSpecialised knowledge of information management best practices, techniques and processes with some understanding of the basic theoretical background.Strong written and oral communication skills, including substantive analysis and report writing skills.Able to supervise and support more junior and/or less experienced members of the team.Knowledge of, or the ability to quickly assimilate, UN/WFP specific processes and systems.DEADLINE FOR APPLICATIONSTuesday, 03 November 2020 Only short-listed candidates will be contacted.Female applicants and qualified applicants from developing countries are especially encouraged to applyWFP has zero tolerance for discrimination and does not discriminate on the basis of HIV/AIDS status.No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/head-of-external-relations-at-un-world-food-programme-wfp-2236840939?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Chief of Party",
        "company": "",
        "logo": "",
        "address": "Pokhara, Gandakī, Nepal",
        "desc": "At the heart of Pact is the promise of a better tomorrow. A nonprofit international development organization founded in 1971, Pact works on the ground in nearly 40 countries to improve the lives of those who are challenged by poverty and marginalization. We serve these communities because we envision a world where everyone owns their future. To do this, we build systemic solutions in partnership with local organizations, businesses, and governments that create sustainable and resilient communities where those we serve are heard, capable, and vibrant. Pact is a recognized global leader in international development. Our staff have a range of expertise in areas including public health, capacity development, governance and civil society, natural resource management, poverty, fragile states, monitoring and evaluation, small-scale and artisanal mining, microfinance and more. This expertise is combined in Pact’s unique integrated approach, which focuses on systemic changes needed to improve people’s lives.DepartmentProgram Delivery (PDEL) - Pact exists to help create a world where those who are poor and marginalized exercise their voice, build their own solutions, and take ownership of their future. The Program Delivery Team, contributes to realizing this purpose by: Forging smart partnerships and treating all people with dignity and respect; Applying organizational policies and regulatory compliance appropriately and consistently; Facilitating team spirit among colleagues and promoting the organization through communications; Influencing decision makers through focused, relevant communications; Continually striving to learn and share knowledge and find small ways to make the workplace more enjoyable for all; Cultivating and harvesting innovation; Contributing to the organization’s ability to think and act strategically at all times; Inspiring and spreading our desired organizational culture across the global enterprise.Position OverviewPact is recruiting for a Chief of Party (COP) for an upcoming project based in Nepal. The COP will be responsible for technical leadership and the overall management and operations of the USAID Civil Society and Media (CSM) Activity. She/he will supervise high-quality project implementation, with a focus on achieving the project goals and USAID/Nepal development objectives. The COP will take a leadership role in coordination of all activities across all relevant parties including: USAID, the Government of Nepal (GoN), key stakeholders, and implementing partners. She/he will also oversee all project staff and sub-partners for results-oriented planning, leadership, and coordination of project activities. This position is contingent upon award.Key Responsibilities Ensure high-quality, results-oriented technical programming through hands-on guidance and support grounded in the project’s strategic objectives and approved annual workplans. Serve as key representative to USAID, responsible for all communications with USAID officials. Act as liaison to and ensure effective relationships with the GoN, national policy actors, project sub-partners, other relevant donors and key stakeholders. Ensure a highly adaptive, systems-driven approach to promoting innovative and sustainable approaches to strengthening civil society and media, and promoting civic engagement. Ensure the provision of training and mentoring to partners to strengthen the capacity of civil society and media partners, and ensure their compliance with donor rules and regulations. Develop and implement a strategy for supporting local and national civil society partners to positively influence democratic and reforms at the local, provincial, and national levels. Develop and implement innovative approaches to promoting collaboration and engagement across the civil society, media, and private sectors. Lead all project planning responsibilities, including the production of annual workplans and budgets and performance monitoring plans, ensuring alignment of the budget to expected results and cost-effective use of resources. Review and approve annual budgets and progress reports, ensuring they are completed and submitted in a timely manner. Ensure compliance with USAID and Pact requirements, policies, and regulations. Oversee all local grantmaking mechanisms, ensuring compliance with USAID regulations and Pact policies; coordinate and/or conduct monitoring visits to grantee programs. Oversee integration of gender and social inclusion (GESI) considerations across all aspects of program planning, implementation, monitoring and evaluation, and learning and management. Recruit and directly supervise local and international project staff in line with Pact policies; oversee the management and development of project office human resources to ensure a diverse, skilled, and productive workforce, an effective leadership team, and an organizational culture where Pact’s values are practiced. Basic Requirements Master's or bachelor's degree in a relevant field such as social sciences, law, or development studies. A minimum of ten (10) years’ experience in the implementation of international development programs, with preference given to democracy and governance activities, human rights. A minimum of five (5) years’ experience in senior management positions, including direct supervision of professional and support staff. In-depth understanding of the role of civil society and media in development Experience building capacity for civil society organizations and networks/coalition strengthening in Nepal. Experience implementing complex and politically sensitive international development programs. Experience with GESI mainstreaming approaches. Expertise in advocacy, accountability, research, media campaigns. Experience establishing and maintaining productive working relationships with a wide network of partners and stakeholders, including international organizations, NGO partners, government institutions, private sector entities, and donor community. Demonstrated knowledge of and experience with working with USAID. Excellent interpersonal, writing, and oral presentation skills in English. Preferred Qualifications Experience managing highly adaptive programs, as well as applying systems-driven approaches and/or thinking and working politically principles. Fluency in Nepali. Experience managing USAID contracts. Nepali nationals are encouraged to apply. Pact is an equal opportunity employer and does not discriminate in its selection and employment practices on the basis of race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity or expression, marital status, disability, genetic information, age, citizenship status, genetic information, matriculation, family responsibilities, personal appearance, credit information, tobacco use (except in the workplace), membership in an employee organization, or other protected classifications or non-merit factors.Please click  here  to apply for this position.",
        "level": "Executive",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/chief-of-party-at-pact-world-2216388476?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer - Front End Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611792000&v=beta&t=KGu2l_RB1I-TbIG2STQFHP9O3LGCYfE4ecUmIEgtj4g",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionResponsibilities -  Make design and technical decisions for Angular projects Perform unit testing by using different frameworks like Jasmine, Karma Be involved in all phases of the agile software development lifecycle Proactively seek out and minimize pain points within the infrastructure and code base Keep up to date with the latest technologies and introduce them as needed Create next-gen solutions for unique and challenging use cases Communicate proactively with Business stakeholders and provide design suggestions Analyze, debug and fix defects QualificationsEducation Level: Bachelor’s in Computer Science, or related field or equivalent experienceExperience Required: At least 3 years of professional experience in JavaScript / Angular TechnologySkills And Knowledge - Passion for programming in general, rather than a specific language Be focused, passionate, and strive to find simple solutions to complex problems Ability to learn new, emerging technologies You have a solid general understanding of application components, what happens on the front end, what happens on the back end. You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the above Ability to effectively work on multiple projects simultaneously and effectively contend with competing priorities Possess strong troubleshooting, code optimization and refactoring skills Have strong sense of ownership with demonstrated ability to work independently without supervisionTechnical Expertise JavaScript frameworks (Angular 4+ - preferably the latest verison, AngularJS, React, jQuery), RxJs, Redux, Web markup languages (HTML/HTML5, XML) and Style sheet language (CSS/CSS3), SASS, LESS Well versed in using UX and UI design tools like Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe XD Experience in working with using html frameworks like Bootstrap and Foundation Writing tested and documented JavaScript with Expertise in build processes (Angular CLI, Webpack) Experienced in writing test cases and performing unit testing using frameworks (ex. Jasmine, Karma) Used DevOps and CI/CD in previous work experience Developed software in SCRUM environment using Agile methodologies and involved in SDLC processAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-front-end-developer-at-verisk-2223227992?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Associate Director, Technical, CSM, Nepal",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611792000&v=beta&t=oLqLhAfEaWKmwDruaZYCf2t5Rf0ZQRHLOXlT-hmNXJk",
        "address": "Bāgmatī, Nepal",
        "desc": "Technical DirectorCivil Society and Media Project (CSM), NepalFHI 360, an international non-governmental organization (NGO), is recruiting a highly qualified and dynamic candidate for the expected United States Agency for International Development (USAID)-funded Civil Society and Media Project (CSM) in Nepal as Technical Director.  The Technical Director will provide GESI-related guidance to CSM as part of the Senior Management Team (90%), while also providing technical assistance to other civil society projects in the Asia Pacific region (approximately 10%).Position Description:The Senior Management Team for CSM-Nepal consists of the Chief of Party, the Deputy Chief of Party, the Technical Director, and the Director of Finance and Administration.  The Technical Director position will also report to the Asia Pacific Regional Office on an as-needed basis when technical assistance is required on other projects.  This arrangement ensures that CSM benefits from strong technical support in Nepal and can benefit from lessons learned from other FHI 360 projects in the region.  This also provides an opportunity for CSM to share its experience more widely through networks of experts in FHI 360 and beyond.Within the CSM project, the central role of the Technical Director is to ensure a sustained focus on GESI-related issues both with regard to patterns of civic engagement, sustainable leadership processes and in assessing and supporting related law, policy and public service practice. The Technical Director will oversee cross-cutting technical activities that increase the capacity of civil society and media to engage with government at all levels, promote local government accountability and decreased tolerance for corruption, and advocate for policies that address inequality and support inclusive democratic participation. The Technical Director will be responsible for providing technical leadership to design activities that increase the participation of women, ethnic minorities, and other marginalized groups.  The Technical Director will  support CSO efforts to be more inclusive and promote the leadership of women and minorities in public life.  She/he will lead a team that improves the organizational capacity of CSOs to operate more effectively and improve their reputational standing in the communities where they work.  The Technical Director will also oversee the project’s monitoring and evaluation and legal analysis team.  Availability of position is contingent upon award to FHI 360.Key responsibilities:Assist the COP and DCOP with strategic and operational planning, including work planningLead development of cross-cutting strategies to incorporate gender and social inclusion (GESI) in CSM activitiesSupport partner CSOs to improve GESI integration into the organizations’ mission and activitiesOversee design of technical activities in civil society capacity building and monitoring evaluationOversee staff and partners that legal analysis and policy review for CSM activitiesConduct performance assessments of direct supervisees, identifying and recommending areas for improvement and opportunities for professional developmentMentor and manage staff in a respectful and transparent manner, working with local staff to build their technical and administrative capacityQualifications:At least 8-10 years senior level experience in civil society, governance, organizational capacity building, advocacy, rule of law, or other related democracy, rights, and governance sectors;At least five years of experience in gender and social inclusion;Demonstrated ability to think strategically and navigate politically sensitive terrain;Familiarity with USAID programming, including rules and regulations required;Professional proficiency in English required, including excellent written communication skills;Experience building CSO capacity;Experience with designing and drafting CSO related legislation; andKnowledge of the Nepal legal context, especially related to civil society.This job posting summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 fosters the strength and health of its workforce through a competitive benefits package, professional development and policies and programs that support a healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself. Please click here to continue searching FHI 360's Career Portal. About Us FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in health, education, nutrition, environment, economic development, civil society, gender, youth, research, technology, communication and social marketing — creating a unique mix of capabilities to address today's interrelated development challenges. FHI 360 serves more than 60 countries and all U.S. states and territories.As we evolve to meet the challenges of the future, we stand committed to the principles that have guided our organization for the last 40+ years. Our work continues to be grounded in research and science, strengthened by partnerships and focused on building the capacity of individuals, communities and countries to succeed.FHI 360 is an equal opportunity and affirmative action employer whereby we do not engage in practices that discriminate against any person employed or seeking employment based on race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, marital status, physical or mental disability, protected Veteran status, or any other characteristic protected under applicable law.FHI 360 will never ask you for your career site username or password, and we will never request money, goods or services during the application, recruitment or employment process. If you have questions or concerns about correspondence from us, please email CareerCenterSupport@fhi360.org.",
        "level": "Director",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/associate-director-technical-csm-nepal-at-fhi-360-2173706271?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Finance and Administration Director- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611792000&v=beta&t=lM9XGqOLETlXwHgxf6k0DDvvYZheFuA2Qmip42zPgt8",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International, Inc. seeks a Finance and Administration Director for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The Finance and Administration Director will manage the financial operations and reporting of the contract, will oversee and execute sub-contracts with local organizations, and will provide direct administrative functions of the project. This position will be full-time and based in Nepal.Responsibilities Responsible for the financial management, accounting, and financial reporting of the project;  Establish and oversee internal control systems as well as accounting and financial reporting protocols;  Support the COP and DCOP in liaising with home office (US-based) staff on project matters;  Draft, execute, and ensure compliance on sub-contracts developed with local partners in Nepal;  Oversee payroll procedures for national staff, administer payroll, and monitor employee time keeping;  Work with home office staff to develop and implement office administrative and personnel systems;  Supervise finance, HR, and administrative for the project;  Maintain financial files and support annual audits; and  Perform other duties as assigned. Qualifications Bachelor’s Degree (minimum), or a Master’s Degree (desirable), in Finance, accounting, economics, or relevant field.  At least 8 years of professional experience managing project operations, financial and contractual aspects of international development projects. Experience on USAID-funded projects required.  Strong analytical and computer skills, including significant experience with excel and accounting packages.  Experience creating Financial reports  Proven leadership, management, communication and interpersonal skills.  Experience working in Nepal or in the region is highly preferred.  English language fluency required, with excellent written and oral communications skills.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Contract",
        "Page_URL": "https://np.linkedin.com/jobs/view/finance-and-administration-director-nepal-at-social-solutions-international-inc-1995105325?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Programme Policy Officer (Fair Price Shops, FMTC)",
        "company": "UN World Food Programme WFP",
        "logo": "",
        "address": "Pokhara, Gandakī, Nepal",
        "desc": "HEADER\"Qualified FEMALEs are preferred and encouraged to apply.\"WFP seeks candidates of the highest integrity and professionalism who share our humanitarian principles. Selection of staff is made on a competitive basis, and we are committed to promoting diversity and gender balance.About WfpThe United Nations World Food Programme is the world's largest humanitarian agency fighting hunger worldwide. The mission of WFP is to help the world achieve Zero Hunger in our lifetimes. Every day, WFP works worldwide to ensure that no child goes to bed hungry and that the poorest and most vulnerable, particularly women and children, can access the nutritious food they need . We are currently seeking to fill the position of a Programme Policy Officer with our Programme Unit based in Nepal Country Office, Kathmandu, Nepal.ORGANIZATIONAL CONTEXTThe Programme Policy Officer is a temporary position based at the Sales Department of the FMTC, Kathmandu. The job holder will be a member of the WFP nutrition team but will be seconded to work at the FMTC head office. The incumbent reports primarily to FMTC head of the Sales Department and the WFP Nutrition Advisor, with a reporting line to the WFP Supply Chain, Programme and EPI unit to coordinate related implementation activities. The job holder is responsible to assist FMTC with the accelerated roll out of Fair Price shops outside Kathmandu in support of population affected by the COVID-19 emergency, assist with related capacity strengthening of local government and fair price shop owners, food supply and distribution, monitoring & evaluation, targeting of beneficiaries, consumer protection and related reporting. He/she is also expected to support and advocate for private sector’s engagement on nutrition. These jobs are found in Headquarters (HQ), Regional Bureaux (RBs) or Country Offices (COs) and job holders report to a more senior Programme Policy Officer.Job holders are likely to be working under the close support and guidance of a more experienced professional staff member receiving guidance and regular feedback on work performed. They are typically involved in programme or policy activities or similar nature and analytical work of limited complexity.BACKGROUNDWorking in Nepal since 1963, WFP has extensive knowledge of the Nepal context as related to food and nutrition security, livelihood creation as well as logistics capacity and emergency response. At present, WFP Nepal operates across the country with tailored programming based on present and predicted needs. Being a well-trusted UN partner, WFP is uniquely well-placed to support the Government, as well as local communities to tackle the underlying factors causing hunger, to build self-reliance and improve food security. One of the programme WFP is supporting in Nepal in the initiation and scaling up of rice fortification initiative. Accordingly, in 2019 WFP and four government organizations; namely Ministry of Health and Population (MOHP), Ministry of Industry, Commerce and Supplies (MOICS), Department of Food Technology and Quality Control (DFTQC), and Food Management and Trading Company (FMTC) signed a Memorandum of Understanding (MoU) to implement a three-year plan of action (POA) to implement rice fortification in Nepal.The programme envisages to distribute fortified rice through FMTC in targeted remote and food insecure districts under an existing social safety net program. Since FMTC was tasked in April 2020 by the government to increase food distribution to population affected by COVID-19, WFP provided three months technical assistance, to develop an operational guideline for implementation of Fair Price Shops (FPS): Private sales outlets that are authorized to sell FMTC subsidized food commodities. The FPS guideline was developed based on the requirements in the Right to Food and Food Sovereignty Act 2075, which ensures the fundamental rights of citizens of Nepal to food, food security and food sovereignty.In order to implement the FPS guideline FMTC will be joining SUN Business Network (SBN) to receive technical assistance on training. The SBN is a dedicated global platform for business and nutrition, with the aim to reduce malnutrition in all its forms – through engaging and supporting business to act, invest and innovate in responsible and sustainable actions and operations to improve nutrition. It is the private sector branch of Scaling Up Nutrition (SUN) movement which aims to engage businesses within a multi-stakeholder, country-owned approach, to scaling up nutrition. Therefore, with the purpose of supporting the endorsement and implementation of the Fair Price Shop guideline, to orientate government and fair price show owners and support FMTC to establish fair price shops during a trial phase, WFP is looking for the services of a qualified and experienced Programme Policy Officer.JOB PURPOSETo provide support to FMTC to establish 14 Fair Price shops in food insecure districts of Province 5, Karnali and Sudurpaschim province, assist with related training design, capacity strengthening, food supply, monitoring & evaluation, targeting of beneficiaries, analysis and related reporting.TERMS AND CONDITIONSFunctional Area: Programme/Nutrition (SO 2, Activity 4)Position Title: Programme Policy Officer (Fair Price Shops, FMTC)Type of Contract: Special Service Agreement (SSA)Grade: SSA-8 (Equivalent to NO-A)Duty Station: Based in FMTC Office, Kathmandu, NepalDuration: 6 months ( with possibility of extension )Nationality: Nepalese ONLYKEY ACCOUNTABILITIES (not all-inclusive)Under The Overall Guidance Of The WFP Country Director, And Direct Supervision Of The Head Of Nutrition (Nutrition Advisor) With Matrix Relation To Head Of Supply Chain And Head Of EPI , The Job Holder Will Carry Out The Following Tasks  Support FMTC to implement trial phase 1, to establish 14 Fair Price Shops as per the guidelines for the operation of Fair Price Shops.  Contribute towards the development and implementation to establish 14 fair price shops, plans and processes, ensuring alignment with wider programme policies and guidance.   Provide project management support to FMTC to establish 14 fair price shops, ensuring a coordinated approach with wider programmes that complies with FMTC and WFP standards and procedures.   Implement FPS data gathering and monitoring system to ensure rigorous quality standards are maintained.   Contribute to the preparation of accurate and timely reporting on programmes and activities that enable informed decision making and consistency of information presented to stakeholders.   Follow emergency preparedness practices to ensure WFP and FMTC can quickly respond and deploy food and/or needed resources to affected areas at the onset of a crisis.   Document lessons and feedback on the operational guideline, and recommend, as needed, components of the operational guideline to be updated in the future.   Expected outputs:  Workplan and budget for Phase 1 and 2 implementation of fair price shops;   FMTC contract agreements with 14 fair price shop business owners;   Micro financing options sourced & used for FPS startup and procurement of stock;   Quotas and margins for FPS’s agreed and endorsed;   Food commodity order, supply and payment system to FPS’s established;   Standard, accurate and timely FPS reporting system established;   Priority household targeting mechanism agreed with local authorities;   FPS M&E committees & grievance redressal mechanism established;   FPS inspection & monitoring system established, and regular inspections conducted;   Evaluation report of phase 1 implementation of FPS’s.     Capacity strengthening of Government Provincial, District and municipal administration, FMTC staff and fair price shop owners in, supply, operation and M&E of the Fair Price Shops.   Support the capacity building of FTMC staff, partners and national government to prepare for and implement fair price shops to respond to food assistance needs, e.g. through project management support and design of learning & training initiatives.   Provide guidance to support FMTC and WFP field staff, acting as a point of referral and assisting them with analysis and queries.   Expected outputs:  Fair Price Shop guideline endorsed by FMTC, MoICS, printed and published   FPS communication strategy for all stakeholders   Two FPS orientation workshops held   FSP basic training modules designed and 3 training workshops conducted   FSP training for FMTC staff designed and 1 training workshop conducted     Help identify financial and regulatory inputs needed to establish a sustainable system of Fair Price Shops country wide as per the Right to Food Act, regulations & FPS guidelines   Research and analyse policy and operational issues to support senior colleagues in the development of policies, programmes and activities.   Liaise with internal counterparts to ensure effective collaboration, monitor ongoing projects.   Support the identification, development and management of potential partnerships to collaborative working leading to improved food assistance packages.   Expected outputs:  Regular coordination meetings with FTMC, MoICS, MoALD and WFP units.   TOR 3-month consultancy to conduct gap analysis of national regulatory framework.   Consultant hired for 3-months to conduct gap analysis.     Monitoring, evaluation and learning   Support the FMTC team in developing a monitoring system to track distribution of fortified rice and other commodities, as well as address beneficiary complaint mechanism.   Prepare monthly progress report on the implementation of the Fair Price Shops to FMTC and WFP management   Organize joint review meeting among FMTC. WFP and other concerned stakeholders to review on the progress, identify challenges and foster learning.   Collect and report food safety concerns raised by beneficiary and/or stakeholders.   Collaborate with the communication to document and share any promising practices,    Others as required. Standard Minimum QualificationsEducation: Masters/Advanced university degree in business administration, agricultural economics, agribusiness, economics or related field, or First University degree with at least 5 years of relevant work experience and/or trainings/courses.Language: Excellent oral and written proficiency in English and Nepali.4Ps CORE ORGANISATIONAL CAPABILITIESPurpose  Understand and communicate the Strategic Objectives: Understands WFP’s Strategic Objectives and the link to own work objectives. Be a force for positive change: Flexibly adapts individual contributions to accommodate changes in direction from supervisors and internal/external changes (such as evolving needs of beneficiaries, new requirements of partners).  Make the mission inspiring to our team: Recognizes and shares with team members the ways in which individual contributions relate to WFP’s mission.  Make our mission visible in everyday actions: Sets own goals in alignment with WFP’s overall operations, and is able to communicate this link to others. People  Look for ways to strengthen people's skills: Assesses own strengths and weaknesses to increase self-awareness, and includes these in conversations on own developmental needs.  Create an inclusive culture: Participates in open dialogue, and values the diverse opinion of others, regardless of background, culture, experience, or country assignment.  Be a coach & provide constructive feedback: Proactively seeks feedback and coaching to build confidence, and develop and improve individual skills.  Create an “I will”/”We will” spirit: Participates in accomplishing team activities and goals in the face of challenging circumstances. Performance  Encourage innovation & creative solutions: Shows willingness to explore and experiment with new ideas and approaches in own work.  Focus on getting results: Consistently delivers results within individual scope of work on time, on budget and without errors.  Make commitments and make good on commitments: Commits to upholding individual accountabilities and responsibilities in the face of ever-changing country or functional priorities.  Be Decisive: Makes rational decisions about individual activities when faced with uncertain circumstances, including in times of ambiguity regarding information or manager direction. Partnership  Connect and share across WFP units: Seeks to understand and adapt to internal or cross-unit teams’ priorities and preferred working styles.  Build strong external partnerships: Demonstrates ability to understand and appropriately respond to and/or escalate needs of external partners.  Be politically agile & adaptable: Portrays an informed and professional demeanor toward internal and external partners and stakeholders.  Be clear about the value WFP brings to partnerships: Provides operational support on analyses and assessments that quantifies and demonstrates WFP’s unique value as a partner. FUNCTIONAL CAPABILITIESCapability Name  Description of the behaviour expected for the proficiency levelProgramme Lifecycle & Food Assistance  Demonstrates ability to identify key variables and contextual factors that affect food assistance problems and programmes throughout the lifecycle to inform quality programme design or re-design.Transfer Modalities (Food, Cash, Voucher)  Demonstrates ability to analyse and consolidate quantitative and qualitative information from different sources (e.g., market studies) to inform transfer modality selection and programme development.Broad Knowledge of Specialized areas (i.e. Nutrition, VAM, etc.)  Demonstrates the ability to interpret basic data in the context of WFP specialised fields to contribute to technical programme design, implementation and monitoring.Emergency Programming  Displays capacity to provide inputs into the development, implementation and realignment of high quality emergency programmes.Strategic Policy Engagement w/ Government  Develops thorough recommendations using multiple inputs (e.g., government counsel, research, own experience) to strengthen national or subnational entities and government owned food and nutrition security programmes.Technical skills and knowledge  Hands-on experience of complementary food programme implementation for children and other vulnerable groups is an asset;   Experience in rice fortification or the rice milling sector is a plus.   Knowledge of food fortification and food quality and safety standards.   Sound understanding of agribusiness and market related policies, and systems of Nepal;   Good negotiation skills and ability to communicate effectively;    Ability for perform well in cross-disciplinary teams.   Training and experience in utilizing computers and standard software packages and systems, such as MS Office;   General knowledge of UN system policies, rules, regulations and procedures in the area of work is an advantage.   Nepali Typing skill is an asset;   Driving skills with valid license is an advantage.  Desired Experiences For Entry Into The Role  Three to five years’ experience in agriculture value chain, market linkage, marketing, agribusiness, food systems, and/or digital technologies and relevant programme design/planning and implementation;   Experience in the private or government sector in areas related to food commodity procurement and sales in Nepal is advantageous.   Proven experience in liaising with government partners and providing input into policy discussions and decisions.  DEADLINE FOR APPLICATIONSThursday, 29 October 2020Only shortlisted candidates will be contacted.Female applicants and qualified applicants from developing countries are especially encouraged to applyWFP has zero tolerance for discrimination and does not discriminate on the basis of HIV/AIDS status.No appointment under any kind of contract will be offered to members of the UN Advisory Committee on Administrative and Budgetary Questions (ACABQ), International Civil Service Commission (ICSC), FAO Finance Committee, WFP External Auditor, WFP Audit Committee, Joint Inspection Unit (JIU) and other similar bodies within the United Nations system with oversight responsibilities over WFP, both during their service and within three years of ceasing that service.",
        "level": "Entry level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/programme-policy-officer-fair-price-shops-fmtc-at-un-world-food-programme-wfp-2236848673?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Senior/Principal Engineer - .Net Developer",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611792000&v=beta&t=KGu2l_RB1I-TbIG2STQFHP9O3LGCYfE4ecUmIEgtj4g",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionWhat you get to do every day:Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsPossess strong troubleshooting, code optimization and refactoring skills.Experience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Leadership quality and ability to guide design and technical meetingsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal)QualificationsYou must have demonstrated experience in several of these domains and technologies:Bachelor’s degree in Computer Science, Engineering or a related subjectAt least 4 years full-time work experience in .NET technologiesStrong ability to build RESTful services in C# with .NET/.NET CoreExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Proficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNExperience working on AWS based solutions and knowledge of Microsoft SharePoint Technologies would be a plus.Additional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/senior-principal-engineer-net-developer-at-verisk-2223250208?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "HR Manager- Nepal",
        "company": "Social Solutions International, Inc.",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQE2uQHDVdrecA/company-logo_100_100/0?e=1611792000&v=beta&t=lM9XGqOLETlXwHgxf6k0DDvvYZheFuA2Qmip42zPgt8",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "Social Solutions International, Inc. (Social Solutions), is a Hispanic- and woman-owned consulting firm dedicated to the creation of solutions to improve the health and well-being of underserved populations worldwide. Since 2005, we have worked in more than 70 countries to provide quality monitoring and evaluation; training and technical assistance; program development and implementation; and institutional support services. We are a mission-driven organization and were named the top USAID women-led business partner in 2018.Overview Of The PositionSocial Solutions International Inc. seeks an HR Manager for the anticipated USAID-funded Monitoring, Evaluation, and Learning (Nepal MEL) Activity in Nepal. The Nepal MEL Activity will support USAID/Nepal Mission and is expected to focus on the provision of technical and advisory services in planning, designing, conducting, disseminating, and learning from monitoring and evaluation of the Mission’s portfolios, in order to improve the achievement and sustainability of USAID’s development outcomes. This mechanism will provide the Mission with a set of performance and impact evaluations for varied activities which contribute to the Nepal Country Development Cooperation Strategies (CDCS), thematic regional assessments and studies, and learning activities that have supported Mission programming.The HR manager will lead all HR functions of the project and will be based in Nepal.Responsibilities Lead the full-cycle recruitment process including finalization of job descriptions, advertisement of vacancies, review of applicants, scheduling and conducting interviews alongside project senior management, checking candidate references, and collecting new hire documents;  Onboarding/orientation of new project hires;  Manage employee benefits enrollment;  Coordinate the performance evaluation process;  Provide information and advice to project staff regarding HR policies and procedure.  Coordinate staff training and establish staff development plans based on appraisals and evaluations;  Create and maintain personnel files;  Provide oversight related to the updating of personnel files and other related HR documents including employment agreements, amendments, time sheets, calendar holidays and leaves;  Perform other duties as assigned. Qualifications Bachelor’s degree in human resources, business administration or a related field is required.  At least five (5) years of progressively responsible HR experience.  Excellent communication and interpersonal skills.  Excellent record keeping and documentation skills.  Familiarity with donor/client rules and regulations.  Familiarity with local employment law.  Proficiency with Microsoft Office; and  Verbal and written working proficiency in English and Nepali.  Equal Employer Social Solutions International offers competitive salaries and comprehensive benefits. Please submit your resume online at www.socialsolutions.biz.Social Solutions is an Equal Opportunity/Affirmative Action Employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, disability status, sexual orientation, gender identity or any other characteristic protected by law.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/hr-manager-nepal-at-social-solutions-international-inc-2010750097?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Technical Advisor (Family Planning & Sexual and Reproductive Health Services) USAID Nepal Family Planning",
        "company": "FHI 360",
        "logo": "https://media-exp1.licdn.com/dms/image/C4D0BAQFQ8MzgicjVhQ/company-logo_100_100/0?e=1611792000&v=beta&t=oLqLhAfEaWKmwDruaZYCf2t5Rf0ZQRHLOXlT-hmNXJk",
        "address": "Kathmandu, Bāgmatī, Nepal",
        "desc": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories.We are currently seeking qualified candidates for the position of: Technical Advisor (Family Planning & Sexual and Reproductive Health Services) (FP/SRH)for an anticipated Family Planning Opportunity in Nepal. This position is subject to project award and funding. Position DescriptionThe Technical Advisor (FP/SRH) will contribute to the overall project through strategic planning, evidence generation and dissemination, coordination, and advocacy. S/he will also work with the project team to deliver, document and disseminate results in an effort to improve knowledge management. S/he will be responsible for the oversight and technical direction of service delivery, and community and household-level strategies and interventions to further reduce the unmet need for FP/SRH including adolescent sexual and reproductive health (ASRH) services.S/he will also provide technical support in i mproving access to FP/SRH including ASRH services, in the areas of reaching underserved populations, reaching male and female , adolescent girl and young women coordinating with a social marketing program, expanding community-based FP/SRH services, including contraception, increasing access to SRH information, including comprehensive sexuality education, develop different community outreach strategies, developing innovative approaches to increasing the contraceptive prevalence rate (CPR) identifying the needs of specific target groups such as very young adolescents, young mothers, and vulnerable girls.This position is based in Kathmandu, Nepal, and will report to the Chief of Party.Key ResponsibilitiesLead the team in designing, implementation and management of the FP/SRH including ASRH component project; ensure high-quality program implementation through monitoring and oversight in close coordination with project staff.Provide technical assistance to strengthen the capacity of project staff, partners and other government staff to design and implement quality FP/SRH including ASRH programing using global best practicesProvide technical guidance and strengthen capacity of district health institutions and other implementing partners for the delivery of a range of quality FP/SRH including ASRH services in line with the project guidelines.Work with government and other stakeholders on informing policy, guideline development, as well as advocacy on key health service delivery issues.Ensure technical quality of training activities through facilitative supervision and monitoring; jointly with government and partners, where feasible;Lead all FP/SRH activities of the project in the geographical jurisdiction assigned. The person will coordinate, identify and mobilize stakeholders who will be collaborators in the implementation of activities, oversee activity roll out, implement and sustain knowledge and demand for servicesConduct needs assessments undertaken by the project in the area, including those for training needs, other assessments to be undertaken in the program in regards FP/RH.Establish and maintain effective follow-up and support system for partner agencies on FP/RH components as planned, ensuring performance of all FP/SRH indicators.Strengthen collaboration with the key stakeholders and partners including other USAID-funded projects for shared results through addressing both supply and demand side issues in the overlapping program districts.Represent project at the center and provincial level meetings/workshops among the Government of Nepal (GoN) officials, key stakeholders and partners including USAID partners FP team meetings and FP Sub-Committee, ASRH Sub-Committee meeting and other relevant Technical Working Group meetings led by the Family Welfare Division.Strengthen collaboration with other key players on ASRH, GoN and stakeholders at sub-national levels for improving quality Adolescent Friendly Services from the GoN designated service delivery sites.Minimum RequirementsAt least a master’s degree or bachelor’s degree in Medicine; an additional qualification in Public Health with specialization on SRH, would be advantageous;At least have 5 – 8 years of experience and knowledge of FP/SRH including ASRH especially in the areas of implementation, and managing of public health/international development programs funded by US government or other international donors;Excellent skills in capacity building and experience in conducting trainings of different categories of stakeholders.Knowledge of public health related issues, sensitivity to cultural differences and understanding of the political and ethical issues surrounding public health issues; written and verbal communication skills.Excellent oral and written communication skills in English; knowledge of local language will be an advantage.This job description summarizes the main duties of the job. It neither prescribes nor restricts the exact tasks that may be assigned to carry out these duties. This document should not be construed in any way to represent a contract of employment. Management reserves the right to review and revise this document at any time.FHI 360 fosters the strength and health of its workforce through a competitive benefits package , professional development and policies and programs that support healthy work/life balance. Join our global workforce to make a positive difference for others — and yourself.Please click here to continue searching FHI 360's Career Portal.",
        "level": "Associate",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/technical-advisor-family-planning-sexual-and-reproductive-health-services-usaid-nepal-family-planning-at-fhi-360-2005156503?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    },
    {
        "name": "Software Engineer - .NET /C#",
        "company": "Verisk",
        "logo": "https://media-exp1.licdn.com/dms/image/C560BAQGFqIt9TxkKZQ/company-logo_100_100/0?e=1611792000&v=beta&t=KGu2l_RB1I-TbIG2STQFHP9O3LGCYfE4ecUmIEgtj4g",
        "address": "Lalitpur, Bāgmatī, Nepal",
        "desc": "Company DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions. Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems. At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionVerisk IoT/Telematics, a unit of Verisk Analytics (VRSK), provides a start-up like excitement with the stability of a thriving public company. Verisk’s signature automotive telematics effort is the Verisk Data Exchange, which collects IoT telematics data from connected vehicles and provides advanced analytical solutions to its customers.Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers. You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.What You Get To Do Every DayDesign and develop high-performance software libraries and APIsImplement highly scalable, performant, fault-tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesAnalyze, debug and fix defectsWhat You Bring To The RoleHave strong sense of ownershipBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsExperience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Knowledge of cloud-based applications would be a plusExperience working with large-scale production systems and/or data platformsBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal) QualificationsSkills And QualificationsYou must have demonstrated experience in several of these domains and technologies:BS/MS degree in Computer Science, Engineering or a related subjectAt least 3years full-time work experience with good knowledge of AWS environmentStrong ability to build RESTful services in C# with .NET/.NET CoreProficient in SQL and relational database conceptsExperience working with PostgreSQLStrong understanding of object-oriented programmingFamiliar with various design and architectural patternsKnack for writing clean, readable, and easily maintainable codeUnderstanding of fundamental design principles for building a scalable applicationProficient in implementing automated unit testsProficient understanding of code versioning using GIT/SVNKnowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus point Preferably certified in AWS skillsAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice",
        "level": "Mid-Senior level",
        "time": "Full-time",
        "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-net-c%23-at-verisk-2223250195?refId=046da899-d368-40da-9b8a-fe9594180ba2&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"
    }
]
