[{"name": "Jr. Developer Laravel", "company": "ESC Pvt.Ltd.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-12", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/jr-developer-laravel-at-esc-pvt-ltd-1163890327", "desct": "Jr. Developer LaravelKathmandu, Bāgmatī, NepalApply NowJr. Developer LaravelESC Pvt.Ltd.Kathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJr. Developer LaravelatESC Pvt.Ltd..Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from ESC Pvt.Ltd.Rabin ShresthaDirector at ESCJunior Developer is required for full time.Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEducationTrainingIndustriesInformation Technology and ServicesSearch for more jobs like thisTurn on job alertsJunior Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Software Developer (Remote) - $30,000/year USD", "company": "Crossover for Work", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-27", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-developer-remote-%2430-000-year-usd-at-crossover-for-work-2321318116", "desct": "Software Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, NepalApply NowSoftware Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, Nepal3 hours agoBe among the first 25 applicantsSee who Crossover for Work has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Developer (Remote) - $30,000/year USDatCrossover for Work.Email or phonePasswordShowForgot password?Sign inReport this jobAre you the strongest developer on your team? Are you always getting interrupted from writing your own great code to put out a fire created by one of your less-skilled teammates? Wouldn’t you rather work on a team without these so-called arsonists who introduce bugs due to their carelessness?Yea, we thought so. We are so obsessed with software code quality that we only hire elite developers - the ones that firmly believe in test-driven development and always deliver simple & elegant solutions - and then we teach them our innovative approach to development that produces perfect code. Our results speak for themselves: we ship code every day with less than one-thousandth of a percent of those code changes introducing regressions!In this role, you will focus on re-building essential B2B products and deploying them as true cloud-native applications. This is a unique opportunity to level-up in your software development career, working in a role that demands high-quality code across multiple products at once. We will teach you how to meet our demanding quality standards so you can ship perfect code.Stop wasting your time firefighting the work of the arsonists on your team. If you can meet the requirements below, apply for this role of a lifetime and take your career to the next level.What You Will Be DoingDue to the huge investment we’ve made in tooling and automation, you will focus on more substantive development work only - no time wasted on administrative tasks. All you will do is write production code for several of our hundreds of commercial SaaS products following a TDD methodology.What You Won’t Be DoingGetting spoon-fed easy changes or small parts of complex problems already solved by senior team members.Getting bored being focused on a single, slowly-evolving codebase. In this role you'll learn new codebases and tech stacks week to week.Reviewing someone else's code to find issues and errors.Software Developer Key ResponsibilitiesWe hire the top 1% of engineering talent and place you in a highly specialized role working on multiple products at a time. In this role you will:Write high-quality code every dayCreate elegant solutions to resolve difficult bugsBasic RequirementsTo produce high-quality work in this role you must:Have at least 6 months experience writing production code in Java, JavaScript, C#, or C++. More often than not, developers need 2 years of experience to meet our quality standards but we hire based on skill level, not years of experience.Have a degree in computer science, software engineering, or other technical field OR a minimum of 4 years of software development experience.Possess the ability to ramp up quickly, learning new codebases and technologies every weekAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go towww.crossover.com/testimonialsto read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important!If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply.Crossover Job Code: LJ-3890-NP-Kathmand-SoftwareDevelo.024Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionBusiness DevelopmentEngineeringInformation TechnologyIndustriesBankingElectrical/Electronic ManufacturingFinancial ServicesReferrals increase your chances of interviewing at Crossover for Work by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Java Software Engineer", "company": "Pagoda Labs", "address": "Lalitpur District, Nepal", "deadline": "2020-11-04", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-java-software-engineer-at-pagoda-labs-2273266156", "desct": "Senior Java Software EngineerPagoda LabsLalitpur District, NepalApply NowSenior Java Software EngineerPagoda LabsLalitpur District, Nepal3 weeks agoBe among the first 25 applicantsSee who Pagoda Labs has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Java Software EngineeratPagoda Labs.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Pagoda LabsBijay ShresthaWeb Developer at Pagoda Labs Pvt. Ltd.We are hiring Senior Java Springboot Developer developer to join our team.Experience:2+ yearsCore TechnologyJava (1.8)Spring Boot (1.3.8)Maven (3.0.0)JUnit (4.13)Unix/Linux, Web/Application server like Tomcat or WebSpherePostgres (9.4) / MYSQL / SQL ServerProficient in CSS, HTML, and writing cross-browser compatible code (preferred).Proven experience implementing front-end and back-end JavaScript applications.Significant experience building large-scale, distributed, high-volume systems.You Should Have:A portfolio with live links to sites that you have developed previously (preferred)Object oriented programmingExperience working in an Agile development processThe ability to handle multiple projects and tasks at the same timeGreat attention to detail and be highly organizedA reliable workstation with a fast internet, for calls.The ability to work hours similar to the rest of the Coalition Team (9am-6pm NST)The ability to articulate yourself professionallyExcellent written and spoken English and NepaliThe ability to adapt in a diverse and multicultural environmentA positive and upbeat attitudeYour Duties and Tasks:Work daily in Java, Postgres, JavaScript, JQueryBuild Java web applications and other platformsResolve cross-browser compatibility issuesWrite clean structured and well-documented codeIntegrate data with third party applications and APIs in general and ERP/stock management systemsHow to applyDrop your resume at hello@pagodalabs.comIndustryComputer SoftwareEmployment TypeFull-timeShow moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Pagoda Labs by 2xSee who you knowTurn on job alertsSenior Java Software Engineer in Lalitpur District, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Biratnagar, Koshi Zone, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319775797", "desct": "Senior React Developer – Full-time, RemoteToptalBiratnagar, Koshi Zone, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalBiratnagar, Koshi Zone, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Biratnagar, Koshi Zone, NepalOnOff"}, {"name": "PHP Developer", "company": "Cloudlaya.com LLC", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-25", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/php-developer-at-cloudlaya-com-llc-2304638754", "desct": "PHP DeveloperCloudlaya.com LLCKathmandu, Bāgmatī, NepalApply NowPHP DeveloperCloudlaya.com LLCKathmandu, Bāgmatī, Nepal2 days agoBe among the first 25 applicantsSee who Cloudlaya.com LLC has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePHP DeveloperatCloudlaya.com LLC.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Cloudlaya.com LLCCloudlaya LLCDomain Registration, Cloud Hosting & Email Hosting ServicesMiddle-Level laravel developer specialized in the development of travel platformIntegration of domestic and international flight API, Booking Engine Development, etc.Ongoing project (Project URL) : http://sajilotrip.com/Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer NetworkingReferrals increase your chances of interviewing at Cloudlaya.com LLC by 2xSee who you knowTurn on job alertsPHP Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319772004", "desct": "Senior React Developer – Full-time, RemoteToptalKathmandu, Bāgmatī, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior PHP Programmer", "company": "TekGro", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-24", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-php-programmer-at-tekgro-2298696747", "desct": "Senior PHP ProgrammerTekGroKathmandu, Bāgmatī, NepalApply NowSenior PHP ProgrammerTekGroKathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who TekGro has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior PHP ProgrammeratTekGro.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from TekGroMatrika SahDirector at TekGroTekGro is an Australian based digital marketing and SaaS (Software as a service) company operating since 2008. We are an innovative, high-tech, and versatile company who deliver exceptional 360 digital marketing services to clients throughout the world.Please Clic The Link Below To Learn More About Job :https://www.jobsnepal.com/moodle-developer-php-118821Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at TekGro by 2xSee who you knowTurn on job alertsSenior PHP Programmer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "React Native Developer (Remote)", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/react-native-developer-remote-at-toptal-2319250666", "desct": "React Native Developer (Remote)ToptalKathmandu, Bāgmatī, NepalApply on company websiteReact Native Developer (Remote)ToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveReact Native Developer (Remote)atToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAre you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you'll find remote freelance opportunities with leading global companies, on your terms.Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world's leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won't have to bid against other freelancers and can maintain a steady stream of work. It's the type of work/life balance that empowers you to travel the world, or stay at home. You're in control of shaping your environment to however you work best while establishing yourself as an elite developer.To learn more from Toptalers that made it big through freelancing, check out the following article: https://topt.al/V6cyVZReact Native Developers In Our Elite Network ShareEnglish language proficiency2+ years of professional experienceExperience with React Native is requiredFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.#RemoteJobsReactNativeShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "iOS Developer", "company": "IME Group Nepal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/ios-developer-at-ime-group-nepal-2291608709", "desct": "iOS DeveloperIME Group NepalKathmandu, Bāgmatī, NepalApply NowiOS DeveloperIME Group NepalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who IME Group Nepal has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveiOS DeveloperatIME Group Nepal.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from IME Group NepalSuwash GautamManager at IME Ltd.SUMMARYWe are looking for a Full time iOS Developer who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications.JOB DESCRIPTIONDesign and build applications for the iOS platformDevelop and deploy well tested code and maintain code quality.Fix bugs and errors reported by end users, SDK and operation team.Work with the product and design teams to understand end-user requirements, formulate use cases.Ensure the best possible performance, quality, and responsiveness of the application.Collaborate with team to define, design, and include new features on the app.Integrate APIs as needed and stay up to date with latest trends.JOB SPECIFICATIONSBachelor of Computer Engineering or equivalent.At least 2 years of experience in building native iOS applications.A deep familiarity with Objective-C and Cocoa Touch.Good knowledge of iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text.KEY BENEFITS:Competitive Salary.5 Working Days.Festival Allowance.Provident Fund.Performance Bonus and Project IncentiveLife, Medical and Accidental Insurance.Allowances for Communication, Lunch, Fuel and Maintenance Expenses.Interested candidates are required to post their cover letter and resume along with their work experience and education if any and expected salary at hr@imegroup.com.npShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesFinancial ServicesReferrals increase your chances of interviewing at IME Group Nepal by 2xSee who you knowTurn on job alertsiOS Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Pokhara, Gandakī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-azure-developer-%E2%80%93-remote-full-time-at-toptal-2319758498", "desct": "Senior Azure Developer – Remote, Full-timeToptalPokhara, Gandakī, NepalApply on company websiteSenior Azure Developer – Remote, Full-timeToptalPokhara, Gandakī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Azure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAbout ToptalToptal is a network of the world's top software engineers, designers, finance experts, project managers, and product managers – available on demand to help companies accelerate, adapt, and scale. With $100+ million in annual revenue and triple-digit growth, Toptal is the largest fully distributed workforce in the world.Position DescriptionProviding a great service to our clients is crucial to us, and we're always looking for talented software developers to help us reach the next level.By joining our network, you'll have the opportunity to work on many different projects with various clients around the world and become part of a community of highly skilled developers. Over the past 10 years, Toptal has championed an ever-expanding community of experts unlike any other, and you could make a great fit to join our network.All of our network members are required to pass a sophisticated screening process, which is designed to ensure that our standards of quality for our clients remain consistently high.This is a remote position that can be done from anywhere; whether you prefer to work from a coworking space in your hometown, or travel the world and commit your code from exotic locations, you'll choose your preferred environment.ResponsibilitiesAfter passing our screening process, you will have access to our network of clients across the globe including leading Fortune 500s and innovative Silicon Valley start-ups.You will have full flexibility to set your working hours per week and your rate. There are no mandatory hours.You will have visibility into all projects published that fit your specialization. Our matching team is here to help you identify the projects that are the best fit for your skills and preferences.As a client-oriented company, we empower you to fully focus on client objectives. We ensure that you always get paid on time for the hours you spend working with clients.RequirementsYou must have 4+ years of full-time Azure and Python experience—preference given to candidates who have experience working for enterprise companies.You consider multiple quality dimensions like user impact, failure tolerance, code maintenance, implementation time, security breaches, and performance.You are genuinely interested in technology and love to try new things.You are willing to help clients make important product and development decisions, share your knowledge with them, and help them achieve their objectives. You solve complex problems but also consider multiple solutions, weigh them, and decide on the best course of action.You must be a world-class individual contributor to thrive at Toptal. You're excited about working independently while keeping all relevant stakeholders continuously informed and up-to-speed with any challenges, set realistic expectations, and deliver the desirable quality. You thrive on providing and receiving honest but always constructive feedback.Note: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.#RemoteJobsAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Pokhara, Gandakī, NepalOnOff"}, {"name": "Junior Android Developer", "company": "Bankaks", "address": "Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/junior-android-developer-at-bankaks-2298673736", "desct": "Junior Android DeveloperBankaksNepalApply NowJunior Android DeveloperBankaksNepal3 days ago32 applicantsSee who Bankaks has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJunior Android DeveloperatBankaks.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from BankaksAndrés AlbaIT and Management Consultant - Tech leaderBankaks is a Spanish tech startup looking for IT professionals wanting to be part of the team that will be responsible for maintaining, adapting and scaling up the whole platform. We are currently hiring a young, talented and analytical Android Developer that wants to join a powerful team to boost his skills and gains an overall new different experience related to working with a startup. Your primary focus will be developing high-end Android applications for the latest Android mobile devices.ResponsibilitiesDesign and build advanced applications for the Android platformCollaborate with cross-functional teams to define, design, and ship new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performancePublishing application to the Google Play StoreContinuously discover, evaluate, and implement new technologies to maximize development efficiencyRequirementsBachelor’s degree in Computer Science or Software Engineering.0 - 2 years proven software and app development experience and Android skills developmentHave published at least one original Android appExperience with Android SDKExperience working with remote data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesSolid understanding of the full mobile development life cycle.Strong knowledge of Android UI design principles, patterns, and best practicesUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of code versioning tools, such as GitFamiliarity with continuous integrationExperience working with Agile Methodologies, preferably ScrumCritical thinker and strong problem-solving skillsTeam player plus great interpersonal and communication skillsExcellent written and verbal communication skills.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeIndustriesInternetReferrals increase your chances of interviewing at Bankaks by 2xSee who you knowTurn on job alertsAndroid Developer in NepalOnOff"}, {"name": "Senior MS-SQL Developer ", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "2020-10-28", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-ms-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220508772", "desct": "Senior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior MS-SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Position: Senior MS-SQL DeveloperResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.QUALIFICATIONS AND EDUCATION REQUIREMENTSBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLSMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.PREFERABLE SKILLSExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)SOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSQL Developer in Bāgmatī, NepalOnOff"}, {"name": "Senior Web Developer", "company": "Tech Ball Solutions", "address": "Nepal", "deadline": "2020-11-22", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-web-developer-at-tech-ball-solutions-2295954846", "desct": "Senior Web DeveloperTech Ball SolutionsNepalApply NowSenior Web DeveloperTech Ball SolutionsNepal5 days agoBe among the first 25 applicantsSee who Tech Ball Solutions has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Web DeveloperatTech Ball Solutions.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Tech Ball SolutionsPrashant AdhikariDigital Marketing Manager| Web Developer| Branding| Content Marketing| Blogging| Data AnalystRequired: Senior Web Developer with minimum 3 years of experience and knowledge of required applications for the position.Pay: NRS 30,000+ (Negotiable for the right candidate)Please respond with few description of yourself and job you have done and what makes you valuable..**Opportunity to grow your knowledge and skills applicable in international market.**Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Tech Ball Solutions by 2xSee who you knowTurn on job alertsSenior Web Developer in NepalOnOff"}, {"name": "Oracle- PL/SQL Developer", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-20", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/oracle-pl-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2294409207", "desct": "Oracle- PL/SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Kathmandu, Bāgmatī, NepalApply NowOracle- PL/SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Kathmandu, Bāgmatī, Nepal7 days agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveOracle- PL/SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Required Technical SkillMinimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsResponsibilitiesUnderstanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.PREFERABLE SKILLSKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo)﻿Other SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueEducationBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsOracle Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Jr. Developer Laravel", "company": "ESC Pvt.Ltd.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-12", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/jr-developer-laravel-at-esc-pvt-ltd-1163890327", "desct": "Jr. Developer LaravelKathmandu, Bāgmatī, NepalApply NowJr. Developer LaravelESC Pvt.Ltd.Kathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJr. Developer LaravelatESC Pvt.Ltd..Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from ESC Pvt.Ltd.Rabin ShresthaDirector at ESCJunior Developer is required for full time.Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEducationTrainingIndustriesInformation Technology and ServicesSearch for more jobs like thisTurn on job alertsJunior Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Software Developer (Remote) - $30,000/year USD", "company": "Crossover for Work", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-27", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-developer-remote-%2430-000-year-usd-at-crossover-for-work-2321318116", "desct": "Software Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, NepalApply NowSoftware Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, Nepal3 hours agoBe among the first 25 applicantsSee who Crossover for Work has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Developer (Remote) - $30,000/year USDatCrossover for Work.Email or phonePasswordShowForgot password?Sign inReport this jobAre you the strongest developer on your team? Are you always getting interrupted from writing your own great code to put out a fire created by one of your less-skilled teammates? Wouldn’t you rather work on a team without these so-called arsonists who introduce bugs due to their carelessness?Yea, we thought so. We are so obsessed with software code quality that we only hire elite developers - the ones that firmly believe in test-driven development and always deliver simple & elegant solutions - and then we teach them our innovative approach to development that produces perfect code. Our results speak for themselves: we ship code every day with less than one-thousandth of a percent of those code changes introducing regressions!In this role, you will focus on re-building essential B2B products and deploying them as true cloud-native applications. This is a unique opportunity to level-up in your software development career, working in a role that demands high-quality code across multiple products at once. We will teach you how to meet our demanding quality standards so you can ship perfect code.Stop wasting your time firefighting the work of the arsonists on your team. If you can meet the requirements below, apply for this role of a lifetime and take your career to the next level.What You Will Be DoingDue to the huge investment we’ve made in tooling and automation, you will focus on more substantive development work only - no time wasted on administrative tasks. All you will do is write production code for several of our hundreds of commercial SaaS products following a TDD methodology.What You Won’t Be DoingGetting spoon-fed easy changes or small parts of complex problems already solved by senior team members.Getting bored being focused on a single, slowly-evolving codebase. In this role you'll learn new codebases and tech stacks week to week.Reviewing someone else's code to find issues and errors.Software Developer Key ResponsibilitiesWe hire the top 1% of engineering talent and place you in a highly specialized role working on multiple products at a time. In this role you will:Write high-quality code every dayCreate elegant solutions to resolve difficult bugsBasic RequirementsTo produce high-quality work in this role you must:Have at least 6 months experience writing production code in Java, JavaScript, C#, or C++. More often than not, developers need 2 years of experience to meet our quality standards but we hire based on skill level, not years of experience.Have a degree in computer science, software engineering, or other technical field OR a minimum of 4 years of software development experience.Possess the ability to ramp up quickly, learning new codebases and technologies every weekAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go towww.crossover.com/testimonialsto read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important!If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply.Crossover Job Code: LJ-3890-NP-Kathmand-SoftwareDevelo.024Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionBusiness DevelopmentEngineeringInformation TechnologyIndustriesBankingElectrical/Electronic ManufacturingFinancial ServicesReferrals increase your chances of interviewing at Crossover for Work by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Java Software Engineer", "company": "Pagoda Labs", "address": "Lalitpur District, Nepal", "deadline": "2020-11-04", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-java-software-engineer-at-pagoda-labs-2273266156", "desct": "Senior Java Software EngineerPagoda LabsLalitpur District, NepalApply NowSenior Java Software EngineerPagoda LabsLalitpur District, Nepal3 weeks agoBe among the first 25 applicantsSee who Pagoda Labs has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Java Software EngineeratPagoda Labs.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Pagoda LabsBijay ShresthaWeb Developer at Pagoda Labs Pvt. Ltd.We are hiring Senior Java Springboot Developer developer to join our team.Experience:2+ yearsCore TechnologyJava (1.8)Spring Boot (1.3.8)Maven (3.0.0)JUnit (4.13)Unix/Linux, Web/Application server like Tomcat or WebSpherePostgres (9.4) / MYSQL / SQL ServerProficient in CSS, HTML, and writing cross-browser compatible code (preferred).Proven experience implementing front-end and back-end JavaScript applications.Significant experience building large-scale, distributed, high-volume systems.You Should Have:A portfolio with live links to sites that you have developed previously (preferred)Object oriented programmingExperience working in an Agile development processThe ability to handle multiple projects and tasks at the same timeGreat attention to detail and be highly organizedA reliable workstation with a fast internet, for calls.The ability to work hours similar to the rest of the Coalition Team (9am-6pm NST)The ability to articulate yourself professionallyExcellent written and spoken English and NepaliThe ability to adapt in a diverse and multicultural environmentA positive and upbeat attitudeYour Duties and Tasks:Work daily in Java, Postgres, JavaScript, JQueryBuild Java web applications and other platformsResolve cross-browser compatibility issuesWrite clean structured and well-documented codeIntegrate data with third party applications and APIs in general and ERP/stock management systemsHow to applyDrop your resume at hello@pagodalabs.comIndustryComputer SoftwareEmployment TypeFull-timeShow moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Pagoda Labs by 2xSee who you knowTurn on job alertsSenior Java Software Engineer in Lalitpur District, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Biratnagar, Koshi Zone, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319775797", "desct": "Senior React Developer – Full-time, RemoteToptalBiratnagar, Koshi Zone, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalBiratnagar, Koshi Zone, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Biratnagar, Koshi Zone, NepalOnOff"}, {"name": "PHP Developer", "company": "Cloudlaya.com LLC", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-25", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/php-developer-at-cloudlaya-com-llc-2304638754", "desct": "PHP DeveloperCloudlaya.com LLCKathmandu, Bāgmatī, NepalApply NowPHP DeveloperCloudlaya.com LLCKathmandu, Bāgmatī, Nepal2 days agoBe among the first 25 applicantsSee who Cloudlaya.com LLC has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePHP DeveloperatCloudlaya.com LLC.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Cloudlaya.com LLCCloudlaya LLCDomain Registration, Cloud Hosting & Email Hosting ServicesMiddle-Level laravel developer specialized in the development of travel platformIntegration of domestic and international flight API, Booking Engine Development, etc.Ongoing project (Project URL) : http://sajilotrip.com/Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer NetworkingReferrals increase your chances of interviewing at Cloudlaya.com LLC by 2xSee who you knowTurn on job alertsPHP Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319772004", "desct": "Senior React Developer – Full-time, RemoteToptalKathmandu, Bāgmatī, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior PHP Programmer", "company": "TekGro", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-24", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-php-programmer-at-tekgro-2298696747", "desct": "Senior PHP ProgrammerTekGroKathmandu, Bāgmatī, NepalApply NowSenior PHP ProgrammerTekGroKathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who TekGro has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior PHP ProgrammeratTekGro.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from TekGroMatrika SahDirector at TekGroTekGro is an Australian based digital marketing and SaaS (Software as a service) company operating since 2008. We are an innovative, high-tech, and versatile company who deliver exceptional 360 digital marketing services to clients throughout the world.Please Clic The Link Below To Learn More About Job :https://www.jobsnepal.com/moodle-developer-php-118821Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at TekGro by 2xSee who you knowTurn on job alertsSenior PHP Programmer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "React Native Developer (Remote)", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/react-native-developer-remote-at-toptal-2319250666", "desct": "React Native Developer (Remote)ToptalKathmandu, Bāgmatī, NepalApply on company websiteReact Native Developer (Remote)ToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveReact Native Developer (Remote)atToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAre you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you'll find remote freelance opportunities with leading global companies, on your terms.Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world's leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won't have to bid against other freelancers and can maintain a steady stream of work. It's the type of work/life balance that empowers you to travel the world, or stay at home. You're in control of shaping your environment to however you work best while establishing yourself as an elite developer.To learn more from Toptalers that made it big through freelancing, check out the following article: https://topt.al/V6cyVZReact Native Developers In Our Elite Network ShareEnglish language proficiency2+ years of professional experienceExperience with React Native is requiredFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.#RemoteJobsReactNativeShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "iOS Developer", "company": "IME Group Nepal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/ios-developer-at-ime-group-nepal-2291608709", "desct": "iOS DeveloperIME Group NepalKathmandu, Bāgmatī, NepalApply NowiOS DeveloperIME Group NepalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who IME Group Nepal has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveiOS DeveloperatIME Group Nepal.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from IME Group NepalSuwash GautamManager at IME Ltd.SUMMARYWe are looking for a Full time iOS Developer who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications.JOB DESCRIPTIONDesign and build applications for the iOS platformDevelop and deploy well tested code and maintain code quality.Fix bugs and errors reported by end users, SDK and operation team.Work with the product and design teams to understand end-user requirements, formulate use cases.Ensure the best possible performance, quality, and responsiveness of the application.Collaborate with team to define, design, and include new features on the app.Integrate APIs as needed and stay up to date with latest trends.JOB SPECIFICATIONSBachelor of Computer Engineering or equivalent.At least 2 years of experience in building native iOS applications.A deep familiarity with Objective-C and Cocoa Touch.Good knowledge of iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text.KEY BENEFITS:Competitive Salary.5 Working Days.Festival Allowance.Provident Fund.Performance Bonus and Project IncentiveLife, Medical and Accidental Insurance.Allowances for Communication, Lunch, Fuel and Maintenance Expenses.Interested candidates are required to post their cover letter and resume along with their work experience and education if any and expected salary at hr@imegroup.com.npShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesFinancial ServicesReferrals increase your chances of interviewing at IME Group Nepal by 2xSee who you knowTurn on job alertsiOS Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Pokhara, Gandakī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-azure-developer-%E2%80%93-remote-full-time-at-toptal-2319758498", "desct": "Senior Azure Developer – Remote, Full-timeToptalPokhara, Gandakī, NepalApply on company websiteSenior Azure Developer – Remote, Full-timeToptalPokhara, Gandakī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Azure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAbout ToptalToptal is a network of the world's top software engineers, designers, finance experts, project managers, and product managers – available on demand to help companies accelerate, adapt, and scale. With $100+ million in annual revenue and triple-digit growth, Toptal is the largest fully distributed workforce in the world.Position DescriptionProviding a great service to our clients is crucial to us, and we're always looking for talented software developers to help us reach the next level.By joining our network, you'll have the opportunity to work on many different projects with various clients around the world and become part of a community of highly skilled developers. Over the past 10 years, Toptal has championed an ever-expanding community of experts unlike any other, and you could make a great fit to join our network.All of our network members are required to pass a sophisticated screening process, which is designed to ensure that our standards of quality for our clients remain consistently high.This is a remote position that can be done from anywhere; whether you prefer to work from a coworking space in your hometown, or travel the world and commit your code from exotic locations, you'll choose your preferred environment.ResponsibilitiesAfter passing our screening process, you will have access to our network of clients across the globe including leading Fortune 500s and innovative Silicon Valley start-ups.You will have full flexibility to set your working hours per week and your rate. There are no mandatory hours.You will have visibility into all projects published that fit your specialization. Our matching team is here to help you identify the projects that are the best fit for your skills and preferences.As a client-oriented company, we empower you to fully focus on client objectives. We ensure that you always get paid on time for the hours you spend working with clients.RequirementsYou must have 4+ years of full-time Azure and Python experience—preference given to candidates who have experience working for enterprise companies.You consider multiple quality dimensions like user impact, failure tolerance, code maintenance, implementation time, security breaches, and performance.You are genuinely interested in technology and love to try new things.You are willing to help clients make important product and development decisions, share your knowledge with them, and help them achieve their objectives. You solve complex problems but also consider multiple solutions, weigh them, and decide on the best course of action.You must be a world-class individual contributor to thrive at Toptal. You're excited about working independently while keeping all relevant stakeholders continuously informed and up-to-speed with any challenges, set realistic expectations, and deliver the desirable quality. You thrive on providing and receiving honest but always constructive feedback.Note: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.#RemoteJobsAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Pokhara, Gandakī, NepalOnOff"}, {"name": "Junior Android Developer", "company": "Bankaks", "address": "Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/junior-android-developer-at-bankaks-2298673736", "desct": "Junior Android DeveloperBankaksNepalApply NowJunior Android DeveloperBankaksNepal3 days ago32 applicantsSee who Bankaks has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJunior Android DeveloperatBankaks.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from BankaksAndrés AlbaIT and Management Consultant - Tech leaderBankaks is a Spanish tech startup looking for IT professionals wanting to be part of the team that will be responsible for maintaining, adapting and scaling up the whole platform. We are currently hiring a young, talented and analytical Android Developer that wants to join a powerful team to boost his skills and gains an overall new different experience related to working with a startup. Your primary focus will be developing high-end Android applications for the latest Android mobile devices.ResponsibilitiesDesign and build advanced applications for the Android platformCollaborate with cross-functional teams to define, design, and ship new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performancePublishing application to the Google Play StoreContinuously discover, evaluate, and implement new technologies to maximize development efficiencyRequirementsBachelor’s degree in Computer Science or Software Engineering.0 - 2 years proven software and app development experience and Android skills developmentHave published at least one original Android appExperience with Android SDKExperience working with remote data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesSolid understanding of the full mobile development life cycle.Strong knowledge of Android UI design principles, patterns, and best practicesUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of code versioning tools, such as GitFamiliarity with continuous integrationExperience working with Agile Methodologies, preferably ScrumCritical thinker and strong problem-solving skillsTeam player plus great interpersonal and communication skillsExcellent written and verbal communication skills.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeIndustriesInternetReferrals increase your chances of interviewing at Bankaks by 2xSee who you knowTurn on job alertsAndroid Developer in NepalOnOff"}, {"name": "Senior MS-SQL Developer ", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "2020-10-28", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-ms-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220508772", "desct": "Senior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior MS-SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Position: Senior MS-SQL DeveloperResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.QUALIFICATIONS AND EDUCATION REQUIREMENTSBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLSMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.PREFERABLE SKILLSExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)SOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSQL Developer in Bāgmatī, NepalOnOff"}, {"name": "Senior Web Developer", "company": "Tech Ball Solutions", "address": "Nepal", "deadline": "2020-11-22", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-web-developer-at-tech-ball-solutions-2295954846", "desct": "Senior Web DeveloperTech Ball SolutionsNepalApply NowSenior Web DeveloperTech Ball SolutionsNepal5 days agoBe among the first 25 applicantsSee who Tech Ball Solutions has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Web DeveloperatTech Ball Solutions.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Tech Ball SolutionsPrashant AdhikariDigital Marketing Manager| Web Developer| Branding| Content Marketing| Blogging| Data AnalystRequired: Senior Web Developer with minimum 3 years of experience and knowledge of required applications for the position.Pay: NRS 30,000+ (Negotiable for the right candidate)Please respond with few description of yourself and job you have done and what makes you valuable..**Opportunity to grow your knowledge and skills applicable in international market.**Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Tech Ball Solutions by 2xSee who you knowTurn on job alertsSenior Web Developer in NepalOnOff"}, {"name": "Oracle- PL/SQL Developer", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-20", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/oracle-pl-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2294409207", "desct": "Oracle- PL/SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Kathmandu, Bāgmatī, NepalApply NowOracle- PL/SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Kathmandu, Bāgmatī, Nepal7 days agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveOracle- PL/SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Required Technical SkillMinimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsResponsibilitiesUnderstanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.PREFERABLE SKILLSKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo)﻿Other SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueEducationBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsOracle Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Junior iOS Developer", "company": "Bankaks", "address": "Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/junior-ios-developer-at-bankaks-2298677156", "desct": "Junior iOS DeveloperBankaksNepalApply NowJunior iOS DeveloperBankaksNepal3 days agoBe among the first 25 applicantsSee who Bankaks has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJunior iOS DeveloperatBankaks.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from BankaksAndrés AlbaIT and Management Consultant - Tech leaderBankaks is a Spanish tech startup looking for IT professionals wanting to be part of the team that will be responsible for maintaining, adapting and scaling up the whole platform. We are currently hiring a young, talented and analytical iOS Developer that wants to join a powerful team to boost his skills and gains an overall new different experience related to working with a startup. Your primary focus will be developing high-end iOS applications for the latest Apple mobile devices.ResponsibilitiesDesigning and building mobile applications for Apple’s iOS platform.Collaborating with the design and back-end team specialist to define app features.Ensuring the quality and performance of the application to specifications.Identifying potential problems and resolving application bottlenecks.Research and implementation of custom solutions based on most recent and used libraries or frameworksFixing application bugs before the final release.Publishing application on App Store.Maintaining the code and atomization of the application.Designing and implementing application updates.RequirementsBachelor’s degree in Computer Science or Software Engineering.0 - 2 years of proven experience as an iOS app developer.Proficient in Objective-C, Swift, and Cocoa Touch.Extensive experience with iOS Frameworks such as Core Data and Core Animation.Knowledge of iOS back-end services.Knowledge of Apple’s design principals and application interface guidelines.Proficient in code versioning tools including Mercurial, Git, and SVN.Knowledge of C-based libraries.Familiarity with push notifications, APIs and cloud messaging.Experience with continuous integration.Experience working with Agile Methodologies, preferably ScrumCritical thinker and strong problem-solving skillsTeam player plus great interpersonal and communication skillsExcellent written and verbal communication skills.Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInternetReferrals increase your chances of interviewing at Bankaks by 2xSee who you knowTurn on job alertsiOS Developer in NepalOnOff"}, {"name": "Senior Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Biratnagar, Koshi Zone, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-azure-developer-%E2%80%93-remote-full-time-at-toptal-2319760856", "desct": "Senior Azure Developer – Remote, Full-timeToptalBiratnagar, Koshi Zone, NepalApply on company websiteSenior Azure Developer – Remote, Full-timeToptalBiratnagar, Koshi Zone, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Azure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAbout ToptalToptal is a network of the world's top software engineers, designers, finance experts, project managers, and product managers – available on demand to help companies accelerate, adapt, and scale. With $100+ million in annual revenue and triple-digit growth, Toptal is the largest fully distributed workforce in the world.Position DescriptionProviding a great service to our clients is crucial to us, and we're always looking for talented software developers to help us reach the next level.By joining our network, you'll have the opportunity to work on many different projects with various clients around the world and become part of a community of highly skilled developers. Over the past 10 years, Toptal has championed an ever-expanding community of experts unlike any other, and you could make a great fit to join our network.All of our network members are required to pass a sophisticated screening process, which is designed to ensure that our standards of quality for our clients remain consistently high.This is a remote position that can be done from anywhere; whether you prefer to work from a coworking space in your hometown, or travel the world and commit your code from exotic locations, you'll choose your preferred environment.ResponsibilitiesAfter passing our screening process, you will have access to our network of clients across the globe including leading Fortune 500s and innovative Silicon Valley start-ups.You will have full flexibility to set your working hours per week and your rate. There are no mandatory hours.You will have visibility into all projects published that fit your specialization. Our matching team is here to help you identify the projects that are the best fit for your skills and preferences.As a client-oriented company, we empower you to fully focus on client objectives. We ensure that you always get paid on time for the hours you spend working with clients.RequirementsYou must have 4+ years of full-time Azure and Python experience—preference given to candidates who have experience working for enterprise companies.You consider multiple quality dimensions like user impact, failure tolerance, code maintenance, implementation time, security breaches, and performance.You are genuinely interested in technology and love to try new things.You are willing to help clients make important product and development decisions, share your knowledge with them, and help them achieve their objectives. You solve complex problems but also consider multiple solutions, weigh them, and decide on the best course of action.You must be a world-class individual contributor to thrive at Toptal. You're excited about working independently while keeping all relevant stakeholders continuously informed and up-to-speed with any challenges, set realistic expectations, and deliver the desirable quality. You thrive on providing and receiving honest but always constructive feedback.Note: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.#RemoteJobsAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Biratnagar, Koshi Zone, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Pokhara, Gandakī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319766323", "desct": "Senior React Developer – Full-time, RemoteToptalPokhara, Gandakī, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalPokhara, Gandakī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Pokhara, Gandakī, NepalOnOff"}, {"name": "NET Developer - Global Fitness Movement - Thame", "company": "Noir", "address": "Thame, England, United Kingdom", "deadline": "2020-11-19", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/net-developer-global-fitness-movement-thame-at-noir-2315647832", "desct": "NET Developer - Global Fitness Movement - ThameThame, England, United KingdomApply on company websiteNET Developer - Global Fitness Movement - ThameNoirThame, England, United Kingdom1 week agoBe among the first 25 applicantsApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveNET Developer - Global Fitness Movement - ThameatNoir.Email or phonePasswordShowForgot password?Sign inReport this jobNET Developer - Global Fitness Movement - Thame (Tech stack: . NET Developer, .NET Core 3.1, C#, ASP.NET, C#, React, Angular 9, Microservices, Vue.js, TypeScript, Azure, Web API 2, Agile, SQL Server 2019, Engineer, .NET Developer, Urgent) Born in 2012 in California, our client began development on an app and website that made finding and booking classes effortless for fitness goers across the state. The company is now changing how people live their lives, bringing together a community of enthusiasts, helping people find the activities that make their true selves come alive or supporting small businesses and studios across the entire globe. They believe that being active is the key to living a happy and healthy life. Our client is now active in over 15 countries and continues rapid growth on a yearly basis. It takes a team to make things happen and this team includes some of the most talented .NET Developer in the industry. They don't just have the best developers - but also the best karaoke stars, community activists and amateur chefs. Together, they are making the world an active place, which makes every day pretty damn gratifying. They are looking for .NET Developer with excellent knowledge of object orientated development principles and technologies such as: .NET, ASP.NET MVC, C# and SQL Server. You'll receive expert training on the latest technologies including: .NET Core 3.1, JavaScript, React, Angular 9, Microservices, MongoDB, Vue.js, TypeScript, Azure, AWS, Web API 2, Entity Framework, Node.js, Elasticsearch, Agile, TDD, BDD, Scrum, Kanban and SQL Server 2019. All positions come with the following benefits: Annual bonus. Free medical, dental and vision coverage. Flexible work hours. £5,000 training allowance. Healthy (and unhealthy) snacks. Charitable giving programs. Casual dress - fitness wear encouraged! Team classes, events and happy hours.There is no 'I' in team. By working with talented individuals and developing upon innovative ideas, the team continues to succeed and grow. They are a global movement with big plans for the future. It's an incredible opportunity so if you're interested, act and apply today! Location: Thame, Oxfordshire / Remote Salary: £40 - £70k + Bonus + Car + Benefits Noir continues to be the leading Microsoft recruitment agency; we can help you make the right career decisionsShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareInternetStaffing and RecruitingSearch for more jobs like thisTurn on job alertsDeveloper in Thame, England, United KingdomOnOff"}, {"name": "Senior MS-SQL Developer ", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "2020-10-28", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-ms-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220508772", "desct": "Senior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior MS-SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Position: Senior MS-SQL DeveloperResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.QUALIFICATIONS AND EDUCATION REQUIREMENTSBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLSMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.PREFERABLE SKILLSExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)SOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSQL Developer in Bāgmatī, NepalOnOff"}, {"name": "Senior React Developer – Full-time, Remote", "company": "Toptal", "address": "Jitpur, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-developer-%E2%80%93-full-time-remote-at-toptal-2319763595", "desct": "Senior React Developer – Full-time, RemoteToptalJitpur, NepalApply on company websiteSenior React Developer – Full-time, RemoteToptalJitpur, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Developer – Full-time, RemoteatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageReady for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Jitpur, NepalOnOff"}, {"name": "Software Engineer - Javascript", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-02", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-javascript-at-cloudfactory-2266777125", "desct": "Software Engineer - JavascriptCloudFactory.Kathmandu, Bāgmatī, NepalApply NowSoftware Engineer - JavascriptCloudFactory.Kathmandu, Bāgmatī, Nepal4 weeks ago53 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - JavascriptatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionWe are looking for a Full-Stack Javascript Developer for our Platform team. The person we are looking for lives and breathes front end engineering. On our team, you will be designing, developing, and supporting the core functionality that drives our technology and services using the latest technology available.Our codebase includes Go and Ruby as a backend, Javascript and TypeScript for the frontend languages. We use ReactJS to build user interfaces.Key ResponsibilitiesDevelopment, and testing of features/functions for the product team to support business needs.Working with product team using agile methodologies to deliver high quality solutions on timeCollaborate with other engineers, and architects to build a CloudFactory platformHelp development teams build features faster by researching, evaluating and integrating emerging technologies into the platformDesign and build maintainable, extensible, and performant modules and shared components in React/JSX that that will be used or extended by other teamsAble to work effectively with a remote teamRequirementsBe proactive and anticipate/handle most issues before they go off.Demonstrate a high level of curiosity and keep abreast of the latest technologies.Show ownership and strive for excellence in everything you do.Experience with application/service development using Node.js and HTML/CSS/JavaScript required.Work experience of UI framework ReactJS and stay up on latest versionExperience in building, unit testing, documenting and refactoring JavaScript code.Experience in testing strategies, cross-browser compatibility & client-side performance optimization.3+ years work experienceBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": ".Net Developer", "company": "Omnicom Media Group", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-24", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/net-developer-at-omnicom-media-group-2320480965", "desct": ".Net DeveloperOmnicom Media GroupKathmandu, Bāgmatī, NepalApply Now.Net DeveloperOmnicom Media GroupKathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who Omnicom Media Group has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to save.Net DeveloperatOmnicom Media Group.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Omnicom Media GroupKalpana ThamsuhangHuman Resources at Omnicom Media Group NepalOmnicom Media Group Nepal, a subsidairy of OmnicomMediaGroup Australia is looking to hire (2) .Net Developer.About the roleIn this role, you will be working as part of the development team where your primary focus will be to turn ideas and designs into attractive and functional websites. You should be a team player and excellent communicator. This role holder should be passionate about the .NET framework and software design/architecture.ResponsibilitiesTechnical Expertise (50%)Develop web application in Umbraco / SiteCore / Kentico or similar CMS platformsParticipate in requirements analysisCollaborate with internal teams to produce software design and architectureWrite clean, scalable code using .NET programming languages for webTest and deploy applications and systemsRevise, update, refactor and debug codeUse version control system (Git, SVN)Improve existing softwareDevelop documentation throughout the software development life cycle (SDLC)Product Quality Assurance (40%)Conduct functional testing and verification before sending to QA.Prepare functional document for QA team for further testing.Team Management (5%)Attend on different project management process/methodology and follow these session’s outcomeStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Development Project Managers to ensure the management of any delivery risks or issues.QualificationsProven experience in .NET web development for more than 2+ yearsExperienced in Umbraco / SiteCore / Kentico or similar CMS developmentGood understanding of web development and technologies around itBSc/BA in Computer Science, Engineering or a related fieldFamiliarity with the ASP.NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC))Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3Knowledge in Content Management System (preferred)Familiarity with architecture styles/APIs (REST, RPC)Understanding of Agile methodologiesGood troubleshooting and communication skillsExcellent Attention to detailShow moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesMarketing and AdvertisingReferrals increase your chances of interviewing at Omnicom Media Group by 2xSee who you knowTurn on job alertsDotnet Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Software Developer", "company": "Avanti Recruitment", "address": "Thame, England, United Kingdom", "deadline": "2020-11-06", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-developer-at-avanti-recruitment-2284235741", "desct": "Software DeveloperThame, England, United KingdomApply on company websiteSoftware DeveloperAvanti RecruitmentThame, England, United Kingdom3 weeks agoBe among the first 25 applicantsApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware DeveloperatAvanti Recruitment.Email or phonePasswordShowForgot password?Sign inReport this jobAvanti are working with a company of around 10 people looking for a C# Developer to join the team. It is a relaxed friendly environment just East of Oxfordshire. The company offer a variety of services including as a creative agency and consultancy. I’m happy to go into more detail around exactly what they do with you if you are interested.Salary is circa £35kEssential SkillsC#SQLEntity Framework (Core + 6.0)BeneficialASP.NET webforms/user controlsDNNReact / JavaScriptHTML/CSSVSTSAzure Cloud servicesNCrunchThe company are all a friendly bunch of people who live locally and who enjoy socialising together.You will be based in the office 2 days per week and working remotely the rest of the time (guidelines permitting.) The staff are a close social bunch so team fit is important – everyone is super friendly and easy to talk to! The company are based in between Oxford and Aylesbury.If you are interested in this C# developer role apply nowShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareStaffing and RecruitingSearch for more jobs like thisTurn on job alertsSoftware Engineer in Thame, England, United KingdomOnOff"}, {"name": "Database Administrator/Developer", "company": "Omnicom Media Group", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-13", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/database-administrator-developer-at-omnicom-media-group-2277133377", "desct": "Database Administrator/DeveloperOmnicom Media GroupKathmandu, Bāgmatī, NepalApply NowDatabase Administrator/DeveloperOmnicom Media GroupKathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who Omnicom Media Group has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveDatabase Administrator/DeveloperatOmnicom Media Group.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Omnicom Media GroupKalpana ThamsuhangHuman Resources at Omnicom Media Group NepalRole OverviewThe DBA/Devloper will work closely with Project Management, Business Analysis, Quality and the Management Team during all phases of the SDLC and will ensure that deadlines are met, and output is of the highest quality.Database administrator/Developer's responsibilities cover the performance, integrity and security of business data. He/She must perform routine DBA checks on their SQL Servers to monitor their status & ensure all scheduled jobs are executed. Monitor the resources memory uses, disks & CPU, and monitor the growth of the database and change review the growth setting. The role also covers writing optimized SQL query and procedure, writing SSIS package and getting data from different API data source.ResponsibilitiesTechnical Expertise (65%)Build database systems of high availability and quality depending on each end user’s specialised roleDesign and implement database in accordance to end user’s information needs and viewsInstall and configure new MS SQL Servers, MySQL, PostgreSQL when neededMonitor database performance, implement changes and apply new patches and versions when requiredAssist developers with complex query tuning and schema refinement.Minimise database downtime and manage parameters to provide fast query responseDetermine, enforce and document database policies, procedures and standardsDevelop and define security procedures, administrative controls and monitors user access to databases and maintains database security.Understand the data structure and meaning in both the source and the target BI systemsProvide support of maintenance plans (including DBCC), backup, recovery, and refresh of development SQL Server databases and database capacity planning.Develop strategies and implement solutions for managing back-ups, restoration and replication.Create and manage constraints and indexes.Responsible for designing, developing, implementing, and periodically testing a backup and recovery plan for the databases.Looks critically at patch release notes to advice when a security update, cumulative update, or Service Pack is critical to apply.Writing SQL Query and optimizing previously existing query.Creating API middleware to extract data from external sources and insert into databases would be a plus.Product Quality Assurance (25%)Maintain data integrity in all application database. Work closely with team lead to design the effective and efficient database structure.Meet the performance requirement of the applications. Regularly tune database with the resource provided for optimal resultRegularly monitor the resource uses by application and alert when there is need to upgrade or add resource.Team Management (5%)Assist developer in writing complex queriesVerify the queries created by developer meets performance, security requirementTrain and upgrade team member on SQL technologiesStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Project Managers to ensure the management of database involved in any project.QualificationsBachelor’s in computer science or equivalent education and experience.2+ years ‘experience in administering Microsoft SQL server databases (SQL Server 2012).Good Communication skills.Experience in MySQL, PostgreSQL will be added advantage.Knowledge of other databases like No SQL databases and In-memory databases and certification will be an advantage.Extensive experience writing T-SQL and stored procedures and query tuning on high-transaction systems & large tablesStrong knowledge of DDL, DCL & DML.Experienced in ETL (Extract-Transform-Load) development / data integrationSound knowledge of RDBMS concepts, database architecture and SQL/T-SQL.Proficient with SQL server profiler for monitoring and troubleshooting database activity and performance.Knowledge in SQL  Server  Clustering  and  HA technologies  including mirroring, log shipping, failover cluster and various replication technologies would be an advantage.Ability  to  develop  procedure  documents  and maintain  detailed  database  related documents.Knowledge of data partition & compressionKnowledge regarding Amazon S3 server will be added advantage.Inter database migration, oracle to Microsoft SQL server or PostgreSQL to Microsoft SQL server will be added advantage.Programming language skills such as .net, python, php or Java would be preferable.Added knowledge of Power BI, working with excel macros would be a plus.Knowledge of data business intelligence (BI) and experience in developing SSIS packages.Strong knowledge of programming paradigms like object-oriented programming (OOP) and hands in C#, PHP are added advantage.﻿Why you'll love usThrough our people philosophy we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they're more fun to share an office with.Join us and surround yourself with like-minded, high achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link athttps://www.omnicommediagroup.com.np/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently abled, to apply”Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionMarketingInformation TechnologyOtherIndustriesMarketing and AdvertisingReferrals increase your chances of interviewing at Omnicom Media Group by 2xSee who you knowTurn on job alertsDatabase Administrator in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Sr. React Engineer", "company": "click and press pvt. ltd", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-21", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/sr-react-engineer-at-click-and-press-pvt-ltd-2295932896", "desct": "Sr. React EngineerKathmandu, Bāgmatī, NepalApply NowSr. React Engineerclick and press pvt. ltdKathmandu, Bāgmatī, Nepal6 days agoBe among the first 25 applicantsApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSr. React Engineeratclick and press pvt. ltd.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from click and press pvt. ltdKrishna GurungChief Technology Officer at Click and Press pvt. ltdAs a React Engineer, you are a self-motivated, lifelong learner with a passion for design and engineering. You love great UX. You like to keep up with the latest trends in the frontend and design world to ensure we are always using the best techniques possible. Beyond coding, you enjoy working in an evolving industry.Starting Salary: Rs 45,000 per monthWrite codes in React/JavascriptCollaborate closely with the development team to design and launch new featuresTest and troubleshoot the systemUtilize test-driven development practices for the codes generatedSuggest and improve the functionality of the existing systemUtilize best practices with the technologies to ensure effective and efficient processing of tasksPrevious experience working as a React.js DeveloperIn-depth knowledge of JavaScript,the DOM, CSS, HTML and front-end languagesKnowledge of REACT tools including React.js, hooks, ReduxExperience with user interface designKnowledge of performance testing frameworks including JestExperience with browser-based debugging and performance testing softwareExcellent troubleshooting skillsFamiliarity with RESTful APIsExperience using GitExcellent communication skills, both written and verbalExperience in cloud platforms such as AWSExperience working on content modeling is a plus pointIn-depth experience working on custom CMS integration and developmentAble to work well on a remoteShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeSearch for more jobs like thisTurn on job alertsSenior Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Salesforce Commerce Cloud Developer – Remote, Full-time", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/salesforce-commerce-cloud-developer-%E2%80%93-remote-full-time-at-toptal-2319242571", "desct": "Salesforce Commerce Cloud Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, NepalApply on company websiteSalesforce Commerce Cloud Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSalesforce Commerce Cloud Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAre you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you'll find remote freelance opportunities with leading global companies, on your terms.Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world's leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won't have to bid against other freelancers and can maintain a steady stream of work. It's the type of work/life balance that empowers you to travel the world, or stay at home. You're in control of shaping your environment to however you work best while establishing yourself as an elite developer.To learn more from Toptalers that made it big through freelancing, check out the following article: https://topt.al/V6cyVZSalesforce Commerce Cloud Developers In Our Elite Network ShareEnglish language proficiency3+ years of professional experienceExperience with the Salesforce Commerce Cloud is requiredFull-time availability is a strong advantageProject management skillsA keen attention to detailIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsSalesforceCommerceCloudShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Jitpur, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-azure-developer-%E2%80%93-remote-full-time-at-toptal-2319759135", "desct": "Senior Azure Developer – Remote, Full-timeToptalJitpur, NepalApply on company websiteSenior Azure Developer – Remote, Full-timeToptalJitpur, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Azure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAbout ToptalToptal is a network of the world's top software engineers, designers, finance experts, project managers, and product managers – available on demand to help companies accelerate, adapt, and scale. With $100+ million in annual revenue and triple-digit growth, Toptal is the largest fully distributed workforce in the world.Position DescriptionProviding a great service to our clients is crucial to us, and we're always looking for talented software developers to help us reach the next level.By joining our network, you'll have the opportunity to work on many different projects with various clients around the world and become part of a community of highly skilled developers. Over the past 10 years, Toptal has championed an ever-expanding community of experts unlike any other, and you could make a great fit to join our network.All of our network members are required to pass a sophisticated screening process, which is designed to ensure that our standards of quality for our clients remain consistently high.This is a remote position that can be done from anywhere; whether you prefer to work from a coworking space in your hometown, or travel the world and commit your code from exotic locations, you'll choose your preferred environment.ResponsibilitiesAfter passing our screening process, you will have access to our network of clients across the globe including leading Fortune 500s and innovative Silicon Valley start-ups.You will have full flexibility to set your working hours per week and your rate. There are no mandatory hours.You will have visibility into all projects published that fit your specialization. Our matching team is here to help you identify the projects that are the best fit for your skills and preferences.As a client-oriented company, we empower you to fully focus on client objectives. We ensure that you always get paid on time for the hours you spend working with clients.RequirementsYou must have 4+ years of full-time Azure and Python experience—preference given to candidates who have experience working for enterprise companies.You consider multiple quality dimensions like user impact, failure tolerance, code maintenance, implementation time, security breaches, and performance.You are genuinely interested in technology and love to try new things.You are willing to help clients make important product and development decisions, share your knowledge with them, and help them achieve their objectives. You solve complex problems but also consider multiple solutions, weigh them, and decide on the best course of action.You must be a world-class individual contributor to thrive at Toptal. You're excited about working independently while keeping all relevant stakeholders continuously informed and up-to-speed with any challenges, set realistic expectations, and deliver the desirable quality. You thrive on providing and receiving honest but always constructive feedback.Note: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.#RemoteJobsAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Jitpur, NepalOnOff"}, {"name": "Senior PHP Programmer", "company": "TekGro", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-24", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-php-programmer-at-tekgro-2298696747", "desct": "Senior PHP ProgrammerTekGroKathmandu, Bāgmatī, NepalApply NowSenior PHP ProgrammerTekGroKathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who TekGro has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior PHP ProgrammeratTekGro.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from TekGroMatrika SahDirector at TekGroTekGro is an Australian based digital marketing and SaaS (Software as a service) company operating since 2008. We are an innovative, high-tech, and versatile company who deliver exceptional 360 digital marketing services to clients throughout the world.Please Clic The Link Below To Learn More About Job :https://www.jobsnepal.com/moodle-developer-php-118821Show moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at TekGro by 2xSee who you knowTurn on job alertsSenior PHP Programmer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Python Software Engineer", "company": "Outcode Software", "address": "Bāgmatī, Nepal", "deadline": "2020-11-11", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/python-software-engineer-at-outcode-software-1933128964", "desct": "Python Software EngineerOutcode SoftwareBāgmatī, NepalApply NowPython Software EngineerOutcode SoftwareBāgmatī, Nepal2 weeks ago46 applicantsSee who Outcode Software has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePython Software EngineeratOutcode Software.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Outcode SoftwareEmmanuel Martinez 웃TechAbout OutCodeOutCode is a global software development firm that delivers technology solutions that improve business-facing quality of life by increasing ROI, effectiveness, & efficiency.Our DNA is made of ex-startup founders and the top talent in Product, UX/UI, Software development, and Machine Deep Learning. We came together from various backgrounds with one vision: to bring a lean, user-centric approach to product innovation and software development by completely understanding the business needs before building anything.We are looking for a Python Developer to join our engineering team and help us develop and maintain various software products.Python Developer responsibilities include writing and testing code, debugging programs and integrating applications with third-party web services. To be successful in this role, you should have experience using server-side logic and work well in a team.Ultimately, you’ll build highly responsive web applications that align with our business needs.ResponsibilitiesWrite effective, scalable codeDevelop back-end components to improve responsiveness and overall performanceIntegrate user-facing elements into applicationsTest and debug programsImprove functionality of existing systemsImplement security and data protection solutionsAssess and prioritize feature requestsCoordinate with internal teams to understand user requirements and provide technical solutionsRequirementsWork experience as a Python DeveloperExpertise in at least one popular Python framework (like Django, Flask or Pyramid)Knowledge of object-relational mapping (ORM)Familiarity with front-end technologies (like JavaScript and HTML5)Team spiritGood problem-solving skillsBSc in Computer Science, Engineering or relevant field (Preferred)Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Outcode Software by 2xSee who you knowTurn on job alertsPython Developer in Bāgmatī, NepalOnOff"}, {"name": "React Native Developer (Remote)", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/react-native-developer-remote-at-toptal-2319250666", "desct": "React Native Developer (Remote)ToptalKathmandu, Bāgmatī, NepalApply on company websiteReact Native Developer (Remote)ToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveReact Native Developer (Remote)atToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAre you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you'll find remote freelance opportunities with leading global companies, on your terms.Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world's leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won't have to bid against other freelancers and can maintain a steady stream of work. It's the type of work/life balance that empowers you to travel the world, or stay at home. You're in control of shaping your environment to however you work best while establishing yourself as an elite developer.To learn more from Toptalers that made it big through freelancing, check out the following article: https://topt.al/V6cyVZReact Native Developers In Our Elite Network ShareEnglish language proficiency2+ years of professional experienceExperience with React Native is requiredFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.#RemoteJobsReactNativeShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Swift Developer – Remote, Full-time", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-17", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/swift-developer-%E2%80%93-remote-full-time-at-toptal-2312797665", "desct": "Swift Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, NepalApply on company websiteSwift Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSwift Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsSwiftShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Ruby on Rails Developer", "company": "FuelPanda", "address": "Bāgmatī, Nepal", "deadline": "2020-11-05", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/ruby-on-rails-developer-at-fuelpanda-2277079706", "desct": "Ruby on Rails DeveloperFuelPandaBāgmatī, NepalApply NowRuby on Rails DeveloperFuelPandaBāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who FuelPanda has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveRuby on Rails DeveloperatFuelPanda.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from FuelPandaSagar Dev BhattaBusiness Leader at FuelPandaWe are looking for a Rails developer who is willing to work in a startup environment, learn and grow with the company. Your primary focus will be development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesConsumer ServicesReferrals increase your chances of interviewing at FuelPanda by 2xSee who you knowTurn on job alertsRuby on Rails Developer in Bāgmatī, NepalOnOff"}, {"name": "Dotnet Developer", "company": "DTRG Network", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-20", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/dotnet-developer-at-dtrg-network-2316234761", "desct": "Dotnet DeveloperDTRG NetworkKathmandu, Bāgmatī, NepalApply NowDotnet DeveloperDTRG NetworkKathmandu, Bāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who DTRG Network has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveDotnet DeveloperatDTRG Network.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from DTRG NetworkRasna KCJunior Software Analyst at International Friendship Children's  HospitalDTRG Network is a software company working to improve the health system in Nepal by introducing Electronic Hospital Recording and Management System. We have built software from the scratch in Nepal to cater to the hospital’s unique needs and provide technical support. We are looking for ambitious people who seek opportunities to grow themselves and be a part of our growing company.We are looking for a .Net developer to build software using languages and technologies of the .NET framework. You will create applications from scratch, configure existing systems and provide user support.The ideal candidate will be familiar with the full software design life cycle. They should have experience in designing, coding, testing and consistently managing applications They should be comfortable coding and have an ability to test code in order to maintain high-quality code.ResponsibilitiesParticipate in requirements analysisCollaborate with internal teams to produce software design and architectureWrite clean, scalable code using .NET programming languagesDevelop automated tests and conduct performance tuningRevise, update, refactor and debug codeImprove existing softwareDevelop documentation throughout the software development life cycle (SDLC)Serve as an expert on applications and provide technical supportQualificationsBachelor's degree in Computer Science or relevant fieldProven experience as a .NET Developer or Application DeveloperProven experience as a Web Application Developer in ASP .NETStrong Experience with the ASP.NET MVC framework, SQL Server and design patternsKnowledge of ASP .NET  C# and HTML/CSS, XML, JSONStrong Knowledge of Microsoft WCF and REST APIsUnderstanding of Agile methodologiesExcellent troubleshooting and communication skillsShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at DTRG Network by 2xSee who you knowTurn on job alertsDotnet Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Full Stack Engineer", "company": "Softyca Inc.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-14", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/full-stack-engineer-at-softyca-inc-2308779715", "desct": "Full Stack EngineerSoftyca Inc.Kathmandu, Bāgmatī, NepalApply NowFull Stack EngineerSoftyca Inc.Kathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who Softyca Inc. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveFull Stack EngineeratSoftyca Inc..Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Softyca Inc.Vijay NeupaneVisit softyca.orgEducation: Bachelor's degree in Computer Science or relevant field/ Masters' Degree preferredExperience: 6+ years (graduate before 2014 proffered)Type: Full TimeSalary: No bar for the deserving candidateWe are looking for a highly skilled Full Stack developer who is comfortable in developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside graphic designers for web design features, among other duties.Full Stack Developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.Full Stack Developer Requirements:.Strong organizational and project management skills.Proficiency with fundamental front end languages such as HTML, CSS and JavaScript.Familiarity with JavaScript frameworks such as Angular JS, React and Amber.Proficiency with server-side languages such as Python, Ruby, Java, PHP and .Net.Familiarity with database technology such as MySQL, Oracle and MongoDB.Excellent verbal communication skills.Good problem-solving skills.Attention to detail.Full Stack Developer Responsibilities:Developing front end website architecture.Designing user interactions on web pages.Developing back end website applications.Creating servers and databases for functionality.Ensuring cross-platform optimization for mobile phones.Ensuring responsiveness of applications.Working alongside graphic designers for web design features.Seeing through a project from conception to finished product.Designing and developing APIs.Meeting both technical and consumer needs.Staying abreast of developments in web applications and programming languages.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Softyca Inc. by 2xSee who you knowTurn on job alertsFull Stack Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Back End Developer", "company": "Jobssniper.com", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/back-end-developer-at-jobssniper-com-2319402818", "desct": "Back End DeveloperJobssniper.comKathmandu, Bāgmatī, NepalApply NowBack End DeveloperJobssniper.comKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Jobssniper.com has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveBack End DeveloperatJobssniper.com.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Jobssniper.comUjjwal PoudelCo-Founder at Jobssniper.comURGENT REQUIREMENT for \"Digital Marketing Agency\"Position: Senior Backend DeveloperNumber: 1Salary: NRs. 85,000/- or aboveEducation: BE Computer or equivalent computer streamExperience: At least 4 years’ experience as a backend developer.Location: Sanepa, LalitpurJD/JS:•\tPhp 7 and above•\tMySQL, MySQL Aurora is preferrable•\tNginx•\tCodeigniter Framework or Laravel Framework•\tMemory caching tools and technology like Redis, Memcached•\tNoSQL like Dynamo DB or Mongo•\tREST APIs•\tExperience with cloud tech service AWS / Azure•\tExperience with working on Linux system•\tExperience using and building composer packageFor more details:Contact No.: 9803053561/9864689377Email: hr@jobssniper.com#jobssniper #senior #backenddeveloper#jobs #careeropportunityShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesHuman ResourcesReferrals increase your chances of interviewing at Jobssniper.com by 2xSee who you knowTurn on job alertsBack End Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "iOS Developer", "company": "IME Group Nepal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/ios-developer-at-ime-group-nepal-2291608709", "desct": "iOS DeveloperIME Group NepalKathmandu, Bāgmatī, NepalApply NowiOS DeveloperIME Group NepalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who IME Group Nepal has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveiOS DeveloperatIME Group Nepal.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from IME Group NepalSuwash GautamManager at IME Ltd.SUMMARYWe are looking for a Full time iOS Developer who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications.JOB DESCRIPTIONDesign and build applications for the iOS platformDevelop and deploy well tested code and maintain code quality.Fix bugs and errors reported by end users, SDK and operation team.Work with the product and design teams to understand end-user requirements, formulate use cases.Ensure the best possible performance, quality, and responsiveness of the application.Collaborate with team to define, design, and include new features on the app.Integrate APIs as needed and stay up to date with latest trends.JOB SPECIFICATIONSBachelor of Computer Engineering or equivalent.At least 2 years of experience in building native iOS applications.A deep familiarity with Objective-C and Cocoa Touch.Good knowledge of iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text.KEY BENEFITS:Competitive Salary.5 Working Days.Festival Allowance.Provident Fund.Performance Bonus and Project IncentiveLife, Medical and Accidental Insurance.Allowances for Communication, Lunch, Fuel and Maintenance Expenses.Interested candidates are required to post their cover letter and resume along with their work experience and education if any and expected salary at hr@imegroup.com.npShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesFinancial ServicesReferrals increase your chances of interviewing at IME Group Nepal by 2xSee who you knowTurn on job alertsiOS Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Software Engineer", "company": "Digital Network Solution (DNS)", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-24", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-at-digital-network-solution-dns-2301922977", "desct": "Software EngineerDigital Network Solution (DNS)Kathmandu, Bāgmatī, NepalApply NowSoftware EngineerDigital Network Solution (DNS)Kathmandu, Bāgmatī, Nepal3 days agoBe among the first 25 applicantsSee who Digital Network Solution (DNS) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware EngineeratDigital Network Solution (DNS).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Digital Network Solution (DNS)Dibya KapaliDigital Marketing Executive | Social Media ManagerThe ideal candidate will be responsible for developing high-quality applications.Basic Job InformationJob Category                : Software EngineerJob Level                      : Mid LevelNo. of Vacancy/s          : [ 3 ]Employment Type        : Full TimeJob Location                 : NaxalOffered Salary              : NRs. 25,000.00 - 40,000.00 MonthlyApply Before(Deadline): 30th November 2020Job SpecificationEducation Level          : Bachelor’s degree in Computer Engineering or a relevant subject.Experience Required  : More than or equals to 2 yearsMust-Have Skills:Hands-on knowledge on development in .Net technology stackStrong knowledge of MVC FrameworksFamiliarity with architecture styles/APIs (REST)Familiarity with third-party software integration.Software development experience.Experience working with source control systems, such as Subversion, GIT, etc.Knowledge of DBMS system like MSSQL would be added value.Knowledge of Windows/Linux system deployment would be added value.Knowledge of the Hospital management system would be a plus point.Other Skills:Excellent interpersonal communication and teamwork skillsAbility to communicate in Nepali, Hindi, and English language.Ability to understand and utilize new technologies quicklyExcellent analytical and problem-solving skillsHospital experience would be added value.Job DescriptionUnderstanding business requirements and technical documentsTranslate business requirements, design into a functional unitActive participation in project-level discussion/meetingMaintain legacy system and implement the new requirements in the best possible wayPrepare Technical/flow diagramPrepare documentation of the changes in the legacy software system.Software support on Hospital Management System.Interested candidate, please mail your CV and cover letter to careers@digitalnetwork.com.npShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at Digital Network Solution (DNS) by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Junior Android Developer", "company": "Bankaks", "address": "Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/junior-android-developer-at-bankaks-2298673736", "desct": "Junior Android DeveloperBankaksNepalApply NowJunior Android DeveloperBankaksNepal3 days ago32 applicantsSee who Bankaks has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJunior Android DeveloperatBankaks.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from BankaksAndrés AlbaIT and Management Consultant - Tech leaderBankaks is a Spanish tech startup looking for IT professionals wanting to be part of the team that will be responsible for maintaining, adapting and scaling up the whole platform. We are currently hiring a young, talented and analytical Android Developer that wants to join a powerful team to boost his skills and gains an overall new different experience related to working with a startup. Your primary focus will be developing high-end Android applications for the latest Android mobile devices.ResponsibilitiesDesign and build advanced applications for the Android platformCollaborate with cross-functional teams to define, design, and ship new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performancePublishing application to the Google Play StoreContinuously discover, evaluate, and implement new technologies to maximize development efficiencyRequirementsBachelor’s degree in Computer Science or Software Engineering.0 - 2 years proven software and app development experience and Android skills developmentHave published at least one original Android appExperience with Android SDKExperience working with remote data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologiesSolid understanding of the full mobile development life cycle.Strong knowledge of Android UI design principles, patterns, and best practicesUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of code versioning tools, such as GitFamiliarity with continuous integrationExperience working with Agile Methodologies, preferably ScrumCritical thinker and strong problem-solving skillsTeam player plus great interpersonal and communication skillsExcellent written and verbal communication skills.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeIndustriesInternetReferrals increase your chances of interviewing at Bankaks by 2xSee who you knowTurn on job alertsAndroid Developer in NepalOnOff"}, {"name": "Commercial Product Development", "company": "Downtown Recruitment", "address": "Thame, England, United Kingdom", "deadline": "2020-11-12", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/commercial-product-development-at-downtown-recruitment-2306428069", "desct": "Commercial Product DevelopmentThame, England, United KingdomApply on company websiteCommercial Product DevelopmentDowntown RecruitmentThame, England, United Kingdom2 weeks agoBe among the first 25 applicantsApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveCommercial Product DevelopmentatDowntown Recruitment.Email or phonePasswordShowForgot password?Sign inReport this jobMy client, based just outside Thame, is looking for a Commercial Product Developer to join their small but established company. They provide packaging for the drinks industry and are well established and respected within their field.As Commercial Product Developer you will be responsible for taking a brief from a Business Development Manager or directly from the customer for a new, replacement or bespoke product and ensuring that the product is delivered on time and to full specification. This will involve providing samples, pricing and advice to clients to ensure their product requirements are met.The skills you will need to be a successful Commercial Product Developer include the ability to build strong relationships with customers and internal departments, be commercially aware, organised and analytical with excellent communication skills, numerical ability and be confident in presenting information to internal departments and to the business team based in Spain. This is a busy role and key to the success of the business, therefore you must have previous experience in a similar role and if you have knowledge of the drinks or packaging industries, this is a distinct advantage. Some basic knowledge of Spanish would also be beneficial.This is a stable and generous company who look after their team and pride themselves on staff retention. They offer some great benefits including death in service, non-contributory pension, 20 days holiday plus Christmas shutdown and bank holidays.Working hours are 8-5 Monday to Friday with an hour for lunch and salary for this role is 25-27k depending on experienceShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionProduct ManagementMarketingIndustriesStaffing and RecruitingRetailFinancial ServicesSearch for more jobs like thisTurn on job alertsProduct Development Specialist in Thame, England, United KingdomOnOff"}, {"name": "Software Engineer - Java Developer", "company": "Verisk", "address": "Lalitpur, Bāgmatī, Nepal", "deadline": "2020-10-15", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-java-developer-at-verisk-2277306957", "desct": "Software Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, NepalApply NowSoftware Engineer - Java DeveloperVeriskLalitpur, Bāgmatī, Nepal1 month agoBe among the first 25 applicantsSee who Verisk has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - Java DeveloperatVerisk.Email or phonePasswordShowForgot password?Sign inReport this jobCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized byForbesas a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionDesign, implement and maintain java applicationTo take part in software and architectural development activitiesWrite well designed, testable, efficient codeEnsure designs follow specificationsPrepare and produce releases of software componentsRecommend changes to improve established java application processesQualificationsBS degree in Computer Science, Engineering or a related subject2 to 3 years of professional experience in Java based application developmentSkills And KnowledgeMust have passion for development and ability to learn latest technologiesExcellent understanding of object-oriented design concepts and software development processes and methods.Expertise in application, data and infrastructure architecture disciplinesGood knowledge of architecture, design and business processesDemonstrated ability to work independently with minimal supervision.Possess strong troubleshooting, code optimization and refactoring skills.Technical ExperienceMandatory skills – the person must be STRONG in each discipline and will have to explain in detailJava, J2EE Framework, RESTful web services pattern, Spring Framework, JavaScript frameworks (JQuery, AngularJS, and EmberJS), SQL and NoSQL databases (preferably MongoDB, MSSQL and/or Postgres), RabbitMQ/SQS, Solr/Lucene/Elastic Search, Tomcat, SVN, GIT, Test-Driven DevelopmentExperience working on the JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Experience in cloud and serverless technology (preferably AWS) would be a major plus pointProficient experience working with Maven, Jenkins, Chef, CodeDeploy, Bamboo, Octopus or any CI/CD tools and understand of continuous integration/continuous delivery. Willing and able to work with DevOps team and contribute to CI/CDExperience working in an Agile development processKnowledge of AWS LAMBDA and monitoring tools such as Solar winds and New Relic would be a plusAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy NoticeShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareFinancial ServicesReferrals increase your chances of interviewing at Verisk by 2xSee who you knowTurn on job alertsSoftware Engineer in Lalitpur, Bāgmatī, NepalOnOff"}, {"name": "Flutter Developer", "company": "Neplancer Tech", "address": "Nārāyanī, Nepal", "deadline": "2020-11-25", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/flutter-developer-at-neplancer-tech-2304918793", "desct": "Flutter DeveloperNārāyanī, NepalApply NowFlutter DeveloperNeplancer TechNārāyanī, Nepal2 days agoBe among the first 25 applicantsApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveFlutter DeveloperatNeplancer Tech.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Neplancer TechPrabesh WaglePython Developer at Neplancer TechFlutter DeveloperShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeSearch for more jobs like thisTurn on job alertsSoftware Engineer in Nārāyanī, NepalOnOff"}, {"name": "Senior Java Software Engineer", "company": "Pagoda Labs", "address": "Lalitpur District, Nepal", "deadline": "2020-11-04", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-java-software-engineer-at-pagoda-labs-2273266156", "desct": "Senior Java Software EngineerPagoda LabsLalitpur District, NepalApply NowSenior Java Software EngineerPagoda LabsLalitpur District, Nepal3 weeks agoBe among the first 25 applicantsSee who Pagoda Labs has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Java Software EngineeratPagoda Labs.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Pagoda LabsBijay ShresthaWeb Developer at Pagoda Labs Pvt. Ltd.We are hiring Senior Java Springboot Developer developer to join our team.Experience:2+ yearsCore TechnologyJava (1.8)Spring Boot (1.3.8)Maven (3.0.0)JUnit (4.13)Unix/Linux, Web/Application server like Tomcat or WebSpherePostgres (9.4) / MYSQL / SQL ServerProficient in CSS, HTML, and writing cross-browser compatible code (preferred).Proven experience implementing front-end and back-end JavaScript applications.Significant experience building large-scale, distributed, high-volume systems.You Should Have:A portfolio with live links to sites that you have developed previously (preferred)Object oriented programmingExperience working in an Agile development processThe ability to handle multiple projects and tasks at the same timeGreat attention to detail and be highly organizedA reliable workstation with a fast internet, for calls.The ability to work hours similar to the rest of the Coalition Team (9am-6pm NST)The ability to articulate yourself professionallyExcellent written and spoken English and NepaliThe ability to adapt in a diverse and multicultural environmentA positive and upbeat attitudeYour Duties and Tasks:Work daily in Java, Postgres, JavaScript, JQueryBuild Java web applications and other platformsResolve cross-browser compatibility issuesWrite clean structured and well-documented codeIntegrate data with third party applications and APIs in general and ERP/stock management systemsHow to applyDrop your resume at hello@pagodalabs.comIndustryComputer SoftwareEmployment TypeFull-timeShow moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Pagoda Labs by 2xSee who you knowTurn on job alertsSenior Java Software Engineer in Lalitpur District, NepalOnOff"}, {"name": "Shopify Software Engineer", "company": "Outcode Software", "address": "Bāgmatī, Nepal", "deadline": "2020-11-19", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/shopify-software-engineer-at-outcode-software-2264280367", "desct": "Shopify Software EngineerOutcode SoftwareBāgmatī, NepalApply NowShopify Software EngineerOutcode SoftwareBāgmatī, Nepal1 week agoBe among the first 25 applicantsSee who Outcode Software has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveShopify Software EngineeratOutcode Software.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Outcode SoftwareEmmanuel Martinez 웃TechAbout OutcodeOutcode is a global software development firm that delivers technology solutions that improve business-facing quality of life by increasing ROI, effectiveness, & efficiency.Our DNA is made of ex-startup founders and the top talent in Product, UX/UI, Software development, and Machine Deep Learning. We came together from various backgrounds with one vision: to bring a lean, user-centric approach to product innovation and software development by completely understanding the business needs before building anything.As a Shopify Developer with Outcode, your goal is to create attractive and user-friendly websites according to design and functionality specifications. We work on a diverse portfolio of client projects, and our engineers get to solve challenging technical problems at scale.This role is a part-time contract position with the potential to convert to a full-time position.Specifically, you will…Build flawless and efficient e-commerce sitesImplement back-end code, vendor integrations, and app/plugin development for Shopify Plus Translate static mockups into working interactive experiences and templatesCreate user-friendly web pages and developing new user-facing and mobile-based featuresRequirementsEXPERIENCEA history of architecting, building, and maintaining excellent Shopify sites with clean codeFamiliarity with some Continuous Integration tools a plusKnowledge of the e-commerce technology ecosystem and associated stacks (shopping cart, API integrations, credit card processing, tax engine, digital distribution, etc).Experience with Shopify theme and app development as well as experience in Shopify PlusKnowledge of front-end programming languages and technologies such as vanilla Javascript, HTML5, CSS3, Shopify Polaris, and jQueryFamiliarity with React a plusBuilding responsive interfaces and debugging for a variety of devices and browsersStrong eye for aesthetics and attention to detailExperience conducting website performance tests and troubleshooting content issuesWillingness to take extreme ownership of your workBenefitsCompetitive payFully remote company cultureOpportunity to work on cool projects with amazing people!Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeIndustriesComputer SoftwareReferrals increase your chances of interviewing at Outcode Software by 2xSee who you knowTurn on job alertsSoftware Engineer in Bāgmatī, NepalOnOff"}, {"name": "Wordpress Developer", "company": "Nerd Platoon", "address": "Bhaktapur, Bāgmatī, Nepal", "deadline": "2020-11-13", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/wordpress-developer-at-nerd-platoon-2224797527", "desct": "Wordpress DeveloperNerd PlatoonBhaktapur, Bāgmatī, NepalApply NowWordpress DeveloperNerd PlatoonBhaktapur, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who Nerd Platoon has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveWordpress DeveloperatNerd Platoon.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Nerd PlatoonPrashant SharmaCo-Founder and Software Engineer at Nerd PlatoonIf you have the following skills then we would like to hear about it:● 3+ years of experience working with WordPress and web development.● A strong passion for web development● A willingness to work with others● Strong verbal/written communication skills● Advanced knowledge of HTML/CSS/JavaScript● Experience with using API's/Web Services● Strong understanding of PHP/mySQL● Experinced in PHP and Wordpress● Proficient knowledge of web standards● A full understanding of web accessibility● Experience with WordPress development● Good understanding of WordPress API● An ability to multi-task● An ability to work under pressure to meet deadlines● Must have excellent English written and oral communication skillsShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer SoftwareReferrals increase your chances of interviewing at Nerd Platoon by 2xSee who you knowTurn on job alertsWordpress Developer in Bhaktapur, Bāgmatī, NepalOnOff"}, {"name": "Senior Azure Developer – Remote, Full-time", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-23", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-azure-developer-%E2%80%93-remote-full-time-at-toptal-2319765185", "desct": "Senior Azure Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, NepalApply on company websiteSenior Azure Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Azure Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobAbout ToptalToptal is a network of the world's top software engineers, designers, finance experts, project managers, and product managers – available on demand to help companies accelerate, adapt, and scale. With $100+ million in annual revenue and triple-digit growth, Toptal is the largest fully distributed workforce in the world.Position DescriptionProviding a great service to our clients is crucial to us, and we're always looking for talented software developers to help us reach the next level.By joining our network, you'll have the opportunity to work on many different projects with various clients around the world and become part of a community of highly skilled developers. Over the past 10 years, Toptal has championed an ever-expanding community of experts unlike any other, and you could make a great fit to join our network.All of our network members are required to pass a sophisticated screening process, which is designed to ensure that our standards of quality for our clients remain consistently high.This is a remote position that can be done from anywhere; whether you prefer to work from a coworking space in your hometown, or travel the world and commit your code from exotic locations, you'll choose your preferred environment.ResponsibilitiesAfter passing our screening process, you will have access to our network of clients across the globe including leading Fortune 500s and innovative Silicon Valley start-ups.You will have full flexibility to set your working hours per week and your rate. There are no mandatory hours.You will have visibility into all projects published that fit your specialization. Our matching team is here to help you identify the projects that are the best fit for your skills and preferences.As a client-oriented company, we empower you to fully focus on client objectives. We ensure that you always get paid on time for the hours you spend working with clients.RequirementsYou must have 4+ years of full-time Azure and Python experience—preference given to candidates who have experience working for enterprise companies.You consider multiple quality dimensions like user impact, failure tolerance, code maintenance, implementation time, security breaches, and performance.You are genuinely interested in technology and love to try new things.You are willing to help clients make important product and development decisions, share your knowledge with them, and help them achieve their objectives. You solve complex problems but also consider multiple solutions, weigh them, and decide on the best course of action.You must be a world-class individual contributor to thrive at Toptal. You're excited about working independently while keeping all relevant stakeholders continuously informed and up-to-speed with any challenges, set realistic expectations, and deliver the desirable quality. You thrive on providing and receiving honest but always constructive feedback.Note: We are looking for talent who are able to freelance on a full time basis.Ready for a career shift to impactful freelance work? Click apply to take our short assessment and find out if you have what it takes to join Toptal.#RemoteJobsAzureShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionOtherIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsCloud Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Javascript Developer", "company": "Cloudyfox", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-26", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/javascript-developer-at-cloudyfox-2307864565", "desct": "Javascript DeveloperCloudyfoxKathmandu, Bāgmatī, NepalApply NowJavascript DeveloperCloudyfoxKathmandu, Bāgmatī, Nepal16 hours agoBe among the first 25 applicantsSee who Cloudyfox has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJavascript DeveloperatCloudyfox.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from CloudyfoxSanjeev ThapaDirector Of Technology Services at Aximpro GmbHWe are looking for Sr Node.js developer to join our team.Skills:- node.js- express- graphql/rest- tdd- aws lambdaShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at Cloudyfox by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Software Engineer - QA", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-02", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-qa-at-cloudfactory-2266773663", "desct": "Software Engineer - QACloudFactory.Kathmandu, Bāgmatī, NepalApply NowSoftware Engineer - QACloudFactory.Kathmandu, Bāgmatī, Nepal4 weeks ago26 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - QAatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionEngineers on our team enjoy solving business problems using technology and understand the day-to-day technical challenges that are part of complex software. You'll be working with engineers to identify testing and deployment challenges. You will use the right testing methods and tools to eliminate the challenges. You will contribute to the platform test strategy and plan that directly helps in improving the development process and quality of the platform.RequirementsYou willParticipate in the discussion and review of project deliverables including requirement specifications, functional design documents, test design and technical design documents.Design test plan and test cases that ensure effective test coverage for Web, API, and Infrastructure domainsPerform peer reviews on test plan and test case designReview business requirements for testability and maintain traceability to test casesParticipate in cross-group and internal customer feature demosParticipate and support release deployments and validationContribute to an existing automation test suiteOrganise and design release plan and deployment strategy.Execute deployment in a production environment and use tools to monitor the deploymentWrite and document processes, policies, practices and decisionsMust-HavesStrong demonstrable knowledge on working of Web, API, Databases, Microservice Architecture, Messaging systemsHands on in scripting languages like JavaScript, Python, or RubyProficient in unit and integration testing paradigms2+ years of experience in testing Web, API based applicationsEffective communication skills in oral and writingWrite and document processes, policies, practices and decisionsA desire for continuous learningNice to HaveExperience working in IaaS, PaaS and SaaS tools. AWS in particularExperience working in Selenium or any other automation frameworksExperience working in the release and deployment processExperience working in a distributed teamGrowth OpportunitiesUpskill into a well-rounded engineer especially on release and infrastructure, and test automation side of the development processLearn other development technologies used at CloudFactoryWork with amazing talents across the globeTechnologies We UseLanguages: Ruby, Go, Java, Python, C++, JS, R, C#Operating Systems: Linux, OSX, WindowsConfiguration Management: Ansible, AWS CloudFormationVersion Control: GitHub, GitLabOther: AWS product suite, Docker, Ruby on Rails, Node, Electron, Meteor, React, Selenium, PowerBIBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Android Developer", "company": "QPay Private Limited", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-22", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/android-developer-at-qpay-private-limited-2295988051", "desct": "Android DeveloperQPay Private LimitedKathmandu, Bāgmatī, NepalApply NowAndroid DeveloperQPay Private LimitedKathmandu, Bāgmatī, Nepal5 days agoBe among the first 25 applicantsSee who QPay Private Limited has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveAndroid DeveloperatQPay Private Limited.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from QPay Private LimitedDinesh RijalSenior Software Engineer Mobile Team lead at QPay Solutions  Private Limited- Minimum 2 years experience in native android development- Experienced with kotlin- Knowledge with android architecture component ( Live data , view model, ROOM, dragger, coroutine , data binding)- Good knowledge on RESTFUL API, JSON, XML- Knowledge of version control tools such as gitShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesComputer & Network SecurityReferrals increase your chances of interviewing at QPay Private Limited by 2xSee who you knowTurn on job alertsAndroid Developer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "Senior Software Engineer - Test Automation", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-02", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-software-engineer-test-automation-at-cloudfactory-2266773661", "desct": "Senior Software Engineer - Test AutomationCloudFactory.Kathmandu, Bāgmatī, NepalApply NowSenior Software Engineer - Test AutomationCloudFactory.Kathmandu, Bāgmatī, Nepal4 weeks agoBe among the first 25 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior Software Engineer - Test AutomationatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionEngineers on our team enjoy solving business problems using technology and understand the day-to-day technical challenges that are part of complex software. You'll be working with engineers to identify and eliminate quality bottlenecks and develop automated solutions that keep the quality of the software at the industry standard level.. Your solution also speeds the development and delivery of the software. You enjoy building automation framework from scratch and also comfortable working with an existing framework.RequirementsYou willParticipate in the discussion and review of project deliverables including requirement specifications, functional design documents, test design and technical design documents.Design testing strategy for Web, API, and Infrastructure platformsDesign, develop, and deploy scalable end to end automation solutions that speed up our Continuous Delivery solution.Evaluate testing technologies and tools for their effectiveness and make recommendations on their choicesPerform peer reviews and provide feedback on code design, test designs and test suiteReview business requirements for testability and maintain traceability to test casesParticipate in cross-group and internal customer feature demosPublish quality outcomes and design plans to improve themParticipate and support release deployments and validationWrite and document processes, policies, practices and decisionsMust-HavesStrong demonstrable knowledge on working of Cloud Architecture, Web, API, Databases3+ years of experience building and maintaining end to end automation framework in CI/CD platform at scaleSolid 3+ years of work experience in Java and Selenium WD/TestNGProficient in unit and integration testing paradigms.Effective communication skills in oral and writingExperience working in IaaS, PaaS and SaaS tools. AWS, in particular, would be greatExperience working in a distributed team would be nice to haveExperience working in release and deployment would be nice to haveA desire for continuous learningGrowth OpportunitiesUpskill into a well-rounded engineer especially on release and infrastructure side of the development processTake lead in testing, release and deployment domain of complex projectsLearn other development technologies used at CloudFactoryWork with amazing talents across the globeMentoring other engineersTechnologies We UseLanguages: Ruby, Go, Java, Python, C++, JS, R, C#Operating Systems: Linux, OSXConfiguration Management: Ansible, AWS CloudFormationVersion Control: GitHub, GitLabOther: AWS product suite, Docker, Ruby on Rails, Node, Electron, Meteor, React, Selenium, PowerBIBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelAssociateEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsSenior Software Engineer in Kathmandu, Bāgmatī, NepalOnOff"}, {"name": "PHP/Vue Developer (Back-end)", "company": "Apiera", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2020-11-22", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/php-vue-developer-back-end-at-apiera-2318844504", "desct": "PHP/Vue Developer (Back-end)Kathmandu, Bāgmatī, NepalApply NowPHP/Vue Developer (Back-end)ApieraKathmandu, Bāgmatī, Nepal5 days agoBe among the first 25 applicantsApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePHP/Vue Developer (Back-end)atApiera.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from ApieraShrijan Bir MalakarHead Of Operations at ApieraApiera is looking for a mid to senior PHP/Vue developer(Preferred experience on Vue.js/Laravel/PHP)Ideally: self-motivated, proactive, result-oriented, best practises, hard-working, Go-getter...PHP/Vue Developer (Back-end )Position: Senior/Mid-levelWork Environment: RemoteEmployment Type: Full-time / Part-time(Minimum 25hrs/week)Salary: Depends on Experience. No bar for Deserving Candidate.Our hiring process for this vacancy:1) CV review2) Technical evaluation test3) HR interview4) OfferThe focus of your role:PHP Developer is responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.Apply by filling the form: https://forms.gle/MgGPKfxXPDkCUgwo6Please feel free to inquire at hello@apiera.co.ukShow moreShow lessSeniority levelNot ApplicableEmployment typePart-timeSearch for more jobs like thisTurn on job alertsPHP Developer in Kathmandu, Bāgmatī, NepalOnOff"}]