[{"name": "Javascript Developer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2 weeks ago", "desct": "Javascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowJavascript DeveloperMoru Digital WalletKathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveJavascript DeveloperatMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletHiring For React Native DeveloperJob description:Develop React Native applications for both iOS and AndroidBuild reusable components and front-end libraries for future useLeverage native APIs for deep integrations with both platforms.Create UI Screen and Modules in both iOS and Android and integrate with React Native applicationDiagnose and fix bugs and performance bottlenecks for performance that feels native.Create software code, unit tests and assist with encoding, testing, debugging, and documentation.Review requirements, wireframes, and designs for technical feasibility, work with the scrum team to translate these into user stories that can be implementedImprove product quality through code reviews, writing effective unit tests, and collaborating with QA to implement automation testing where appropriateWork closely with Backend team for the product’s admin setup.Required Candidate profileMinimum 2 year relevant and real time experience in ReactNative.Strong JavaScript fundamentals and ES6 knowledge, ReactNative / NodeJS, MVC, Design Patterns, REST APIs, Swagger, AWS and GAEFamiliarity with state/data management libraries (Redux, Mobx) is a plus.Strong debugging skills with the ability to reach out and work with peers to solve complex problemsFamiliarity with code versioning tools such as GitKnowledge of general mobile landscape, architectures, trends, and emerging technologies.Experience in automated testing suites, like Jest/ Mocha/ Express is a plus.Experience with Agile Development mythology.Candidate should have strong communication skills, should be able to work independently & provide guidance to junior/other team membersAmbitious, willing to work hard and invest in building a great career.Candidate who care more about what they learn and the impact they make.Take ownership of all tasks.Believe in work-life integration. passion > work-life balance.Must have experience into Android/ IOS DevelopmentMust have experience in Hybrid apps DevelopmentWilling to work with cross-platform frameworksExperience with consuming REST API’sKindly share your CV on sp@moru.com.npShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/javascript-developer-at-moru-digital-wallet-2211129923?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Engineer - Front End Developer", "company": "Verisk", "address": "Lalitpur, Bāgmatī, Nepal", "deadline": "1 month ago", "desct": "Software Engineer - Front End DeveloperVeriskLalitpur, Bāgmatī, NepalApply NowSoftware Engineer - Front End DeveloperVeriskLalitpur, Bāgmatī, Nepal1 month agoBe among the first 25 applicantsSee who Verisk has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Engineer - Front End DeveloperatVerisk.Email or phonePasswordShowForgot password?Sign inReport this jobCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized byForbesas a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionResponsibilities -Make design and technical decisions for Angular projectsPerform unit testing by using different frameworks like Jasmine, KarmaBe involved in all phases of the agile software development lifecycleProactively seek out and minimize pain points within the infrastructure and code baseKeep up to date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesCommunicate proactively with Business stakeholders and provide design suggestionsAnalyze, debug and fix defectsQualificationsEducation Level:Bachelor’s in Computer Science, or related field or equivalent experienceExperience Required:At least 3 years of professional experience in JavaScript / Angular TechnologySkills And Knowledge -Passion for programming in general, rather than a specific languageBe focused, passionate, and strive to find simple solutions to complex problemsAbility to learn new, emerging technologiesYou have a solid general understanding of application components, what happens on the front end, what happens on the back end.You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the aboveAbility to effectively work on multiple projects simultaneously and effectively contend with competing prioritiesPossess strong troubleshooting, code optimization and refactoring skillsHave strong sense of ownership with demonstrated ability to work independently without supervisionTechnical ExpertiseJavaScript frameworks (Angular 4+ - preferably the latest verison, AngularJS, React, jQuery), RxJs, Redux, Web markup languages (HTML/HTML5, XML) and Style sheet language (CSS/CSS3), SASS, LESSWell versed in using UX and UI design tools like Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe XDExperience in working with using html frameworks like Bootstrap and FoundationWriting tested and documented JavaScript withExpertise in build processes (Angular CLI, Webpack)Experienced in writing test cases and performing unit testing using frameworks (ex. Jasmine, Karma)Used DevOps and CI/CD in previous work experienceDeveloped software in SCRUM environment using Agile methodologies and involved in SDLC processAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy NoticeShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareFinancial ServicesReferrals increase your chances of interviewing at Verisk by 2xSee who you knowTurn on job alertsSoftware Engineer in Lalitpur, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-engineer-front-end-developer-at-verisk-2277354229?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Front End Web Developer", "company": "CloudFactory.", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2 weeks ago", "desct": "Front End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, NepalApply NowFront End Web DeveloperCloudFactory.Kathmandu, Bāgmatī, Nepal2 weeks ago75 applicantsSee who CloudFactory. has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveFront End Web DeveloperatCloudFactory..Email or phonePasswordShowForgot password?Sign inReport this jobDescriptionCloudFactory’s mission is to help visionary companies power disruptive technology while connecting 1 million people in the developing world to meaningful work. We are looking for ambitious people who seek greater meaning in their work and want to use their talents to make the world a better place.For companies from startup to enterprise, CloudFactory provides a tech-forward, professionally managed workforce solution for routine data work. Our teams are agile, scale fast, and help innovators get their technology to market fast. Trusted by 100+ companies, CloudFactory processes millions of tasks every week for companies including Microsoft, Drive.ai, Expensify, Ibotta, and GM-Cruise Automation.At CloudFactory, we believe that talent is equally distributed, but opportunity is not. Founded in Nepal in 2008, we connect people to digital work and give them the skills to be leaders in their own communities. We’re on a mission to create economic and leadership opportunities for talented people in developing nations. As an impact sourcing service provider (ISSP) and recipient of a program related investment from The Rockefeller Foundation, we are a global leader in the impact sourcing movement.With $13 million in venture capital raised and 100%+ growth year over year, we are expanding our business quickly and sustainably. Our headquarters is in Reading, U.K., and we have offices in Kathmandu, Nepal; Nairobi, Kenya; and Durham, N.C.Join us and make a difference in the world!ResponsibilitiesUsing HubSpot’s CMS, work with the CloudFactory marketing team to maintain and build upon CloudFactory’s website, microsites, and other digital assetsProvide technical assistance in maintaining CloudFactory’s digital assets in an agile environmentOptimize our website and landing pages for speed and related search engine indexing and performance metrics (SEO)Analyse marketing data, understand user behavior and experience, and systematically map out UI/UX improvement suggestionsProvide technical assistance as the team launches and iterates on various marketing campaignsRequirements1+ year of experience in web developmentFluency in HTML and CSS. Ability to handcraft web pages and formsKnowledge of JavaScript (and jQuery) for client-side scriptingAbility to add interactive behaviors in web pagesAble to work with JSON data using JavaScriptProficient understanding of responsive design and cross-browser (Google Chrome, Firefox, & IE) compatibilityUnderstanding of web design and development best practicesExcellent analytical, problem-solving, and communication skillsInsatiable curiosity about the latest and greatest tools, hacks, and optimization strategiesExcellent written communication skills (English) with keen attention to detailHelpful SkillsFamiliar with Photoshop or other graphic design tools such as Canva are desirableKnowledge of Google analytics, SEO, Google Search Console, and Inbound Marketing are big plusesExperience using Hotjar or similar apps is a big plusExperience in B2B — high-tech products and services preferredThese HubSpot certifications (in this priority order) are a plus:Growth Driven DesignDesignMarketing SoftwareSEOInboundBenefitsLunch & Snacks Provided Monday-FridayPhone Allowance and/or Internet AllowanceTravel AllowanceSocial Security FundFestival BonusHealth Spending AccountMedical InsuranceAccidental InsuranceAmazing Company Mission and CultureGrowth OpportunitiesShow moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesComputer SoftwareInternetReferrals increase your chances of interviewing at CloudFactory. by 2xSee who you knowTurn on job alertsFrontend Web Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/front-end-web-developer-at-cloudfactory-2209358538?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Android Developer", "company": "Cloudyfox", "address": "Bāgmatī, Nepal", "deadline": "3 weeks ago", "desct": "Android DeveloperCloudyfoxBāgmatī, NepalApply NowAndroid DeveloperCloudyfoxBāgmatī, Nepal3 weeks agoBe among the first 25 applicantsSee who Cloudyfox has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveAndroid DeveloperatCloudyfox.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from CloudyfoxSanjeev ThapaDirector Of Technology Services at Aximpro GmbHWe are looking for experienced kotlin developer to join our team ideally with an experience of leading a small team.Show moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Cloudyfox by 2xSee who you knowTurn on job alertsAndroid Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/android-developer-at-cloudyfox-2204901586?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Senior MS-SQL Developer", "company": "COTIVITI NEPAL (formerly Verscend Nepal)", "address": "Bāgmatī, Nepal", "deadline": "2 weeks ago", "desct": "Senior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, NepalApply NowSenior MS-SQL DeveloperCOTIVITI NEPAL (formerly Verscend Nepal)Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who COTIVITI NEPAL (formerly Verscend Nepal) has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior MS-SQL DeveloperatCOTIVITI NEPAL (formerly Verscend Nepal).Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from COTIVITI NEPAL (formerly Verscend Nepal)Sheela SharmaAssociate Manager Human Resources at COTIVITI NEPAL PVT. LTD. formerly known as Verscend Technologies Pvt. Ltd.Position: Senior MS-SQL DeveloperResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.QUALIFICATIONS AND EDUCATION REQUIREMENTSBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLSMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.PREFERABLE SKILLSExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)SOFT SKILLSAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueShow moreShow lessSeniority levelMid-Senior levelEmployment typeFull-timeJob functionInformation TechnologyIndustriesInformation Technology and ServicesReferrals increase your chances of interviewing at COTIVITI NEPAL (formerly Verscend Nepal) by 2xSee who you knowTurn on job alertsSQL Developer in Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/senior-ms-sql-developer-at-cotiviti-nepal-formerly-verscend-nepal-2220508772?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Principal Software Engineer (Remote) - $400,000/year USD", "company": "DevFactory", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "3 hours ago", "desct": "Principal Software Engineer (Remote) - $400,000/year USDDevFactoryKathmandu, Bāgmatī, NepalApply NowPrincipal Software Engineer (Remote) - $400,000/year USDDevFactoryKathmandu, Bāgmatī, Nepal3 hours agoBe among the first 25 applicantsSee who DevFactory has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePrincipal Software Engineer (Remote) - $400,000/year USDatDevFactory.Email or phonePasswordShowForgot password?Sign inReport this jobAre you the best software architect in your company? Can you identify patterns in complex systems and see ways to make them 10x simpler? Do you enjoy designing software that maximizes use of existing code? Do you wish you could expand your technical career without requiring more and more time on HR and project management? If so, you’ll love our approach of driving the direction of products starting with the core technology.In this role you will join a very passionate and experienced team responsible for all of the important technical decisions on every product in our large portfolio of enterprise software solutions. You’ll spend your time making the most important technical design decisions, such as:What are the core data structures used by the app? Why were they chosen? How are they mapped or applied to the domain of the problem? What were the tradeoffs or alternatives?Are there any important or valuable algorithms? What insights led to choosing them?Are important third-party components/technologies used? Why were they selected? Are they the right ones today? Were they ever?Are there any components of the system that create valuable and differentiated capability relative to competitors? Why? (we call this “TechDiff”)What was the design and reasoning behind the important internal and external APIs?Identify and explain the rationale behind important technical dependencies or limitations this product has. Can you think of new and creative ways to overcome them?Can the product be broken down logically into smaller, more manageable components? Are there well-defined interfaces, or seams, between those components? Or are they all interconnected?What is the critical opinion of a fresh set of eyes when looking at old decisions? Are there architecture or design anti-patterns present in the fundamental technical decisions?In this role you will also learn and practice the high-impact skill of clear written communication, as this enables your scale and broad impact across the organization.What You Will Be DoingEach week you will have a different design problem to work on and technical spec to create. The assignments may make iterative progress on a larger problem, or be smaller and targeted design problems. You will have the opportunity to learn and work on a wide variety of products with distinct tech stacks and business domains so you will be continuously challenged. You will uncover the “high-order bit” decisions by interviewing other product CTOs, analyzing the data structures and analyzing code and design documents. Finally, you will make the important design decisions that specify how to rearchitect products in a cloud-first way on systems like AWS and GCP, and how leveraging the latest powerful cloud services can enable ten-fold improvements in the product.What You Won’t Be DoingYou will not be making technical decisions based primarily on saving money. You will focus on designing the best solution for the problem, in the simplest way possible, and with maximum leverage of existing assets. This is a strategic technical design position - making the important technical decisions and providing clear leadership for our engineering organization to execute on. Therefore, in this role you won’t be:Participating in daily scrum meetings or providing day-to-day direction to an engineering teamMaking low-level decisions about what coding language to use or choosing frameworks and librariesPerforming code reviews, debugging or investigating bugs and outagesTalking to customers to develop a backlog of features they wish our products hadDirectly managing peoplePrincipal Software Engineer Key ResponsibilitiesMake clear, simple, and technically superior design decisionsSimplify designs that others have made complicatedApply a particularly high-quality bar to what we believe are the core technical design decisions - data structures, algorithms, architectural patterns, and the leverage of third-party implementationsUtilize other architects as force-multipliers, mentoring them by providing high-quality feedback on their workSynthesize your decisions and designs into clear and structured written specsBasic RequirementsA university degree that includes the study of data structures and algorithmsAt least 2 years experience with a commercial software company shipping production codeAt least 5 years of experience making core architecture and design decisions; such as data domain modeling, application of design patterns, and design using third-party components.The ability to simplify complex ideas and communicate them with clear, logical thinking.Nice-to-have RequirementsExperience designing for Amazon Web Services, Azure, or Google Cloud Platform.Experience redesigning existing products on top of serverless cloud services.Experience crafting simple but meaningful messages for sales and marketing teams.Compensation and growth:As a 100% remote organization, we pay the same rate to everyone in a given role regardless of prior compensation history or geographic location. For simplicity, we make weekly payments at your full hourly rate and do not incorporate any variable pay components or subsidized benefits. It is about as clear and simple of a compensation plan as you can imagine.This SVP-level position has a rate of $200/hr or roughly $400k/yr, and our desire is long-term career opportunities, not short-term relationships for “side gigs”.This role is also part of a Technical Product Management growth path. The step just below exercises similar skills but at a different level of scope and is a VP-level ($100/hr) role. The growth path for this SVP-level role is to EVP-level ($400/hr). You can find all of our job listings on our jobs site: https://jobs.crossover.comAbout DevFactoryDevFactory is a division of Trilogy, one of the world’s largest privately held enterprise software companies. Since 2008, Trilogy has been acquiring enterprise software firms, turning them around, and delivering phenomenal value for their customers. DevFactory provides R&D services to all of Trilogy’s businesses using a unique centralized model for software development and delivery.DevFactory has a fully-global, fully-remote workforce and has partnered with Crossover to administer our talent screening and global workforce management.What’s Next?There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important!If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from our partners at Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply.Crossover Job Code: LJ-3370-NP-Kathmand-PrincipalSoftw.002Show moreShow lessSeniority levelExecutiveEmployment typeFull-timeJob functionBusiness DevelopmentEngineeringInformation TechnologyIndustriesComputer SoftwareInformation Technology and ServicesInternetReferrals increase your chances of interviewing at DevFactory by 2xSee who you knowTurn on job alertsPrincipal Software Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/principal-software-engineer-remote-%24400-000-year-usd-at-devfactory-2299738883?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Software Developer (Remote) - $30,000/year USD", "company": "Crossover for Work", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "3 hours ago", "desct": "Software Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, NepalApply NowSoftware Developer (Remote) - $30,000/year USDCrossover for WorkKathmandu, Bāgmatī, Nepal3 hours agoBe among the first 25 applicantsSee who Crossover for Work has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSoftware Developer (Remote) - $30,000/year USDatCrossover for Work.Email or phonePasswordShowForgot password?Sign inReport this jobAre you the strongest developer on your team? Are you always getting interrupted from writing your own great code to put out a fire created by one of your less-skilled teammates? Wouldn’t you rather work on a team without these so-called arsonists who introduce bugs due to their carelessness?Yea, we thought so. We are so obsessed with software code quality that we only hire elite developers - the ones that firmly believe in test-driven development and always deliver simple & elegant solutions - and then we teach them our innovative approach to development that produces perfect code. Our results speak for themselves: we ship code every day with less than one-thousandth of a percent of those code changes introducing regressions!In this role, you will focus on re-building essential B2B products and deploying them as true cloud-native applications. This is a unique opportunity to level-up in your software development career, working in a role that demands high-quality code across multiple products at once. We will teach you how to meet our demanding quality standards so you can ship perfect code.Stop wasting your time firefighting the work of the arsonists on your team. If you can meet the requirements below, apply for this role of a lifetime and take your career to the next level.What You Will Be DoingDue to the huge investment we’ve made in tooling and automation, you will focus on more substantive development work only - no time wasted on administrative tasks. All you will do is write production code for several of our hundreds of commercial SaaS products following a TDD methodology.What You Won’t Be DoingGetting spoon-fed easy changes or small parts of complex problems already solved by senior team members.Getting bored being focused on a single, slowly-evolving codebase. In this role you'll learn new codebases and tech stacks week to week.Reviewing someone else's code to find issues and errors.Software Developer Key ResponsibilitiesWe hire the top 1% of engineering talent and place you in a highly specialized role working on multiple products at a time. In this role you will:Write high-quality code every dayCreate elegant solutions to resolve difficult bugsBasic RequirementsTo produce high-quality work in this role you must:Have at least 6 months experience writing production code in Java, JavaScript, C#, or C++. More often than not, developers need 2 years of experience to meet our quality standards but we hire based on skill level, not years of experience.Have a degree in computer science, software engineering, or other technical field OR a minimum of 4 years of software development experience.Possess the ability to ramp up quickly, learning new codebases and technologies every weekAbout CrossoverCrossover has been a pioneer of the remote work model since our inception in 2010 - helping thousands of people find great work opportunities. We focus on full-time, long-term work - not short-term \"gigs\" or freelancing side jobs. Most of our positions are within a large and growing portfolio of software companies. Since we focus on remote work, our openings can be filled globally and pay standardized compensation rates, regardless of where you choose to live.Join the thousands of professionals that have partnered with Crossover to explore new opportunities and find their dream job. Go towww.crossover.com/testimonialsto read their stories. Better yet, write your own story!What to expect next:You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.You will be paired up with one of our recruiting specialists who can answer questions you might have about the process, role, or company, and help you get to the final interview step.Important!If you do not receive an email from us:First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just visit https://jobs.crossover.com directly, search for this job, and click “Apply”. You will be prompted to reset your password if you already applied using LinkedIn EasyApply.Crossover Job Code: LJ-3890-NP-Kathmand-SoftwareDevelo.023Show moreShow lessSeniority levelEntry levelEmployment typeFull-timeJob functionBusiness DevelopmentEngineeringInformation TechnologyIndustriesBankingElectrical/Electronic ManufacturingFinancial ServicesReferrals increase your chances of interviewing at Crossover for Work by 2xSee who you knowTurn on job alertsSoftware Engineer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/software-developer-remote-%2430-000-year-usd-at-crossover-for-work-2299752704?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Python Developer", "company": "Moru Digital Wallet", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "2 weeks ago", "desct": "Python DeveloperMoru Digital WalletKathmandu, Bāgmatī, NepalApply NowPython DeveloperMoru Digital WalletKathmandu, Bāgmatī, Nepal2 weeks agoBe among the first 25 applicantsSee who Moru Digital Wallet has hired for this roleApply NowSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to savePython DeveloperatMoru Digital Wallet.Email or phonePasswordShowForgot password?Sign inReport this jobDirect message the job poster from Moru Digital WalletAshitosh sahChief Executive Officer at Moru Digital WalletJob description:The really great things you will be doing:Building simple, efficient and reusable applications.Identify and communicate back-end best practices.Participate in the project life-cycle to develop applications using agile methodologies.Analyse and improve the performance, scalability, stability and security of the product.Improving the engineering standards, tooling and process.Collaborate and manage a team of Python developers.Collaborate with the HR team to participate in hiring Python developers.Required Candidate profileWhat we look for in you:A team player with 2+ years of working experience in developing, releasing, and maintaining large-scale software applications.Minimum 2 years of working experience in Python and Python Frameworks (preferably Django and Flask).Proven experience in effective team management.Must have Experienced in AWS web Services (like EC2, RDS, Lambda, S3, LoadBalancer, BeanStalk etc).Experience with creating RESTful endpoints using the Django REST framework.Strong understanding of OOP Concepts, Data Structure and Design Patterns.Strong understanding of Web Services, Caching, Scalability, REST/SOAP Principles.Have knowledge of the databases like MySQL, Postgresql etc.Familiarity with some ORM (Object Relational Mapper) libraries.Knowledge of CI/CD tools like (Jenkins, AWS Pipeline).Experience with tools like Celery, Nginx, Gunicorn etc.Good communication skills.Ability to work independently in a fast-paced and agile development environment.Keen to explore new technologies.What is good to have:Experience with Docker and Kubernetes.Experience with Microservice Architecture.Knowledge of TDD (Test Driven Development) in Python.Knowledge of NoSQL Databases (MongoDB, DynamoDB).Knowledge of front-end technologies (React, Angular).Comfortable with Git.Kindly share your CV on sp@moru.com.npShow moreShow lessSeniority levelNot ApplicableEmployment typeFull-timeReferrals increase your chances of interviewing at Moru Digital Wallet by 2xSee who you knowTurn on job alertsPython Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Full-time", "Page_URL": "https://np.linkedin.com/jobs/view/python-developer-at-moru-digital-wallet-2211128926?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}, {"name": "Senior React Native Developer – Remote, Full-time", "company": "Toptal", "address": "Kathmandu, Bāgmatī, Nepal", "deadline": "4 days ago", "desct": "Senior React Native Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, NepalApply on company websiteSenior React Native Developer – Remote, Full-timeToptalKathmandu, Bāgmatī, Nepal4 days agoBe among the first 25 applicantsSee who Toptal has hired for this roleApply on company websiteSaveSave jobSave this job with your existing LinkedIn profile, or create a new one.Your job seeking activity is only visible to you.EmailContinueWelcome backSign in to saveSenior React Native Developer – Remote, Full-timeatToptal.Email or phonePasswordShowForgot password?Sign inReport this jobDesign your lifestyle as a top freelance developer, with the freedom to work however, wherever, on your terms.Freelance work is defining the careers of today's developers in exciting new ways. If you're passionate about working flexibly with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.Toptal is an elite talent network for the world's top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you'll choose your own schedule and work from anywhere. Jobs come to you, so you won't bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time.As a freelance developer, you could join an ever-expanding community of experts in over 120 countries, working remotely on the projects that meet your career ambitions.That's why the world's top 3% of developers choose Toptal. Developers in our elite network share:English language proficiencyAt least 3 years of professional experienceProject management skillsA keen attention to detailFull-time availability is a strong advantageIf you're ready for a career shift to impactful freelance work, take the next step by clicking apply and filling out the short form.____For expert insights on remote work and updates on new job postings, follow us on LinkedIn: https://topt.al/nbcaxqYou can find us on the other social platforms at @Toptal.#RemoteJobsReactNativeShow moreShow lessSeniority levelMid-Senior levelEmployment typeContractJob functionEngineeringInformation TechnologyIndustriesInformation Technology and ServicesInternetStaffing and RecruitingReferrals increase your chances of interviewing at Toptal by 2xSee who you knowTurn on job alertsJavascript Developer in Kathmandu, Bāgmatī, NepalOnOff", "time": "Contract", "Page_URL": "https://np.linkedin.com/jobs/view/senior-react-native-developer-%E2%80%93-remote-full-time-at-toptal-2284987329?refId=907fd3f5-acb4-4d1a-8783-19c7dcc71550&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click"}]