[{"name": "Data Operator(378 views)", "company": "Mphasis Tech Foundation Pvt. Ltd.", "time": "Full Time", "deadline": "November 27, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Mphasis Tech Foundation Pvt. Ltd.Mphasis Tech Foundation Pvt. Ltd.is seeking competent, smart and energetic Nepalese candidates for the following position:Position: Data OperatorNumber of Vacancies: FewMINIMUM REQUIREMENT::AGE:Not exceeding 30 yearsQUALIFICATION :At least +2 completed in any discipline 6 month computer training or academic certification in computer related subjectSKILLS :– Typing speed and accuracy in Traditional or Romanized Nepali Unicode– Knowledge of using office equipmentCandidates fully meeting the mentioned requirements may apply in the address mentioned below. Please attach the copies of:Cover letter with mentioning the position applied forUpdated CV with a recent 2 recent passport size photographMark sheet and transcriptCharacter certificatesID documentsWORKING AREA:Bhadrapur Municipality(Note:– Priorities are giving to candidates from Bhadrapur Municipality)Contact us @ Mobile No.:– 9842103209 / 9828570003E-mail:– tiwariarjun191@gmail.comThe Mphasis Tech Foundation Pvt. Ltd. reserves the right to reject any/ all applications without assigning whatsoever.Last date of Application:30 November 2020.", "Page_URL": "https://www.merorojgari.com/job/data-operator/", "websitename": "merorojgari.com"}, {"name": "Graphic Designer(347 views)", "company": "Raspberry Solution Pvt. Ltd.", "time": "Full Time", "deadline": "November 22, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Raspberry Solution Pvt. Ltd.Position: Graphic DesignerRequirements:01Salary:NegotiableJob Location:New Baneshwor, KathmanduJob DescriptionPrepare work to be accomplished by gathering information and materials.Should have creative skill, originality, and create high-quality visual designs.Understand business priorities, the targeted set, and demands.Manage workflow/prioritization, deadlines, and deliverables of all designs.Collaborate with the team through creative briefs and deliver excellent designs and monitor results.Stay up to date with the latest trends to keep the company at the forefront of design and embed a culture of creative curiosity within the department.Willing to assist different internal departments who seek help for designs.Job SpecificationBachelors graduate.Strong graphic design skills with knowledge of Advanced Adobe Photoshop and other Adobe software.Should have good communication skillsExceptional creativity, innovation, and flexibility.Professional approach to time and deadlines.Interested candidates can attach their CV and send an email tojobs@raspberry.com.np", "Page_URL": "https://www.merorojgari.com/job/graphic-designer-2/", "websitename": "merorojgari.com"}, {"name": "Machine Learning Engineer(372 views)", "company": "Chulo Solutions", "time": "Part Time", "deadline": "November 19, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Chulo SolutionsPosition: Machine Learning Engineer – Part TimeWe are looking for:An expert in machine learning to help us to design and build an online e-learning program.A person who can work part-time for about 15 – 20 hours a week. (It is remote work. Working hours can be decided according to your circumstances.)Required skills:Advanced degree in computer science, math, statistics or a related disciplineExtensive data modeling and data architecture skillsProgramming experience in PythonExperience in machine learning frameworks in python such as TensorFlow or KerasStrong knowledge about machine learning and deep learning algorithms such as k-Nearest, NLP and sequence modeling, along with CNNStrong written and verbal communications in EnglishCore responsibilities:Create, check, and modify online courses about machine learningCommunicate with the foreign team for any improvement in our online programsResearch, Design and Frame Machine Learning SystemsUnderstand and Transform the Prototypes of Data ScienceVerifying data quality, and/or ensuring it via data cleaningPerform Machine Learning Model Tests and ExperimentsDevelop the Machine Learning Model as per the NeedSelect and Implement Right Machine Learning AlgorithmsUnderstand Business Objectives and Developing the ML ModelsCompany benefits:Friendly, creative working environment with a foreign teamWorking with the latest technologiesTimely salary reviewRemote working policyApplying Procedure:If you believe you are the one and have a passion to work with us,APPLY NOWwithYour recent resume in PDF formatYour desired weekly working hours and monthly salaryatrecruit-ml@namespace.jp.We are looking forward to receiving your application!", "Page_URL": "https://www.merorojgari.com/job/machine-learning-engineer-part-time/", "websitename": "merorojgari.com"}, {"name": "Front End Developer(462 views)", "company": "kpiinstitute", "time": "Full Time", "deadline": "November 11, 2020", "desct": "VACANCY ANNOUNCEMENTOrganization: The KPI InstitutePosition: Front End DeveloperThis is full-time remote job.Your main responsibilities include:Collaborate with business analysts and developers to produce software layout;Transform software designs and specifications into high functioning code in the appropriate language;Integrate software layout with functional API;Cooperate with web designers to match visual design intent;Edit content and re-design web pages;Test code periodically to ensure it produces the desirable results and perform debugging when necessaryMaintain and expand our websites;Assist and support in the upkeeping of our websites.Perform upgrades to make software and systems more secure and efficient.We expect you to:Have extensive knowledge of HTML5 and CSS3;Have experience in working with Git,PHP, JavaScript/JQuery, Bootstrap, Redux/Axios, Vue;Have experience in working with frameworks (Laravel);Have experience in working with React;Good knowledge of relational databases (MYSQL);Have experience in working with SASS, Webpack, Selenium, Restful API, tailwindcss – would be a plus;Have experience with WordPress/ Magento – would be a plus;Be able to manage multiple tasks and prioritise work;Have the ability to work collaboratively as part of a project team;Have excellent English skills.", "Page_URL": "https://www.merorojgari.com/job/front-end-developer/", "websitename": "merorojgari.com"}, {"name": "SEO Content Writer(916 views)", "company": "Generating Leads", "time": "Full Time", "deadline": "November 9, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Generating LeadsPosition: SEO Content WriterWe are looking for a highly experienced SEO Content writer who has the capability to put the best content on the table.SALARY:Negotiable | Starting from Rs. 35,000/-DUTIES:♡ Perform accurate keyword research for our industry.♡ Analyse research results and record.♡ Plan work to be carried out according to research data.♡ Carry out the planned work in a fast and efficient manner as our industry is seasonal and requires constant updates on the website.♡ Create creative and informative blog posts.♡ Create and refresh current on-page descriptions including categories and products.♡ Assist with listing products on our website.♡ Check content and product listings on our website to ensure they are in-line with current SEO guidelines.♡ Discuss regularly with management, any upcoming events and plan SEO work accordingly.♡ Regularly monitor the use of SEO by other team members.♡ Update team members on any new or changed SEO methods.EXPERIENCE:♡ Previous experience with SEO practices is essential, specifically on business websites.♡ Knowledge of SEO fundamentals is essential.♡ Understanding of Google rankings and algorithms is essential.♡ Advanced and proficient use of search engines.♡ Advanced computer skills are essential.♡ Proven experience and understanding in the use of Microsoft applications.♡ Previous experience in website administration.♡ Advanced, excellent written and verbal communication skills.♡ Fast typing speed with high accuracy.The successful applicant must be a hard and fast worker as working to deadlines is paramount. The candidate must possess a high level of self-initiative and exemplary attention to detail.The candidate must have the ability to creatively inject on-page content into our website based on the research performed and according to SEO best practices.There is an expectation that the successful candidate will possess prior SEO knowledge and experience, therefore not require intense training and be able to contribute to the growth of our website immediately.", "Page_URL": "https://www.merorojgari.com/job/seo-content-writer/", "websitename": "merorojgari.com"}, {"name": "Software Engineer Trainee – .Net(387 views)", "company": "Verisk Nepal", "time": "Full Time", "deadline": "November 4, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Verisk NepalPosition: Software Engineer Trainee – .NetJob Location:LalitpurVerisk Business:Verisk AnalyticsCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: .NET TraineeRequirements :Good knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)• Problem solving skillsGood knowledge curve – Ability to learn quickly and implementGood attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skillsQualificationsBachelors in Computer Science / Information Technology or equivalent.Up to 1 year of working experience in development are also encouraged to applyAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran’s status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/software-engineer-trainee-net/", "websitename": "merorojgari.com"}, {"name": "Java Developer(631 views)", "company": "Cotiviti Nepal Pvt. Ltd.", "time": "Full Time", "deadline": "October 12, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Cotiviti Nepal Pvt. Ltd.Position: Java DeveloperResponsibilities• Involve in all stages of the project life cycle: requirements definition, design, and development.• Translate application stories and requirements into functional applications.• Write neat and clean code for desktop and web application.• Create test cases and follow test cases to implement the requirements.• Active participation in Project level discussion/meeting.• Prepare use case/ flow diagram when needed.• Regular follow up for tasks assigned from development phase to QAQUALIFICATIONS AND EDUCATION REQUIREMENTS• Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLS• At least 2 years of experience in Software development using J2SE and J2EE.• Experience in parallel and multithreaded programming• Knowledge of algorithms and data structures• Interest in achieving maximum performance from available hardware and software• Familiar with design patterns• UI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery)• Hands on knowledge on Spring Framework.• Strong knowledge of Relational Databases, SQL, and ORM technologies• Experience working with source control systems, such as Subversion, and GIT including branching and merging strategies.PREFERABLE SKILLS• Hands on knowledge on Apache Camel Framework• Knowledge of testing frameworks/methodologies (TestNG, JUnit, TDD)• Understanding of XML, JSON, web services technologies• Experience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)• Experience in Continuous Integration leveraging tools such as Bamboo and Maven.SOFT SKILLS• Ability to work independently or as part of a team• Experience of working in SCRUM/Agile team would be added value• Desire and ability to continuously improve, discover and expand the limits• Critical thinking, has an opinion on various technological topics.HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/java-developer-2/", "websitename": "merorojgari.com"}, {"name": "Project Manager(1049 views)", "company": "Cotiviti Nepal Pvt. Ltd.", "time": "Full Time", "deadline": "October 11, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Cotiviti Nepal Pvt. Ltd.Position: Project ManagerResponsibilitiesConduct and facilitate the planning.Help remove impediments and foster an environment for high-performing team dynamics, continuous flow, and relentless improvement.Conduct regular retrospective with focus on continuous improvement.Collaborate with Engineering managers & team members for engineering tasks.Communicate the details of project issues, impediments proactively with stakeholders in different locations.Setup and coordinate the regular meetings with US PMs, technical teams etc. as required.Compile, collect, produce and publish report on different metrics.Skills & ExperienceAt least 2 years of experience in a similar roleKnowledge on US Healthcare systemFamiliar with JIRA, ConfluenceKnowledge of SQLFair understanding of technical practices & technological stacksUnderstanding of Agile, Kanban, Scrum, DevOps processes & toolsEffective presentation skillSoft SkillsPersuasive in both written and verbal communicationLeadership quality, motivatorLast date to apply: 9th November, 2020HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/project-manager-22/", "websitename": "merorojgari.com"}, {"name": "Frontend Developer(662 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "September 9, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Frontend DeveloperDelta Tech is seeking a Frontend Developer who has proven working experience in HTML5, CSS3, JQuery and is also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaSalesCRM, DeltaRetailerApp and DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Understand the requirement clearly, think creatively to produce new ideas and concepts to interactive designConceptualize ideas that bring simplicity and user-friendliness to complex design roadblocksWork with internal team to design and build user-friendly forms/ applications/ interfaces based on functional specificationsWireframe new features and templates and improvements to existing functionalityBuild prototypes of new features, templates, and apps to demonstrate and test new designs.Design UI and interaction layers using best practices and the latest Web/ Mobile trendsOther SpecificationEducation Level: Bachelor of IT/ BE Computer EngineeringExperience Required: More than one yearShould be proficient in HTML5, CSS3, JQuery, and Bootstrap.Should have good knowledge on UI/ UX experience and developing pixel perfect designs on the frontendShould have creative skills on graphic designing tools like Photoshop, Illustrator etcShould have knowledge of color theory and updated with trendsShould have the knowledge of wireframe, prototype, mockupShould be creative and develop new ideasShould possess good communication and interpersonal skillYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeWhat we offerDelta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Position BenefitsCompetitive/ Attractive Salary (No bar for right and deserving candidate)Timely performance appraisal and salary reviewsPaid holiday & paid leavesFestive bonusGreat work cultureFlexible timings against performanceWork from home (During COVID-19 pandemic situation)Interested, enthusiast, and career-oriented candidates are encouraged to drop their resume atcareer@deltatechnepal.com", "Page_URL": "https://www.merorojgari.com/job/frontend-developer-3/", "websitename": "merorojgari.com"}, {"name": "Android Developer(533 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "August 14, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Android DeveloperOther SpecificationBachelor of IT/ BE Computer EngineeringMore than one year of experienceProven software development experience and Android skills developmentProven Working Experience in Android app developmentExperience with Android SDKExperience working with Remote Data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architecture, trends and emerging technologiesSolid understanding of the full mobile development lifecycleYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeJob DescriptionDelta Tech is seeking an Android Developer who is proven working experience in android app development with SDK and also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaRetailerApp, DeltaSalesCRM & DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Design and build advanced native applications for the Android platformCollaborate with cross-functional teams to define, design, and deliver new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performanceContinuously discover, evaluate, and implement new technologies to maximize development efficiencyCommunicate with clients to understand his requirements and deliverWhat we offer:Delta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Competitive/ Attractive Salary (No bar for right and deserving candidate)Festive bonusAnnual performance reviewGreat work cultureFlexible timings against performanceWork from home (during the COVID 19)Apply now and be the part of our dynamic team.Drop resume atcareer@deltatechnepal.comCall or text us at +977 9804067116 (Whatsapp & Viber)", "Page_URL": "https://www.merorojgari.com/job/android-developer-4/", "websitename": "merorojgari.com"}, {"name": "Sr. Android Developer(498 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "August 14, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Sr. Android DeveloperOther SpecificationBachelor of IT/ BE Computer EngineeringMore than or equal to 3 yearsProven software development experience and Android skills developmentProven Working Experience in Android app developmentExperience with Android SDKExperience working with Remote Data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architecture, trends and emerging technologiesSolid understanding of the full mobile development lifecycleYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeJob DescriptionDelta Tech is seeking a Senior Android Developer who is proven working experience in android app development with SDK and also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaRetailerApp, DeltaSalesCRM & DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Design and build advanced native applications for the Android platformCollaborate with cross-functional teams to define, design, and deliver new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performanceContinuously discover, evaluate, and implement new technologies to maximize development efficiencyCommunicate with clients to understand his requirements and deliverWhat we offer:Delta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Competitive/ Attractive Salary (No bar for right and deserving candidate)Festive bonusAnnual performance reviewGreat work cultureFlexible timings against performanceWork from home (during the COVID 19)Apply now and be the part of our dynamic team.Drop resume atcareer@deltatechnepal.comCall or text us at +977 9804067116 (Whatsapp & Viber)", "Page_URL": "https://www.merorojgari.com/job/sr-android-developer/", "websitename": "merorojgari.com"}, {"name": "WordPress Developer(692 views)", "company": "CodeGearThemes", "time": "Full Time", "deadline": "July 25, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: CodeGearThemesPosition: WordPress DeveloperWe’re looking for a talented WordPress developer to join our full-time team. You need to be experienced in WordPress development, specifically theme development.Experience Required: 1 YearEssential experience:– WordPress Themes & Plugins– PHP, Js & HTMLTo Apply:Send  your CV to: info@codegearthemes.com", "Page_URL": "https://www.merorojgari.com/job/wordpress-developer-2/", "websitename": "merorojgari.com"}, {"name": "कम्प्यूटर अपरेटरको आवश्यकता, योग्यता: १०+२, स्थान: सुर्खेत(213 views)", "company": "Chahan Business House", "time": "Full Time", "deadline": "December 9, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Chahan Business HousePosition: Computer OperatorQualification: 10+2 Pass, Knowledge of BG softwareContact:Chahan Business House, SurkhetPhone:9848296404, 9844813790", "Page_URL": "https://www.merorojgari.com/job/computer-operator-3/", "websitename": "merorojgari.com"}, {"name": "Data Entry (Nepali/English)(392 views)", "company": "Merorojgari Group", "time": "Full Time", "deadline": "December 13, 2020", "desct": "Position: Data Entry (English/Nepali)JOB LOCATION: Tilottama-11, RupandehiREQUIREMENTS:10+2 pass (Bachelors degree preferred)Good computer operating knowledgeGood internet and social media knowledgeExcellent English knowledge (able to translate Nepali to English or vice versa)Available to work from early morningLocal candidates preferredSALARY: Negotiable (no bar for a deserving candidate)To apply:Please submit online application below or send an application along with CV, PP size photograph and certificates tocontactus@merorojgari.comApply Online", "Page_URL": "https://www.merorojgari.com/job/data-entry-nepali-english/", "websitename": "merorojgari.com"}, {"name": "Assistant Matron, Procurement Officer, Jr. Procurement Officer, Assistant Admin Officer, Auditor, Brand Officer, IT Assistant, Radio Technologist, Electrical Engineer, Professor, Associate Professor, Associate Professor, Assistant Professor, Lecturer", "company": "Nepal Medical College Private Limited", "time": "Full Time", "address": "Kathmandu", "deadline": "May 3, 2022", "desct": "Full TimeKathmanduPosted 8 hours agoCloses:May 3, 2022Login to bookmark this JobWebsiteNepal Medical College Private LimitedJOB OPPORTUNITYNepal Medical College is seeking qualified, competent and highly motivated candidates for the following positions.Vacant DepartmentPaediatricForensic MedicineMedicineNeurosurgeryUro SurgeryCardiologyEmergencyNeuro-MedicineCTVSOral Medicine and RadiologyOral and Maxillofacial SurgeryPedodonticsOral PathologyRequirement to apply:DM/M.Ch./MD/MS/MDGP/MDS with registration in NMC for the position of Professor, Associate professor, Assistant professor and LecturerVacant Position: Assistant MatronRequired Number:1Qualification and Skills:Master’s degree in relevant field with registration in NNCOther Requirements:Fresher’s are encouraged to apply (Candidates having prior experience as a ward In-charge will be given preference)Vacant Position: Procurement OfficerRequired Number:1Qualification and Skills:Minimum of Bachelor’s degree in relevant field** prior work experience of minimum 3 years will be given preference.Other Requirements:Maintaining and managing the overall purchase of hospital in coordination with the managementVacant Position: Assistant Admin OfficerRequired Number:1Qualification and Skills:Minimum of Bachelor’s degree in relevant field** prior work experience of minimum 3 years will be given preference.Other Requirements:– Day to Day manpower mobilization– Linen Management, cleaning chemicals verification and reportingVacant Position: AuditorRequired Number:1Qualification and Skills:Semi Qualified CA** prior work experience in hospital will be given preference.Other Requirements:Good date analysis, communication, coordination and accounting skillVacant Position: Brand OfficerRequired Number:1Qualification and Skills:Bachelor’s degree in relevant field** prior work experience of minimum 3 years will be given preference.Other Requirements:– Proofreading, writing skill with ability to analyze complex sentences– Promotion, Branding, Planning and knowledge of digital marketingVacant Position: IT AssistantRequired Number:1Qualification and Skills:Ongoing Bachelor’s degree in relevant fieldOther Requirements:Knowledge of hardware network and software will be given preferenceVacant Position: Radio TechnologistRequired Number:1Qualification and Skills:Minimum of Bachelor’s degree in relevant field with registration in NHPCOther Requirements:Candidate having minimum of 2 years of working experience will be given preferenceVacant Position: Electrical EngineerRequired Number:1Qualification and Skills:Bachelor’s degree in relevant fieldOther Requirements:Candidate having minimum of 5 years of working experience in large conglomerate will be given preferenceVacant Position: Audiologist (ENT)Required Number:1Qualification and Skills:Bachelors in Audiology and Speech Language Pathology with registration in NHPCOther Requirements:Candidate having minimum of 2 years of working experience will be given preferenceInterested Candidate meeting the requirements are requested to send their resume along with cover letter atadvt@nmcth.eduor drop the hard copy at our reception within3rd May, 2022.Human Resources DepartmentNepal Medical College Pvt. LtdGokarneshwor Municipality, Ward no. 08, AttarkhelPhone No.:01-4911008, 4912009 (Ext.400, 500)Source: Kantipur Daily, April 23, 2022Tagged as:Admin Officer,Assistant,Assistant Professor,Associate Professor,Audiologist,Auditor,Brand Officer,Electrical Engineer,IT Assistant,Matron,Officer,Procurement Officer,ProfessorFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/nepal-medical-college-private-limited-full-time-assistant-matron-procurement-officer-jr-procurement-officer-assistant-admin-officer-auditor-brand-officer-it-assistant-radio-technologist-elect/", "websitename": "merorojgari.com"}, {"name": "Jr. BI Analyst", "company": "Daraz", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 1 day agoLogin to bookmark this JobWebsiteDarazJOB OPPORTUNITYJr. BI AnalystJob InformationDepartment Name: CommercialIndustry: ManagementWork Experience: 1-3 yearsCity: KathmanduState/Province: Province No.3Zip/Postal Code: 44600About DarazLaunched in 2012, Daraz is South Asia’s online shopping and selling destination of choice – present in Pakistan, Bangladesh, Sri Lanka, Myanmar and Nepal. Supported by a wide range of tailored marketing, data, and service solutions, the pioneering e-commerce ecosystem in South Asia has 30,000 sellers and 500 brands, serving 5 million consumers. With 2 million products available, Daraz offers a diverse assortment of products in categories ranging from consumer electronics to household goods, beauty, fashion, sports equipment, and groceries. Focused on providing an excellent customer experience, it offers multiple payment methods including cash-on-delivery, comprehensive customer care and hassle- free returns. Daraz is owned by Alibaba Group Holding Limited.At Daraz, we believe in chasing hard towards big goals.Job DescriptionExtract, deep-dive into, & manipulate data such that you can conduct analysis and derive insights to business stakeholders in tight deadlinesProvide value driven reports, analysis, insights and dashboards for senior management on multiple business areasPredict and optimize performance and identifying risksLiaise with business units to recommend and drive implementation of new productivity and cost saving initiatives, and prepare business cases to support strategic and other business decisionsCoordinate with business teams for best practices and knowledge sharingRequirementsBachelors degree from top tier university in a quantitative subject with background in business intelligence/data science/mathematics/economics/computer science or engineering preferredAt least 1 year of data analytics experience, with a proven track record of delivering rigourous, insightful and actionable analysesExperience in e-commerce a plusGo-getter attitude, willing to immerse themselves in the business, with a proactive approach to getting things doneSuperior organizational skills to manage multiple priorities to tight deadlines, and the flexibity to adapt to changing scopeExcellent verbal and written communication skills, with the ability to successfully negotiate with different stakeholders across various business environments and cultures; fluent in EnglishAdvanced skills in Microsoft Excel and strong proficiency in SQL are essentialImportantly,we look for someone who will live by our values that define everything we do:Continuously InnovativeGenerosity of SpiritDeliver on our PromiseMake It PersonalBenefitsInternational working environment, and a unique opportunity to learn from the best in e-commerce (Alibaba Group) and business growth.A platform to learn from Alibaba’s world-leading ecosystemRigorous training and exposure in team management, leadership, business analytics, and operations.An opportunity to train the next generation of business leadersCompetitive salary and incentive packageHealth & life insuranceTagged as:Analyst,Job in Daraz,Job in KathmanduTo apply for this job please visitrecruit.zohopublic.com.", "Page_URL": "https://www.merorojgari.com/job/jr-bi-analyst/", "websitename": "merorojgari.com"}, {"name": "Admin/ Procurement Supervisor", "company": "HLE Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 1 day agoLogin to bookmark this JobWebsiteHLE NepalJOB OPPORTUNITYAdmin/ Procurement SupervisorJob DescriptionWho are we?HLE Nepalis an Australian mortgage broking company with a difference: our mission is to operate ethically for the benefit of society. That includes our customers and our employees.We have a team of expert marketing gurus who have created an overarching image of our company in the international mortgage broking market. In collaboration with our team of tech geniuses, ex-credit officers, property addicts, and finance experts, the Marketing team has been continually offering the best services to the customers for over 10 years. How good are we? Over AUD $5 billion in settled loans.We have two offices; one in Australia and another one in Nepal and most importantly we grew to over 450 happy employees and we still intend to grow, pandemic or not! That’s because our employees share the value of training and professional development so that we can continue to help Australians in tough situations with home loans as well as lead the way to produce a professional workforce in Nepal.What is your role like?This role requires you to provide direct supervision and create coordination of activities of administrative support staff. Admin Supervisor will supervise and communicate with the internal and external stakeholders (employees, team, vendors) and manage a team of administration professionals to achieve operational objectives.The role expects you to:Have experience managing the inventory, IT peripherals and administrative work.Make a database of all the authorized sellers and contact them at the time of procurement.Assist the IT Officer in the procurement of laptops and other peripheralsProvide guidance and support to administrative staff to perform their duties effectively.Strategies and come up with different ideas to manage the team effectively.Internal housekeeping staff management.Management/organize events (i.e office moving-in, company team building activities)Liaise with Office Support and administrators to organize the administrative activities that ensure the smooth running of the office always .Maintaining the office / arranging for necessary repairs that include electric & networking jobs.RequirementsApply if you have-At least 3 years of relevant experience in Internal/ External Admin related work.Experience management and knowledge in IT procurement peripherals.General team management skill and rational thinker.Vendor and database management.Taking accountability and responsibility of Admin team .Great attitude and good communication skillsAble to prompt action on Issues; take initiativeStrong attention to detailBenefitsBesides the list of benefits that the Labor Law mandates, we also offer;Competitive salary packagePersonal and professional training and developmentEmployee Assistance Program – for your mental wellbeing!COVID-19 leaves and Annual Flu shotsWork From Home – Assist you to set up your workstationPartially paid internet service while working from homeBook Bonus – you get paid for reading!Employee Referral Bonus – Refer your acquaintance and get rewarded if they are hired!Customer Referral Bonus – Refer your friends and relatives in Australia to use our services and we’ll rewardWork Hours: 6:00 am to 2:00 pm (including 1-hour lunch break)What’s the next step?If you’re looking for a company that has a vision to grow and lead in the digital realm, you should apply to our Admin/ Procurement Supervisor vacancy.Tagged as:Admin,Job in HLE Nepal,SupervisorTo apply for this job please visitapply.workable.com.", "Page_URL": "https://www.merorojgari.com/job/admin-procurement-supervisor/", "websitename": "merorojgari.com"}, {"name": "Product Owner", "company": "HLE Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 1 day agoLogin to bookmark this JobHLE NepalJOB OPPORTUNITYProduct OwnerDescriptionHLE Nepalis a growing FinTech powered business with a dedicated team of developers working in the AWS space. As the technology driver in HLE we are moving towards serverless solutions. Our goal is to keep increasing the agility of the company in order to adapt with the pace in the industry. We have a team that is experienced in cutting edge technologies and we encourage continuous learning.HLE Nepal’s head office is located in Australia and services the Australian mortgage broking industry. Our company’s mission is to operate ethically for the benefit of society. That includes our customers as well as our employees.We are looking for an experienced Product Owner to join our team. This new role will have a direct impact on the product we provide . You will be integral to co-creating a product ready for growth and will translate product strategy into actionable tasks for our cross-functional product squads. Knowing the layers of our tech stack, ranging from data engineering and data science to full stack and web development is important. Equally important to this role is a transparent leadership and communication style and a passion for curation of data.RequirementsYour main responsibility will be to help implement the product vision and translate this to the product roadmap, which you’ll own. This means you’ll start from the high level business requirements and prioritized features.Defining: Since our product is for Australian Mortgage Industry , you’ll take ownership in all data field definitions and data structures and are responsible for the process of defining them by speaking to different stakeholders. You’ll also help define how our customers interact with the data (via API, UI, …).Translating: You will be responsible for deciding on priorities and translating business requirements to the different engineering squads. In this you are able to set clear acceptance criteria.Validating and releasing: You are the end-owner of the releases, in which you are responsible for final validation: have the business rules been implemented & interpreted correctly by the teams?Explaining: You’ll be the SPOC for the roadmap for a wide spectrum of audiences including the management, the commercial teams and even our customers.Qualification:Bachelor’s Degree in Computer Science, Engineering, Business Information Systems OR related industry experienceYou have at least 5 years of professional experience, of which a minimum of 3 years in a product owner/project manager role .Technical background, you’ve had at least 2 years of software/data engineering experience so you know where the challenges lie.You’re an excellent communicator who’s able to communicate both with brilliant engineers and business focused stakeholders. You must have a good command of the English language, both written and spoken, since you’ll work with people of different nationalities.Excellent Understanding of Agile process and principles , certification of Product Owner, Scrum Master and Scrum Master is preferredYou have worked in, or show a big interest in the technology Start- up , allowing you to build up domain knowledge to understand our customers & their needs even better.Ideally, you will also:Have experience with our tech stack (Python, AWS, …)Have experience with Jira, SCRUM, bringing in expertise on how to structure our projects.Have worked in a startup or scale-up (with > 20 software engineers) before so you know what it’s like to build products from the ground up in an environment with many uncertainties & growth challenges.Have experience working with stakeholders in an industry where data is not the main focus and can help showcase the value it brings.Knowledge of UML, activity diagrams, process flow diagrams, SWOT analysis, Business value and ROIBenefitsHLE believes it is powered by its people: You will be joining a team geared up for growth, giving you the unique opportunity to help shape our future as a company. Your day at work will matter. You will join a very special team; nimble, talented, international and highly motivated.We believe in flexibility at work and Importance of Work life balance. You will have a lot of autonomy in deciding what tasks are important and where you choose to work to keep you inspired. We trust you know your schedule.Transparency and Feedback is our superpower. It means our organization is flat and our culture is open and inclusive.We inject fun into work. Virtual or in-person random catch-ups and spontaneous after-work fun is as common as informative monthly company-wide meetings and organized team events.Developing yourself is an important cornerstone of our company. Together, we will find relevant training to help you stay ahead of your, and our, game.A competitive wage with benefits such as health insurance and medical Perks, Book Read Bonus, EAP , Referral Bonus and Many moreWhat’s the next step?If this role resonates with you, then your dream job is just a click away. Please fill in your application!Please note:You might be required to work in a Hybrid model (work from office and work from home alternatively) depending upon the need for the role.To apply for this job please visitapply.workable.com.", "Page_URL": "https://www.merorojgari.com/job/product-owner-2/", "websitename": "merorojgari.com"}, {"name": "Information Management Support Officer", "company": "National Society for Earthquake Technology-Nepal (NSET)", "time": "Full Time", "address": "Province 1, Madhesh Province, Bagmati Province, Gandaki Province", "deadline": "April 27, 2022", "desct": "Full TimeProvince 1, Madhesh Province, Bagmati Province, Gandaki ProvincePosted 1 day agoCloses:April 27, 2022Login to bookmark this JobWebsiteNational Society for Earthquake Technology-Nepal (NSET)JOB OPPORTUNITYNational Society for Earthquake Technology-Nepal (NSET) is working for Disaster Resilient Communities in Nepal since 1994. NSET seeks applications for the following positions from eligible candidates for the program “Supporting the response to the COVID-19 crisis in the education sector: Strengthening Education Clusters at Federal, Provincial and Local Governments” funded by UNICEF:3. Information Management Support OfficerNo. of Positions:4 (Four)Work Station:Province 1, Madhesh Province, Bagmati Province and Gandaki ProvinceAppointment Type:Full Time for 11 months with possibility of extensionRequired Qualification:Bachelor’s in information technology/Computer Science/Social ScienceExperience:Minimum 3 -years’ experience in data management or similar fieldLanguage:Nepali and English in speaking, reading and writing are requiredPreferable:Preference will be given to the local candidates. Candidate from disadvantage group and women are encouraged to apply.Skills and abilities required:I. Familiar with computer software: Microsoft Word, PowerPoint, Outlook. Data storage and handling of program data in Excel, SPSS is desirable.II. Excellent documentation and information management skill.III. Competent in English and Nepali typing.Main Responsibilities:I. Work closely with provincial cluster coordinator and support to develop monitoring tools for provincial and local level coordination and maintain training database of the province and local educational clusters.II. Develop tools/templates and maintain a disaggregated database of attendance of coordination meetings/workshops, meeting minutes and establish a system of reporting in cluster structure.III. Take the lead to establish provincial educational portal in coordination with federal educational cluster.IV. Support expertise to analyse provincial and local level data (learning loss) to support ERO and CEHRD for comprehensive assessment of learning loss.V. Maintain database of activities such as psychosocial support, children received telephone-based support, parenting education and stock piling of self-learning materials of provinces disaggregated by gender, sex and vulnerability wherever applicable.VI. Analyse EMIS and contingency plan data to identify children at risk and support LGs to include such children in the Welcome to school campaign and maintain capacity development database at provincial level on such targeted interventionsVII. Strengthen data and information management (IM) within the provincial education cluster at all levels. This involves collecting data during an emergency (as per need), regular monitoring of school status within the province, maintenance of the established system for tracking data on district and local level clustersVIII. Work closely with DRR Section Information management officer and UNCT Cluster Information Management officer and other relevant cluster IMOs (especially WASH, Protection) to maintain, update and verify data and information in the 4 W (Who, What, Where, for Whom) and producing regular 3W analysis products (including maps)IX. Training partners and government officials on Information Management tools and processesX. Work with the provincial and local education departments and sections to support and strengthen the EMIS system about emergency preparedness and response.XI. Contribute on information management on COVID 19 related preparedness and response actionsXII. Provide technical support to the Local level education cluster on strengthen data and information management (IM)XIII. Perform other duties as assigned» Interested candidates are required to the application through online submission system atwww.nset.org.np/vacancyno later than 5:30 pm on April 27, 2022.1. NSET always emphasizes the diversity and inclusion of workforce in terms of gender, culture and religion. Individual from minority groups, indigenous groups and persons with disabilities are equally encouraged to apply.2. No telephone inquiry will be entertained. NSET policy demands selection strictly on merit basis and any undue influences are sure to lead to disqualification.3. Only shortlisted candidates will be contacted. NSET reserves the right to reject any or all applications without assigning any reason.All the suitable applications will also be kept in NSET Roster and will be screened and contacted for further evaluation when there is need.The Executive DirectorNational Society for Earthquake Technology-Nepal (NSET)House No. 65, CR-13, Sainbu Awas, BhainsepatiLalitpur Metropolitan City-25, NepalP.O.Box No:13775, Kathmandu, NepalTagged as:Information Management Officer,Job in Bagmati Province,Job in Gandaki Pradesh,Job in National Society for Earthquake Technology-Nepal (NSET),Job in Pradesh 1,Madhesh Pradesh,Management Officer,NGO INGO Job in Nepal,NGO INGO Job Vacancy,Support OfficerTo apply for this job please visitwww.nset.org.np.", "Page_URL": "https://www.merorojgari.com/job/information-management-support-officer/", "websitename": "merorojgari.com"}, {"name": "React Native Developer", "company": "Fusemachines", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 2 days agoLogin to bookmark this JobWebsiteFusemachinesJOB OPPORTUNITYReact Native DeveloperLocation: Kathmandu, NepalType: Full TimeDepartment: Asia TechnologyExperience: Mid LevelAbout FusemachinesFusemachinesis a leading AI strategy, talent, and education services, provider. Founded by Sameer Maskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI. With a presence in 4 countries (Nepal, the United States, Canada, and the Dominican Republic and more than 250 full-time employees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.Qualification & ExperienceMust have a full-time Bachelor’s degree in Computer Science or similar.At least a year of working experience in the related field.Required Skills/CompetenciesFirm grasp of the JavaScript including ES6+ syntaxExperience with React is requiredExperience with React Native is requiredExperience with Redux and Thunk is required (Knowledge on Redux Saga is a Plus)Experience with Using Third-Party DependenciesExperience with Native Modules like Camera, GPS, etc.Experience creating, implementing, and using REST APIs is requiredExperience with Agile software development methodologies is requiredShould have knowledge of JS AnimationsGood knowledge of some mostly used javascript librariesBasic Knowledge of both Android and IOS and have knowledge of native code tooFamiliar working with REST APIs for integrationsSolid understanding of Data Structure and Algorithms.Solid understanding of Object-Oriented Programming concepts.Experience in agile principles and processes including (but not limited to) standup meetings, sprints, and retrospectives.Theoretical and practical knowledge of SQL / NoSQL databases with hands-on experience in at least one database system.Strong problem solving and written and verbal communication skills in English.Familiarity with Version Control tools such as Git.Familiarity with the deployment process.Familiarity with AWS and various services.Familiarity or the ability to learn and adapt to current trends and best practices.Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.Tagged as:Developer,Job in KathmanduTo apply for this job please visitjobs.fusemachines.com.", "Page_URL": "https://www.merorojgari.com/job/react-native-developer-3/", "websitename": "merorojgari.com"}, {"name": "Senior Software Engineer (Magento)", "company": "Javra Software", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 3 days agoLogin to bookmark this JobWebsiteJavra SoftwareJOB OPPORTUNITYJavra Software is seeking a Senior Software Engineer (Magento) who is creative and innovative. You will be working on various internal and external projects with different levels of complexity and challenges.Roles and ResponsibilitiesYour responsibilities will include (but are not limited to):A solid understanding of the Magento framework and some deep experience programming with Magento.Enhance and support the current set of core Magento extensions.Good Experience in Magento performance optimization.Competent in Payment Gateway, APIs and Web service integration.Actively participate in the development of new applications, customizations, and solutions.Strong understanding of software development life-cycle and best practices.Work independently or as part of a team and make a positive impact.Take ownership of technical solutions from concept to final delivery.Great understanding and experience with Subversion, and best practices for version control.A great understanding and experience with front-end technologies.In-depth understanding of object-oriented programming.Knowledge of best practices for cross-platform, cross-browser compatibility.RequirementsBachelor in Computer science, IT, software engineering, web development, programming or other subjects.At least 4 years of experience with Magento and PHP development.Magento certified developer a plus.You are:Fluent in spoken and written English.Able to multitask and focus on deadlines under pressure.Familiar with programming fundamentals.Team player.Passionate about new technology.What Javra Offers:Perks and DiscountAttractive SalaryProvident FundGratuityMonthly Mobile Phone allowanceDaily Transportation AllowanceDaily Lunch AllowanceInternational Travel OpportunitiesDashain Bonus5 working days a weekProfessional Support and recognitionRewards to the Employee of the monthRewards to the Employee of the quarterRewards to the Employee of the yearRewards to the Star of JavraAnnual performance reviewInternal and External learning and trainingOn-going Career DevelopmentInsurance and HealthMedical InsuranceAccidental and Death InsuranceFamily and ParentingMaternity and Paternity LeaveFlexible working hoursUnpaid extended leaveMonthly Child AllowanceMedical Insurance of Spouse & ChildrenVacation and social eventsPaid Annual LeavePaid Sick LeaveCompensatory LeaveMonthly Javra AssemblyTeam Building EventScholarshipMaster Study ScholarshipPlease share a copy of your CV atjobs@javra.comTagged as:Software EngineerFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/javra-software-full-time-senior-software-engineer-magento/", "websitename": "merorojgari.com"}, {"name": "Graphic Designer – Intern", "company": "Sambhavya Foundation", "time": "Full Time", "address": "Lalitpur", "deadline": "April 29, 2022", "desct": "Full TimeLalitpurPosted 4 days agoCloses:April 29, 2022Login to bookmark this JobWebsiteSambhavya FoundationJOB OPPORTUNITYGraphic Designer – InternLocation:Tikathali, LalitpurType:Paid InternshipTerm:3 monthsPOSITION OVERVIEW:We are looking for a dedicated, enthusiastic and creative Graphic Designer-Intern to join our dynamic team working for the promotion of School Mental Health in Nepal. The intern will work under the supervision and coordinate with marketing and communication department.MAJOR DUTIES AND RESPONSIBILITIES:Prepare images (Retouch and manipulate) to coincide with social media and blog posts;Design and Develop design concepts, graphic communication, social media posts and promotional materials; digital and print by brainstorming with team members and using his/her knowledge or skills;Adhere to brand guidelines and complete projects according to deadline;Come up with fresh creative ideas and concepts for and on behalf of the company;Assist HR and communication team to design and develop promotional contents;Assist in designing and updating our Website, and organizing Social Media Platforms;Assist with other graphic design needs as required.REQUIREMENT AND SKILLS:Basic knowledge of layouts, typography, line composition, color, and other graphic design fundamentals;Minimum Bachelor’s degree, but not compulsory;Preferred degree of study in marketing, advertising, graphic design, or closely related field;Experience of Graphic Design Software – Illustrator, Photoshop, Adobe InDesign and/or other design applications;Basic WordPress and digital marketing will be a plus point;Excellent verbal and written communication skills;Ideal candidate will be energetic, task-oriented, and creative with strong work ethic and positive attitudeBENEFITS- Why sambhavya?:You get to continuously learn and develop your skills;Exposure and networking opportunities. You get to work as a part of an innovative and diverse team;Internship Certificate to add value to your resume;Internship leading to full time job offer based on performanceFlexible schedule for studentsRegular mentorshipTo Apply: Please send us your resume along with a portfolio tointernship@sambhavya.org.npwith a subject line “Graphic Design-Internship”.Deadline:April 29th, 2022Please contact 9823084972 for enquiry.P.S. The company reserves the right to reject/accept any or all applications without assigning any reason whatsoever. Only the selected candidates will be invited for an interview.Only serious candidates are requested to apply. Application without resume shall be disqualified. Research our organization to understand the work we do before applying for the position to make sure that the career opportunity is a good fit for your career aspirations.Tagged as:Graphic Designer,Intern,Job in LalitpurFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/sambhavya-foundation-lalitpur-full-time-graphic-designer-intern/", "websitename": "merorojgari.com"}, {"name": "Golang Software Developer", "company": "Outcode", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 4 days agoLogin to bookmark this JobOutcodeJOB OPPORTUNITYGolang Software DeveloperLocation:Kathmandu, NepalDepartment:EngineeringJob Type:Full-TimeThe ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.Basic QualificationsHaving a B.S. degree in Computer Science or related disciplineSolid computer science fundamentals (theory, data structures, algorithms)Knowledge of at least one of the following technologies along with a passion to learn: Java, Node.js, C, C++Basic knowledge about modern JavaScript frameworks such as AngularJS, ReactPreferred QualificationsFamiliarity with SQL/NoSQL database technologiesExperience with big data technologies and architectureKnowledge of cloud computing services such as AmazonWeb Services, Google Cloud PlatformMicroservice design patterns and web servicesExperience with Golang developmentKnowledge of Linux and Docker technologiesExperience with distributed and multi-threaded systemsFamiliarity with standard machine learning techniquesTagged as:Job in IT company,Job in Kathmandu,Software DeveloperTo apply for this job please visitapp.eddy.com.", "Page_URL": "https://www.merorojgari.com/job/golang-software-developer/", "websitename": "merorojgari.com"}, {"name": "Computer Technician/Lab Boy, Bus Helper, Aaya (Sister), Gardener (Mali), Cafeteria Staff, Hostel Warden, School Nurse, Sports Teacher, Food and Beverage Manager, Handwriting Instructor, ECS/CCA Coordinator, Academic Co-Ordinator, Teacher (Pre-Primary, Primary, Middle School, Secondary)", "company": "Reliance International Academy (RIA)", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 4 days agoLogin to bookmark this JobReliance International Academy (RIA)JOB OPPORTUNITYReliance International Academy (RIA), A well recognized educational institution, running under the Reliance Education Network, invites application from the highly competent, self-motivated, computer literate and well experienced personnel for the following posts:Position/Level: Pre-PrimarySubjects: Grade TeachersNos.: 2Required qualification: IA, IEd/ +2 passed (intermediate)Position/Level: PrimarySubjects: Mathematics , English , NepaliNos.: One in EachRequired qualification: Bachelors’ Degree in respective disciplinePosition/Level: Middle SchoolSubjects: (Maths/Science/English/Computer)Nos.: One in EachRequired qualification: Bachelors’ Degree in respective disciplinePosition/Level: Secondary (9-10)Subjects: English Language Instructor/ NepaliNos.: One in EachRequired qualification: Master’s Degree in Related DisciplinePosition/Level: Academic Co-ordinatorSubjects: Grade (1-3)Nos.: 1Required qualification: Bachelors’ Degree in respective disciplinePosition/Level: ECA/CCA Co-OrdinatorNos.: 1Required qualification: Bachelors’ Degree in respective disciplinePosition/Level: Handwriting InstructorSubjects: English/NepaliNos.: 1Required qualification: Experienced in related disciplinePosition/Level: Sports TeacherSubjects: Basketball/ T.T./ ChessNos.: FewRequired qualification: Experienced in related disciplinePosition/Level: School NurseNos.: 2Required qualification: ANM/ Staff NursePosition/Level: Hostel WardenNos.: 1Required qualification: Experienced in related disciplinePosition/Level: Cafeteria StaffSubjects: Cook/Assistant Cook, Cafeteria HelperNos.: Two eachRequired qualification: Literate and experiencedPosition/Level: Gardener (Mali)Nos.: 1Required qualification: Literate and experiencedPosition/Level: Aaya (Sister)Nos.: 3Required qualification: Literate and experiencedPosition/Level: Bus HelperNos.: 3Required qualification: Literate and experiencedPosition/Level: Computer Technician/ Lab BoyNos.: 1Required qualification: +2 (intermediate) in SciencePosition/Level: Food and Beverage ManagerNos.: 1Required qualification: +2 (intermediate) in Hotel ManagementNote: Candidate must have:At least two years experience in related field.Fluent English and basic computer skills (Academic)Interested candidates are encouraged to apply within a week along with their application, CV, two pp sized photographs and other testimonials.Apply to HR ManagerReliance International Academy (RIA)Budhanilkantha -10, Kapan, Milanchowk, KathmanduTel: 01-4810529, 4811552Email: info.ria.edu@gmail.comwww.riaschool.edu.npSource: Kantipur Daily, April 19, 2022Tagged as:ANM,Computer Assistant,Computer Teacher,ECA Teacher,English Teacher,Gardener,Grade Teacher,Hostel Warden,Language Instructor,Manager,Math Teacher,Nepali Teacher,Pre-Primary Teacher,Primary Teacher,School Nurse,Science Teacher,Sports Teacher,Staff Nurse", "Page_URL": "https://www.merorojgari.com/job/reliance-international-academy-ria-kathmandu-full-time-computer-technician-lab-boy-bus-helper-aaya-sister-gardener-mali-cafeteria-staff-hostel-warden-school-nurse-sports-teacher-food-and/", "websitename": "merorojgari.com"}, {"name": "IT Officer", "company": "World Vision", "time": "Full Time", "address": "Biratnagar", "deadline": "2022/05/23", "desct": "Full TimeBiratnagarPosted 4 days agoLogin to bookmark this JobWebsiteWorld VisionJOB OPPORTUNITYIT Officer – Business SupportWith over 70 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith.Come join our 34,000+ staff working in nearly 100 countries and share the joy of transforming vulnerable children’s life stories!Key Responsibilities:The IT Officer has the overall responsibility to act as a first line of IT support and provide assistance to WVI Nepal partnership to keep IT equipment’s running smoothly and ensure users get the maximum benefit from them.Service Desk, Service Level Management and Service ImprovementFirst point of contact and day-to-day technical support to end users.Keep all IT equipment’s in working condition and install / configure them for customer use.Responds to Level 1 and Level 2 support and works with vendors on Level 3 support.Researches trouble issues which affect multiple clients.Works with vendor technical support personnel on solutions for clients.Collaborates in the development of service-level objectives and takes steps to meet or exceed targets.Monitors service-level objectives to ensure that requirements are met or exceeded.Follows up in a timely manner to ensure customer satisfaction.Reviews tracking log to identify recurring problems, or problems affecting a large number of clients.Recommends solutions to common problems and updates frequently asked questions documentation.Identifies customer training needs based on common problems.Technical SupportKeep all technical resources are available for meetings that include video conferencing and provide support whenever required.Engages the hardware vendors on issues to remedy issues or escalates for support.Diagnoses and resolves IT equipment’s and mobile devices hardware and software issues.Replace spare parts to make it workable by coordinating with supply chain department.Creates temporary solutions until permanent solutions can be implemented.Coordinates the resolution of escalated application, hardware and software problems.Maintain and support electrical and power backup.Field VisitFrequently visit WVI Nepal field offices for the purpose to fix technical issues.Perform yearly health checkup of IT equipment’s placed at WVI Nepal field offices and owned by WVI Nepal.Inventory ManagementMaintains IT inventory management for all IT equipment and/or software in accordance with company policy and procedures.Administrate end point and mobile device management portal and ensure it is up to date.Maintain IT equipment’s in stock.DocumentationCreates, modifies and reviews documentation of issues resolutions.Develops and delivers documentation to ensure appropriate end-user support.Creates and submits documented resolution to Knowledge Base.Updates manuals/guides to incorporate new recommended products.Prepare report after IT equipment’s health checkup.Required Professional ExperienceAt least 3 years working experience in technology field in terms of providing customer support.Experience on help desk system.Experience on end point management platform including mobile device management platform.Able to change spare parts of IT equipment’s.Excellent communication skill.Good team player.Ability to work independently and under pressure.Required Education, training, license, registration and certificationAt least bachelor degree in information technology, computer engineering or relevant technology field.Preferred Knowledge and QualificationsKnowledge and good understanding on network and system infrastructure.Able to explorer and research problem and have problem solving nature.Applicant Types Accepted:Local Applicants OnlyTagged as:IT Officer,Job in Biratnagar,Job in World Vision,NGO INGO Job in Nepal,NGO INGO Job VacancyTo apply for this job please visitworldvision.wd1.myworkdayjobs.com.", "Page_URL": "https://www.merorojgari.com/job/it-officer/", "websitename": "merorojgari.com"}, {"name": "Driver, Cook, Sports Coach, Telephone Operator, Receptionist, IT Personnel, Public Relations Officer, Floor Incharge, Logistic Officer, Office Assistant, Sales & Marketing, Assistant Accountant, Accountant, Coordinator, Supervisor", "company": "New Age International", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 5 days agoLogin to bookmark this JobNew Age InternationalJOB OPPORTUNITYNew Age International, Gyaneshwor, Ktm. invites application for the following posts. (Estd. 2008)S/N.:1Position: SupervisorTimings:8 hrs.Salary:Rs.35,000/-S/N.:2Position: CoordinatorTimings:8 hrs.Salary:Rs.30,000/-S/N.:3Position: AccountantTimings:8 hrs.Salary:Rs.30,000/-S/N.:4Position: Assistant AccountantTimings:8 hrs.Salary:Rs.23,000/-S/N.:5Position: Sales & MarketingTimings:8 hrs.Salary:Rs.25,000/-S/N.:6Position: Office AssistantTimings:8 hrs.Salary:Rs.21,000/-S/N.:7Position: Logistic OfficerTimings:8 hrs.Salary:Rs.23,000/-S/N.:8Position: Floor InchargeTimings:8 hrs.Salary:Rs.23,000/-S/N.:9Position: Public Relations OfficerTimings:8 hrs.Salary:Rs.25,000/-S/N.:10Position: IT PersonnelTimings:8 hrs.Salary:Rs.25,000/-S/N.:11Position: ReceptionistTimings:8 hrs.Salary:Rs.21,000/-S/N.:12Position: Telephone OperatorTimings:8 hrs.Salary:Rs.21,000/-S/N.:13Position: Sports Coach (Badminton)Timings:8 hrs.Salary:Rs.30,000/-S/N.:14Position: CookTimings:8 hrs.Salary:Rs.25,000/-S/N.:15Position: DriverTimings:8 hrs.Salary:Rs.25,000/-E-mail your application and attach your recent photo along with CV tonewageinthr@gmail.comOnly shortlisted candidates will be called for interview.Source: Kantipur Dainik, April 18, 2022Tagged as:Accountant,Assistant Accountant,Cook,Coordinator,Driver,Incharge,Logistics Officer,Office Assistant,Public Relations Officer,Receptionist,Sports Coach,SupervisorFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/new-age-international-kathmandu-full-time-driver-cook-sports-coach-telephone-operator-receptionist-it-personnel-public-relations-officer-floor-incharge-logistic-officer-office-assistant-sale/", "websitename": "merorojgari.com"}, {"name": "Technical Sales Executive", "company": "Vianet Communications P. Ltd.", "time": "Full Time", "address": "Kathmandu", "deadline": "April 25, 2022", "desct": "Full TimeKathmanduPosted 5 days agoCloses:April 25, 2022Login to bookmark this JobWebsiteVianet Communications P. Ltd.JOB OPPORTUNITYTechnical Sales Executive (TSE)Application Deadine:2022-04-25Number of Vacancy(ies):1Qualification:Bachelors degree in IT or relevant fieldExperience:1-2 years of experience in relevant fieldContract of Employment:Full-timeWorking Hours:8 hoursSalary:NegotiableJob Location:Panipokhari, KathmanduJob Duties & Responsibilities:Follow up the task assignedTask escalation to concerned department if requiredCreate Task based on every customer’s query through email/sms with proper problem titleCoordination between the intra and inter- department /IPTV teamIdentify and escalate priority issues per Client specificationsDevelop diagnostic skills with solution in mindInitiate field support to diagnose initial offsite problem (Form design / Standard Test Report) in mentoring capacityUpdate task as action taken to troubleshoot with common title and clear language as per clienteleReceive handed over task by other shift and handle with prioritizing solutionsActively participate in the training (Tech and non tech) to develop the learningOther Office duties (technical) Assigned by senior authorityNote:Must have two wheeler and a valid driving license.Benefits of joining us!Dashain BonusAnnual leave and sick leaveSocial Security Fund (SSF)Internet BenefitWe provide opportunities for continuous growth and developmentTagged as:Job in Kathmandu,Job in Vianet Communications Private Limited,Sales ExecutiveTo apply for this job please visitwww.vianet.com.np.", "Page_URL": "https://www.merorojgari.com/job/technical-sales-executive/", "websitename": "merorojgari.com"}, {"name": "HR Manager, Software Developer, Backend Developer, Sales Managers, Marketing Managers, CSR, Manager, Managing Directors, C-Suite Executive Assistants, Production Workers, Production Supervisors, Warehouse & Inventory Managers, Quality Control Managers, Sales Lead, Network & Computer System Admin", "company": "Manaram Himalayan Handicraft", "time": "Full Time", "address": "Jhapa, Ilam, Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeJhapa, Ilam, KathmanduPosted 5 days agoLogin to bookmark this JobManaram Himalayan HandicraftJOB OPPORTUNITYManaram Himalayan Handicraftis a small company with exponential growth. As per the Export Council of Nepal, we are recognized and awarded as the #1 exporter of Nepal from 2017 to 2021. Now, we are looking for honest, humble, hungry & enthusiastic candidates to join our team and take it to the next level and make Nepal proud.Positions: HR ManagerNumber of people required: 1Positions: Managing DirectorsNumber of people required: 3Positions: C-Suite Executive AssistantsNumber of people required: 2Positions: ManagerNumber of people required: 2Positions: Production WorkersNumber of people required: 30Positions: Production SupervisorsNumber of people required: 4Positions: Warehouse & Inventory ManagersNumber of people required: 2Positions: Marketing ManagersNumber of people required: 2Positions: Sales ManagersNumber of people required: 2Positions: Quality Control ManagersNumber of people required: 2Positions: CSRNumber of people required: 3Positions: Sales LeadNumber of people required: 2Positions: Network & Computer System AdminNumber of people required: 1Positions: Backend DeveloperNumber of people required: 1Positions: Software DeveloperNumber of people required: 1Location: Birtamod (Jhapa), Godak (Ilam), Baluwatar (Kathmandu).Interested and eligible candidates are requested to forward their updated CV toadmin@manaram.groupWomen are highly encourageg to apply.Source: Kantipur Daily, 18 April, 2022Tagged as:Admin,Executive Assistant,HR Manager,Job in Ilam,Job in Jhapa,Job in Kathmandu,Managing Director,Marketing Manager,Sales Manager,Software Developer,SupervisorFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/manaram-himalayan-handicraft-jhapa-ilam-kathmandu-full-time-hr-manager-software-developer-backend-developer-sales-managers-marketing-managers-csr-manager-managing-directors-c-suite-executive/", "websitename": "merorojgari.com"}, {"name": "Basic Level Teacher (English, Nepali, Mathematics, Social Studies, Science), Grade Teacher, ECA Specialist, Computer Operator, Dance Teacher, Music Teacher, Yoga Teacher, School Nurse", "company": "Bagmati Boarding Secondary School", "time": "Full Time", "address": "Kathmandu", "deadline": "April 24, 2022", "desct": "Full TimeKathmanduPosted 5 days agoCloses:April 24, 2022Login to bookmark this JobWebsiteBagmati Boarding Secondary SchoolJOB OPPORTUNITYA leading academic institution is seeking for talented, dynamic and highly motivated candidates for the following posts:Post: Basic Level English Teacher – 2Qualification: Bachelor/Master degree in related field.Post: Basic Level Nepali TeacherQualification: Bachelor/Master degree in related field.Post: Basic Level Mathematics TeacherQualification: Bachelor/Master degree in related field.Post: Basic Level Social Studies TeacherQualification: Bachelor/Master degree in related field.Post: Basic Level Science TeacherQualification: Bachelor/Master degree in related field.Post:Grade Teacher – 2Qualification: Bachelor/Master degree in related field.Post: ECA SpecialistQualification: Bachelor degreePost: Computer OperatorQualification: +2 (intermediate)Post: Dance TeacherPost: Music TeacherPost: Yoga TeacherPost: School NurseQualification: PCL Nursing/BN, BSc. NursingInterested and qualified candidates having at least 2 years experience in the related field are requested to send their handwritten application, updated CV and all necessary documents with a passport size photograph to the following address byApril 24, 2022.Bagmati Boarding Secondary SchoolSukedhara, KathmanduEmail ID: bbschool1996@gmail.com,Tel: 01-4372218Source: Kantipur Daily, 18 April, 2022Tagged as:Computer Operator,Dance Teacher,English Teacher,Grade Teacher,Math Teacher,Music Teacher,Nepali Teacher,School Nurse,Science Teacher,Social Studies Teacher,Yoga Instructor", "Page_URL": "https://www.merorojgari.com/job/bagmati-boarding-secondary-school-kathmandu-full-time-basic-level-teacher-english-nepali-mathematics-social-studies-science-grade-teacher-eca-specialist-computer-operator-dance-teacher-musi/", "websitename": "merorojgari.com"}, {"name": "Officer, Junior Officer, Supervisor", "company": "Best Finance Company Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "May 2, 2022", "desct": "Full TimeAnywherePosted 5 days agoCloses:May 2, 2022Login to bookmark this JobWebsiteBest Finance Company Ltd.JOB OPPORTUNITYBest Finance Company Ltd., a leading “C” class National Level Finance Company invites application from self-motivated, skilled, dynamic and result oriented Nepalese individuals who have passion to excel in banking sector for the following position:1. Department Head (Recovery) Position: OfficerNo of vacancies: 1Qualification: Should have Bachelor’s degree in Management/Economics or Equivalent Degree from recognized University.Experience: At least 5 years’ experience in Finance companies, handling the recovery department independently as department head.Age: Not exceeding 35 years on the date of application.2. Department Head (Information Technology) Position: Junior OfficerNo of vacancies: 1Qualification: Should have Bachelor’s degree in Information Technology from recognized University.Experience: At least 2 years’ experience in Finance companies, handling the IT department independently as department head.Age: Not exceeding 35 years on the date of application.3. Department Head (Human Resource) Position: SupervisorNo of vacancies: 1Qualification: Should have Bachelor’s degree in Management/Economics or Equivalent Degree from recognized University.Experience: At least 2 years’ experience in Finance companies, handling the HR department independently as department head.Age: Not exceeding 30 years on the date of application.The candidates are expected to have smart personality, pleasant and cheerful nature with excellent interpersonal skills, leadership ability and positive attitude.Internal candidates will be given priority for the above positions for which the criteria will be as per the Employee Service Bye-lays of the company.To Apply:Interested candidate meeting the above criteria are encouraged to e-mail their application, updated CV and recent photograph atvacancy2078@outlook.comwithin 15 days from notice published date.Only shortlisted candidates will be called for the further selection process. Finance Company reserves the right to reject any/all applications without assigning any reason whatsoever.Salaries and perks:As per Company’s Employees Service Bye-laws.Best Finance Company Ltd.Head Office:Kamaladi, KathmanduPh :01-4442461/62/63Source: Rajdhani Daily, 18 April, 2022Tagged as:Junior Officer,Officer,SupervisorFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/best-finance-company-ltd-full-time-officer-junior-officer-supervisor/", "websitename": "merorojgari.com"}, {"name": "CSR, Production Workers, Sales Lead, C-Suite Executive Assistants, Production Supervisors, HR Manager, Managing Directors, Manager, Warehouse & Inventory Managers, Marketing Managers, Quality Control Managers, Network & Computer System Admin, Backend Developer, Software Developer, Sales Manager", "company": "Manaram Himalayan Handicraft", "time": "Full Time", "address": "Jhapa, Ilam, Kathmandu,", "deadline": "2022/05/23", "desct": "Full TimeJhapa, Ilam, Kathmandu,Posted 6 days agoLogin to bookmark this JobManaram Himalayan HandicraftJOB OPPORTUNITYManaram Himalayan Handicraft is a small company with exponential growth. As per the Export Council of Nepal, we are recognized and awarded as the #1 exporter of Nepal from 2017 to 2021. Now, we are looking to join our team and take it to the next level and make Nepal proud.S.No.:1Position: HR ManagerNumber of people required:1S.No.:2Position: Managing DirectorsNumber of people required:3S.No.:3Position: C-Suite Executive AssistantsNumber of people required:2S.No.:4Position: ManagerNumber of people required:2S.No.:5Position: Production WorkersNumber of people required:30S.No.:6Position: Production SupervisorsNumber of people required:4S.No.:7Position: Warehouse & Inventory ManagersNumber of people required:2S.No.:8Position: Marketing ManagersNumber of people required:2S.No.:9Position: Sales ManagersNumber of people required:2S.No.:10Position: Quality Control ManagersNumber of people required:2S.No.:11Position: CSRNumber of people required:3S.No.:12Position: Sales LeadNumber of people required:2S.No.:13Position: Network & Computer System AdminNumber of people required:1S.No.:14Position: Backend DeveloperNumber of people required:1S.No.:15Position: Software DeveloperNumber of people required:1Location:Birtamod (Jhapa), Godak (Ilam), Baluwatar (Kathmandu)Interested and eligible candidates are requested to forward their updated CV toadmin@manaram.groupWomen are highly encouraged to apply.Tagged as:Admin,Customer Service Representative,Director,Job in Ilam,Job in Jhapa,Job in Kathmandu,Manager,Managing Director,Marketing Manager,Sales,Sales Manager,Software DeveloperFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/manaram-himalayan-handicraft-jhapa-ilam-kathmandu-full-time-csr-production-workers-sales-lead-c-suite-executive-assistants-production-supervisors-hr-manager-managing-directors-manager-wareh/", "websitename": "merorojgari.com"}, {"name": "Content and SEO Writer", "company": "Oli and Associates", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 6 days agoLogin to bookmark this JobWebsiteOli and AssociatesJOB OPPORTUNITYContent and SEO WriterNo. of Vacancies: 1Location: KathmanduKey Responsibilities:Bachelor’s degree in English, Journalism or related fieldAt least one years of experience writing for a B2B audienceKnowledge of digital marketing tactics, including SEO, email marketing and web analyticsExcellent writing skills, as well as the ability to communicate and collaborate effectivelyExperience using WordPress, Weebly, and/or Joomla! preferredFamiliarity with web publicationsExcellent writing and editing skills in EnglishAbility to meet deadlinesPriority will be given to the candidate who can join immediately.Job Description:Create content marketing campaigns to drive leads and subscribers Use SEO best practices to generate traffic to our siteRegularly produce various content types, including email, social media posts, blogs, and white papersActively manage and promote our blog, and pitch articles to relevant third-party platformsEdit content produced by other members of the teamAnalyze content marketing metrics and makes changes as neededCollaborate with other departments to create innovative content ideasContent Writers with a strong set of English writing skills to join our enterpriseResearching industry-related topics (combining online sources, interviews, and studies)Writing clear marketing copy to promote our products/servicesPreparing well-structured drafts using Content Management SystemsP.S. Programming skills and strong business acumen are a plus pointProofread and edit blog posts before publicationConduct simple keyword research and use SEO guidelines to increase web trafficPromote content on social mediaIdentify customers’ needs and gaps in our content and recommend new topicsEnsure all-around consistency (style, fonts, images and tone)Update website content as neededTagged as:Content Writer,Copywriter,Job in KathmanduTo apply for this job please visitwww.oli.com.au.", "Page_URL": "https://www.merorojgari.com/job/content-and-seo-writer/", "websitename": "merorojgari.com"}, {"name": "Call Center (Sr. Assistant), Operation (Sr. Assistant), Content Writer (Jr. Executive/Executive), Digital Marketing (Jr. Executive)", "company": "Pathao Nepal Private Limited", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 7 days agoLogin to bookmark this JobWebsitePathao Nepal Private LimitedJOB OPPORTUNITYPathao Nepal Pvt. Ltd. is hiring!Call Center (Sr. Assistant) – 6Operation (Sr. Assistant) – 1Content Writer (Jr. Executive/Executive) – 2Digital Marketing (Jr. Executive) – 1Tagged as:Content Writer,Digital Marketer,Executive,Junior Executive,Senior AssistantTo apply for this job please visitdocs.google.com.", "Page_URL": "https://www.merorojgari.com/job/call-center-sr-assistant-operation-sr-assistant-content-writer-jr-executive-executive-digital-marketing-jr-executive/", "websitename": "merorojgari.com"}, {"name": "Senior Electrical Engineer", "company": "Hydro-Consult Engineering", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 7 days agoApplications have closedLogin to bookmark this JobWebsiteHydro-Consult EngineeringJOB OPPORTUNITYSenior Electrical EngineerJob DescriptionQualification and work experience required: MSc. In Electrical Engineering from the reputed University with minimum 2 years of experience in Electrical & Electro Mechanical design in Hydropower projects OR Bachelor in Electrical Engineering with 5 years of experience in Electrical & Electro Mechanical design in Hydropower projectsWork Description and ResponsibilityPrepare detail study report with full documentation on the actual design including all design principal criteria, parameters and standards to which the project has been designed.Review all technical drawings of electromechanical design received from electromechanical contractor, coordinate in discussion with Project Manager, works connected with electrical design of the particular project.Check the quality of the reports & drawings of all electrical design and submit to the Project Manager.Give technical supervision as required to other parties including client.Check the quality of the production of necessary and other reports in electrical design required by the Project Management contract.Make the Project site visits; liaise with Project site staff regarding electrical design issues at site.Be an active member of the Project Management Team.Undertake other tasks and assignments as given from time to time by the Project Manager.Knowledge regarding the international standard used in the electromechanical and electrical design.SkilsKnowledge in software such as ETAP, PLS CADD, Auto CadGood in Microsoft office packagesBe thorough and pay attention to detailsAnalytical thinking skillsExcellent communication skillsAbility to tackle problems and come up with appropriate solutionsFemale candidates are highly encouraged to apply.Deadline of submission: 22 April, 2022 (during office hour)Tagged as:Electrical Engineer", "Page_URL": "https://www.merorojgari.com/job/senior-electrical-engineer/", "websitename": "merorojgari.com"}, {"name": "Senior Flutter Developer", "company": "Nipuna Prabidhik Sewa", "time": "Full Time", "address": "Pokhkara", "deadline": "2022/05/23", "desct": "Full TimePokhkaraPosted 1 week agoLogin to bookmark this JobWebsiteNipuna Prabidhik SewaJOB OPPORTUNITYSenior Flutter DeveloperNipuna Prabidhik Sewais looking for Flutter Developer with minimum 2-3 years of experience having strong knowledge in dart language.RequirementsBachelor or Master’s degree in Computer Science or related field.At least 2-3 years working as a professional developer (prefer iOS or Android)Work within a team to understand, collaborate and deliver the business goalsKnowledge of git Apply good software Development pattern(Redux BLoC)Strong knowledge of XML, JSON, and Rest API DevelopmentExperience building a moderately complex app with good knowledge of Dart languageExperience using mobile design patterns, building mobile frameworks, and building custom widgetsImplementation of security and data protection, Integration of data storage solutionsAble to integrate multiple data sources and databases into one systemStrong knowledge of MVC, MVVM, Architecture component, and memory managementExperience in cloud platforms such as AWSPublished one or more Android/iOS/ReactNative/Flutter apps in the Google Play Store/App StoreResponsibilitiesDevelop and maintain web applications according to business requirements and technical specifications.Design, Development, and testing of existing & new Mobile AppsParticipating in task estimation, taking part in crafting stories/requirementsDesign and implementation of low-latency, high-availability, and performant applicationsWilling to learn and work on different mobile platforms/frameworks when neededDetermine feasibility of technical solutions within time and budget constraints.Ensure secure software and infrastructure by adhering to industry standards and best practices.Debug existing software components, fix issues and avoid regressionsLead the team and assure overall coherence regarding concepts and implementation.Be proactive, take ownership and be accountableMaintain effective working relationship with the client according to agreed proceduresTagged as:Developer,Job in PokharaTo apply for this job please visitwww.nipunasewa.com.", "Page_URL": "https://www.merorojgari.com/job/senior-flutter-developer/", "websitename": "merorojgari.com"}, {"name": "Senior Magento Developer", "company": "Nipuna Prabidhik Sewa", "time": "Full Time", "address": "Pokhara", "deadline": "2022/05/23", "desct": "Full TimePokharaPosted 1 week agoLogin to bookmark this JobWebsiteNipuna Prabidhik SewaJOB OPPORTUNITYSenior Magento DeveloperNipuna Prabidhik Sewais looking for Mid-Level Magento Developer with at least 2-3 years of working experience.RequirementsA Bachelor’s Degree in computer science or similarMust have 2+ years working on Magento projects for ClientsWorked with Magento PluginsWorked with Magento UpgradesStrong object-oriented programming knowledgeVery good PHP knowledgeJavaScript is a must for front-end developmentKnowledge of database operations with MySQL/MariaDB, Stored proceduresAbility to write APIs including Restful APIs.Strong documentation, communication, and team collaboration skills.ResponsibilitiesRegularly update our Magento installationInstall security patchesDevelop new functionalityImplement front-end changesEstimate effort required to implement changes and enhancementsDevelop Magento Modules and Customization, Extension Development.Understand project fully and take ownership of the documents required for project scoping.Perform site releases and site updates for clients Write application code and extensions that exceeds the defined quality standards.Tagged as:Developer,Job in PokharaTo apply for this job please visitwww.nipunasewa.com.", "Page_URL": "https://www.merorojgari.com/job/senior-magento-developer/", "websitename": "merorojgari.com"}, {"name": "Senior WordPress Developer", "company": "Nipuna Prabidhik Sewa", "time": "Full Time", "address": "Pokhara", "deadline": "2022/05/23", "desct": "Full TimePokharaPosted 1 week agoLogin to bookmark this JobWebsiteNipuna Prabidhik SewaJOB OPPORTUNITYSenior WordPress DeveloperNipuna Prabidhik Sewais looking for a WordPress Developer with at least 2-3 years of experience having strong knowledge in theme and plugin building.Requirements:Bachelor’s degree in Computer Science or a similar field.Proven work experience as a WordPress Developer.Knowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.Knowledge of code versioning tools including Git, Mercurial, and SVN.Experience working with debugging tools such as Chrome Inspector and Firebug.Good understanding of website architecture and aesthetics.Ability to project manage.Good communication skills.Job DescriptionDesigning and building the website front-end.Creating the website architecture.Designing and managing the website back-end including database and server integration.Generating WordPress themes and plugins.Conducting website performance tests.Troubleshooting content issues.Conducting WordPress training with the client.Monitoring the performance of the live website.Tagged as:Job in Pokhara,WordPress DeveloperTo apply for this job please visitwww.nipunasewa.com.", "Page_URL": "https://www.merorojgari.com/job/senior-wordpress-developer/", "websitename": "merorojgari.com"}, {"name": "Senior Laravel Developer", "company": "Nipuna Prabidhik Sewa", "time": "Full Time", "address": "Pokhara", "deadline": "2022/05/23", "desct": "Full TimePokharaPosted 1 week agoLogin to bookmark this JobWebsiteNipuna Prabidhik SewaJOB OPPORTUNITYSenior Laravel DeveloperNipuna Prabidhik Sewais looking for a mid-level Laravel Developer with at least 2-3 years of experience having strong knowledge of bootstrap, PHP, jquery, MVC Architecture, MySQL.RequirementsPrevious working experience as a PHP / Laravel developerBS/MS degree in Computer Science, Engineering, MIS or similar relevant fieldIn depth knowledge of object-oriented PHP and Laravel 5/6 PHP FrameworkHands on experience with SQL schema design, SOLID principles, REST API designGood understanding of front-end (e.g. HTML/ CSS, JavaScript, XML, j Query) and back-end technologiesAdaptive to the new technologies/architecture.Experience designing and developing responsive design websites.Knowledge of E-commerce, Payment Gateway, CMS etc.Familiarity with databases (e.g. MySQL, MongoDB),web servers (e.g. Apache) and UI/UX design.Knowledge of SVN / GIT is a must.Excellent communication and teamwork skills.Must have good analytical and problem-solving skillsKnowledge in Vue.js is a plus.ResponsibilitiesWrite technical and developed documentation for new and existing applicationsDevelop APIs and applicationsBuild efficient, testable, and reusable PHP modulesSolve complex performance problems and architectural challengesPerform unit and system-level testing using various testing frameworksEnsure HTML, CSS, and shared JavaScript is valid and consistent across applicationsPrepare and maintain all applications utilizing standard development toolsUtilize backend data services and contribute to increase existing data services APIConvey effectively with all task progress, evaluations, suggestions, schedules along with technical and process issuesDocument the development process, architecture, and standard componentsParticipate in the entire application lifecycle, focusing on coding and debuggingKeep abreast of new trends and best practices in web development.Tagged as:Developer,Job in PokharaTo apply for this job please visitwww.nipunasewa.com.", "Page_URL": "https://www.merorojgari.com/job/senior-laravel-developer/", "websitename": "merorojgari.com"}, {"name": "Customer Service Representative (Application Support)", "company": "NBIT Pvt. Ltd", "time": "Full Time", "address": "Balkumari,Lalitpur", "deadline": "2022/05/23", "desct": "Full TimeBalkumari,LalitpurPosted 1 week agoLogin to bookmark this JobWebsiteNBIT Pvt. LtdJOB OPPORTUNITYPosition: Customer Service Representative (Application Support)Qualification: Bachelor’s degree in IT or relevant fieldExperience: 1+ years of experience in relevant field (Hospitality Industry application preferred)Location: Balkumari, LalitpurSalary: NegotiableSkills and Knowledge:Excellent listening and questioning skills, combined with the ability to interact confidently with clients to establish what the problem is and explain the solution.The ability to work well in a team.Problem-solving skills.A strong customer focus.The ability to prioritize your workload.Attention to detail.Good communication skillsJob Duties & Responsibilities:Level 1 support with direct inbound calls.Task escalation to Level 2 if required.Basic windows user creation and networking terminals issue fix.Create Task based on every customer’s query through email/SMS with the proper problem title.Identify and escalate priority issues per Client specifications.Develop diagnostic skills with a solution in mind.Actively participate in the training (Tech and non-tech) to develop the learning.We Provide:Working in a team environment.High level of responsibility and excellent career possibilities.5 Working Days per Week.Team Building Activities.Timely Salary Review and Performance Appraisals.Medical and accidental insurance.Dashain BonusTo apply please send your resume tocareers@nbit.com.npwith “Customer Service Representative (Application Support) ” in the subject line.Tagged as:Customer Service Representative,Job in LalitpurFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/nbit-pvt-ltd-balkumarilalitpur-full-time-customer-service-representative-application-support/", "websitename": "merorojgari.com"}, {"name": "Reception, Computer Operator, Guard, Peon, Sweeper, Accountant, Administration, Teacher (Primary/ Lower Secondary/ Secondary)", "company": "New English Secondary Boarding School", "time": "Full Time", "address": "Janakpur", "deadline": "2022/05/23", "desct": "Full TimeJanakpurPosted 1 week agoApplications have closedLogin to bookmark this JobNew English Secondary Boarding SchoolJOB OPPORTUNITYEnglish TeacherClass: 3-5 and 6-10Required number: FewScience TeacherClass: 1-2, 3-5 and 6-7Required number: FewNepali TeacherClass: 6-10Required number: FewMathematics TeacherClass: 3-5 and 6-10Required number: FewSocial Studies TeacherClass: 3-5 and 6-10Required number: FewComputer TeacherClass: 3-5 and 6-10Required number: FewAdministrationRequired number: 2AccountantRequired number: 1ReceptionRequired number: 1Computer OperatorHaving good computer knowledge and able to operate computer lab.Required number: 2Guard (Male)Required number: 1Peon (Male)Required number: 1SweeperRequired number: 1Interested candidates are requested to submit the application along with citizenship, academic certificate, experience certificate and bio-data within the3 daysof notice publication.Contact number: 041-425102, 9844115122, 9813941961New English Secondary Boarding SchoolMuralichowk, Janakpurdham – 04Source: Janakpur Today, 13 April, 2022Tagged as:Accountant,Administration,Computer Operator,Computer Teacher,English Teacher,Job in Janakpur,Nepali Teacher,peon,Receptionist,Science Teacher,Security Guard,Social Studies Teacher,Sweeper", "Page_URL": "https://www.merorojgari.com/job/reception-computer-operator-guard-peon-sweeper-accountant-administration-teacher-primary-lower-secondary-secondary/", "websitename": "merorojgari.com"}, {"name": "Web3 Research Analyst", "company": "SOURCE CODE PVT LTD.", "time": "Full Time", "address": "Anywhere", "deadline": "April 25, 2022", "desct": "Full TimeAnywherePosted 1 week agoCloses:April 25, 2022Login to bookmark this JobWebsiteSOURCE CODE PVT LTD.JOB OPPORTUNITYWeb3 Research Analyst – 2Monthly Salary:50k to 100k– Bachelor’s Degree in Computer ScienceExperience:Drive to learn and growWhat are we looking for?We are looking for curious individuals with a growth mindset and the ability to reason from first principles. Familiarity with the web3 space is not required, but a drive to learn and understand web3 infrastructure and technologies is a must.Join Our teamSend your CV at career@sourcecode.com.npApply Before 25th April, 2022For details JD please visitwww.sourcecode.com.np/Career.aspxSource Code+977 9802066721, 9802071682www.sourcecode.com.npSource: The Himalayan Times, 13 April, 2022Tagged as:Research AnalystFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/source-code-full-time-web3-research-analyst/", "websitename": "merorojgari.com"}, {"name": "UI/ UX Designer", "company": "Click and Press Pvt. Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 1 week agoLogin to bookmark this JobWebsiteClick and Press Pvt. Ltd.JOB OPPORTUNITYUI/ UX DesignerAtClick and Press, everyone is encouraged to unleash their potential to build a solid career for the future. We are looking for a UI/ UX designer.Key Objectives:Creating user-centered designs by understanding business requirements, and user feedbackCreating user flows, wireframes, prototypes, and mockupsTranslating requirements into style guides, design systems, design patterns, and attractive user interfacesDesigning UI elements such as input controls, navigational components, and informational componentsCreating original graphic designs (e.g. images, sketches, and tables)Identifying and troubleshooting UX problems (e.g. responsiveness)Collaborating effectively with the product, engineering, and management teamsIncorporating customer feedback, usage metrics, and usability findings into design in order to enhance user experienceRequirements:Proficient in Adobe Creative Suite (specifically Illustrator, InDesign, and Photoshop)Proficient in prototyping tools such as Sketch, InVision, etc.Basic HTML5, CSS3, and JavaScript skills are a plusPay strong attention to detail and have a keen eye for aestheticsExcellent communication skills and can clearly articulate your ideas, designs, and suggestionsStrong team player who can collaborate effectively with different stakeholdersPrior experience as a UI/UX Designer as well as a strong portfolio of related projectsWe believe in empowering our employees and doing all we can to keep them focused, happy and motivated. We offer a convenient 5 days/week work schedule, an enriching and hospitable working environment, with cooked lunch and refreshing tea and coffee at work.If you are interested, email your resume tosamagya@clickandpress.com(mention “Application for UI/ UX designer” in the email subject)Tagged as:DesignerFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/click-and-press-pvt-ltd-full-time-ui-ux-designer/", "websitename": "merorojgari.com"}, {"name": "Associate Project Manager (Software Development)", "company": "Young Minds Creation (P) Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteYoung Minds Creation (P) Ltd.JOB OPPORTUNITYAssociate Project Manager (Software Development)Number of requirements: 5Roles and Responsibilities:Develop and maintain effective relationships with customers, gaining acceptance to proposals and changes.Take responsibility for preparing the Project Initiation Documents.Ensure effective handover of projects from sales to production.Work and manage technical team to manage, plan and deliver the projectIdentify resource requirements, plan capacity, and manage availabilityResponsible to create project documentationJob RequirementsBachelor degree in ITExperience in handling projectsVerbal and written communication skills – both English and Nepali.Excellent analytical and problem-solving skills.Interested Candidates send you updated resume atjobs@youngminds.com.npTagged as:Associate Manager,Project Manager,Software DeveloperFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/young-minds-creation-p-ltd-full-time-associate-project-manager-software-development/", "websitename": "merorojgari.com"}, {"name": "Graphic Designer", "company": "Ads Market Pvt. Ltd.", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 2 weeks agoLogin to bookmark this JobWebsiteAds Market Pvt. Ltd.JOB OPPORTUNITYGraphic DesignerThe ideal candidate will have strong creative skills and a portfolio of work which demonstrates their passion for illustrative design and typography. This candidate will have experiences in working with numerous different design platforms such as digital and print forms.Salary: 30 to 35kLocation: DurbarmargResponsibilitiesCollaborate with the team to ensure consistency of designs across various media outletsCreate compelling and effective logos, designs, print and digital mediaMaintain awareness of current industry and technology standards, social media, competitive landscape and market trendsStudy design briefs and determine requirementsSchedule projects and define budget constraintsConceptualize visuals based on requirementsPrepare rough drafts and present ideasDevelop illustrations, logos and other designs using softwareUse the appropriate colors and layouts for each graphicAmend designs after feedbackEnsure final graphics and layouts are visually appealing and on-brandRequirements and skillsProven graphic designing experienceA strong portfolio of illustrations or other graphicsFamiliarity with design software and technologies (such as InDesign, Illustrator, Dreamweaver, Photoshop)A keen eye for aesthetics and detailsExcellent communication skillsAbility to work methodically and meet deadlinesDegree in Design, Fine Arts or related field is a plusPlease email us your resume and portfolio athr@adsmarket.com.npTagged as:Graphic Designer,Job in KathmanduFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/ads-market-pvt-ltd-kathmandu-full-time-graphic-designer/", "websitename": "merorojgari.com"}, {"name": "Full-Stack Software Engineer (Ruby)", "company": "Houzz", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteHouzzJOB OPPORTUNITYFull-Stack Software Engineer (Ruby)Locations: NepalTime type: Full timeJob requisition id: R0000682About HouzzHouzz is the world’s leading platform for home remodeling and design, helping more than 2.5 million home professionals in over 100 categories to grow and manage their business. Through Houzz, a community of more than 65 million homeowners and home design enthusiasts find ideas, hire professionals, source products and access tools to update their homes from start to finish. Houzz is available in every country around the world with localized platforms in more than 10 countries across North America, Europe, Asia and Australia.About the RoleWe are looking for a passionate and motivated Ruby on Rails developer to build innovative and cutting edge software for the construction industry.You will be a member of our development team building a unique application within a challenging domain with users around the world.This is a remote position, you can work anywhere in Nepal.__________________What You’ll DoDesign and develop new front end applications for various platforms.Develop new user-facing features.Convert VueJs components to ReactJsPerform code analysis, requirements analysis, system risk analysis, and software reliability analysisBe in charge of tuning, improvement, balancing, usability, and automationOptimize applications for maximum speed and scalability.Develop and maintain specifications and designs for complex applications.Take full ownership of features. Work based on best practices and business priorities while collaborating with other teams to make a big impact on our product.Take an active part in planning and designing features. Working closely with the Product and UX teams in order to fulfill the product vision.Understand and measure the impact of your features using state of the art monitoring tools.Implement and test your code with unit and integration tests, and contribute to our automation infrastructure.At a Minimum, We’d Like You to Have4+ years of experience with Ruby on Rails preferably with React and Vue.BSc in Computer Science or an equivalentDevelop complex systems and integrationsGood knowledge of service oriented development and design patternsGood understanding of web application development and SaaS modelsHighly motivated problem solver, team player, and a passion for technologiesKnowledge of HTML Canvas elementIdeally, You’ll Also HaveUnderstanding of front-end JavaScript architecture and design patterns for high performance applicationsExperience with HTML, CSS/SCSS, and responsive designAbility to write effective unit, integration, and end-user automation testsStrong understanding of Agile methodologiesStrong communication skills with ability to communicate complex technical concepts and align the organization on decisionsSound problem-solving skills with the ability to quickly process complex information and present it clearly and simplyUtilizes team collaboration to create innovative solutions efficientlyB.S. Computer Science or related field (Masters a plus)__________________Be Who You Are and Do What You Love at HouzzWe’re a FamilyAt Houzz, we strive to create and foster a strong family environment in our workplace. We collaborate to accomplish our goals, always working as a team. We aim to build a culture of inclusion — celebrating and leveraging our differences for the betterment of one another, our products and our community.Houzz team members come from many backgrounds and bring diverse experiences to the company. We take pride in making each person feel at home.We Build the FutureJoin Houzz in revolutionizing the home remodeling and design industry and have an impact on our community of more than 65 million homeowners and home design enthusiasts who use our platform and the 2.5 million-plus home professionals around the world who grow and manage their business with Houzz Pro. Houzz has been named one of the most innovative companies in the world by CNBC and others, and is backed by top venture capitalists. At Houzz, you can help drive the future of an industry worth over $1 trillion in the U.S. and Europe alone.We Make Things HappenOur team members play a key role in guiding the direction of our company and are able to work across multiple groups to implement fresh ideas that allow Houzz to be the industry leader. If you are interested in applying your passion to create products that will transform the lives of millions of people who are designing, remodeling and decorating their homes, welcome to Houzz.Houzz is proud to be an Equal Employment Opportunity employer. When applying for a role at Houzz, we guarantee your application will be considered regardless of your sex, race, religion, color, gender, national origin, height or weight, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military and veteran status or any other basis protected by federal, state or local law or ordinance or regulation.We embrace and celebrate the value that diversity brings to an organization and understand that diverse backgrounds and different points of view are essential components of helping Houzz in our mission to provide the best experience for home renovation and design. Houzz is committed to fostering an inclusive environment through projects and initiatives such as employee resource groups and diversity workshops.Houzz celebrates differences and strives to create a comfortable and authentic climate for Houzzers to feel supported, where they are welcomed to think creatively and contribute to innovative ideas, while having the freedom to be themselves and share their lives at work.Tagged as:Software EngineerTo apply for this job please visithouzz.wd5.myworkdayjobs.com.", "Page_URL": "https://www.merorojgari.com/job/full-stack-software-engineer-ruby/", "websitename": "merorojgari.com"}, {"name": "Senior Graphic Designer", "company": "Fusemachines Nepal Pvt. Ltd.", "time": "Full Time", "address": "Kathmandu", "deadline": "2022/05/23", "desct": "Full TimeKathmanduPosted 2 weeks agoLogin to bookmark this JobWebsiteFusemachines Nepal Pvt. Ltd.JOB OPPORTUNITYSenior Graphic DesignerFusemachines is a leading AI strategy, talent, and education services, provider. Founded by Sameer Maskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI. With a presence in 4 countries (Nepal, the United States, Canada, and the Dominican Republic and more than 250 full-time employees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.Key ObjectiveThe Senior Graphic Designer will work in all areas from conceptualization through execution while managing multiple projects simultaneously. They can problem solve on multiple projects while bringing strong solutions to the table and be capable in clearly articulating campaigns.Qualification & Experience3-5 years of experience working as a graphic designer, motion graphics designer, or a Visual Designer.Degree in Design, Fine Arts or related fields is a plus.A diverse portfolio demonstrates a thorough understanding of color, typography, hierarchy, layout, and visual storytelling across a variety of brands and audiences.Experience with a variety of design processes and methodologiesRequired skills/CompetenciesHighly proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign).After Effects/Adobe Premiere and animation experience is a plusAn exceptional eye for detail, ensuring delivery meets the specifications and identifying areas of weakness in a design and the ability to proactively solve those problemsPassionate about design and look for methods to give back, such as writing, speaking, teaching, mentoring, or volunteering.Strong project planning, organization, and time management skillsStrong written and verbal communication skills in English.Familiarity or the ability to learn and adapt to current trends and best practices.Key ResponsibilitiesDevelop and maintain the aesthetic of the brand and ensure that all materials are designed and produced accordingly.Work closely with the cross-functional departments, creating primarily digital and some print design for: campaigns, web design, sales collateral, presentations, social, and company branding.Maintain a strong sense of communication between business and creative types: responsible both to review the work of junior designers to help give guidance and feedback to help align with business needs.Maintain a high level of quality and make sure only the best work/concepts are released.Ask smart questions, take risks and champion new ideas.Prioritizing tasks based on deadline proximity.Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.Tagged as:Graphic Designer,Job in IT company,Job in KathmanduTo apply for this job please visitjobs.fusemachines.com.", "Page_URL": "https://www.merorojgari.com/job/senior-graphic-designer-2/", "websitename": "merorojgari.com"}, {"name": "Media Administrators", "company": "Omnicom Media Group Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteOmnicom Media Group NepalJOB OPPORTUNITYMedia AdministratorsOmnicom Media Group Nepal, a subsidiary of OmnicomMediaGroup Australia is looking to hire few Media Administrators.As a Media Administrator, you will play a vital role in providing support to the broader team across all facets of business management, from accurate loading through to account reconciliation.Every single task conducted needs to be completed with complete accuracy, high levels of attention to detail, and collaboration at the forefront.This is an entry-level role where you will develop a foundation of knowledge and skills. You will be taught, via internal training workshops, and full-on-the-job training to be an expert in the media administration process.You will be expected to work across all clients within your business patch and understand the different nuances between each client’s requirements. As your knowledge increases your remit of tasks will extend and under guidance, you will eventually take ownership of all media administration responsibilities.Job Duties and ResponsibilitiesMedia Process ManagementActively participate in client timeline management to ensure all deliverables are received on time and to a high standard.Understand the business dynamics of the client patch you work across.Stakeholder Management (Internal / External)Grow and maintain good media relationships through polite and clear emails or phone calls with media partnersBuild a relationship with your agency-client team, OMG Finance, and the Billings team.Team ManagementPrioritize regular check-ins with the manager and ensure agency processes are understoodActively participate in educational opportunities across the agency; attend all training made available as well as agency team meetings.Finance ManagementUnderstand the nuances of each channels loading process, across Online (digital), offline (Radio, TV, Outdoor), and ProductionCheck confirmations against media plans to ensure the activity is per the media plans/booked with the media vendorsEnsure all booked activity is loaded into SMD (OMG’s media finance system) within 48 hours of receipt of confirmations & IOs). This must be completed with absolute accuracy. The activity can only be invoiced to the client once it has been loaded correctlyRespond to Business Management team requests for Formstacks and Media Adjustments in a timely mannerComplete end of month media finance proforma checks, as per the defined process, by the deadline set, thus ensuring the client is invoiced correctly, accurately, and on timeComplete all financial reporting for the client in a timely manner including all financial reporting (PO Trackers & Budget Reconciliation)Complete all required trackers for your client as required, including but not limited to OMNet tracker, MBA, nor PO tracker, schedule tracker, etc.Answer all account queries within 48 hours of receipt, following OMG’s process to ensure complete accuracyPEOPLEAttend training as requested and to share knowledge with the wider teamWork on any ad-hoc requests and requirements from your group, which may include work outside of the immediate team i.e. work across other client teams in the case of a team member’s absence, assist with reporting outside of your team’s core financial reports. Any requests of this nature will be discussed with your line manager and training and instruction providedPARTNERSHIPDevelop an understanding of the Australian media market place and the industry from trade press and other sourcesQualification, Skills, and CompetenciesRequired Skills & AttributesThis is an entry-level position, no prior experience required although, given the heavy bias to financial process, 0-1 year of relevant finance experience, as well as an interest in broader financial accuracy and streamlining processes is welcomedStrong attention to detailKnowledge of Microsoft suite (Excel, Word)Mathematical skills and excellent literacy, both written and verbalInterpersonal and communication skillsOrganizational skillsPrioritizing multiple deadlines with great attention to detailA ‘can do’ attitudeProactivity and problem solvingEnthusiastic and eager to learnWhy you’ll love usThrough our people philosophy, we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they’re more fun to share an office with.Join us and surround yourself with like-minded, high-achieving individuals, and unbeatable career development opportunities.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently-abled, to apply”Our working hours are from 7 am till 4 pm (Monday till Friday)Tagged as:AdministratorTo apply for this job please visitomnicommediagroup.com.np.", "Page_URL": "https://www.merorojgari.com/job/media-administrators/", "websitename": "merorojgari.com"}, {"name": "Frontend Developer", "company": "Omnicom Media Group Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteOmnicom Media Group NepalJOB OPPORTUNITYFrontend DeveloperThis role is responsible for building the ‘client-side’ User Interface of our web applications with better responsiveness and better user experience. You should be able to translate our company and client’s needs into functional and appealing interactive applications.If you’re interested in creating a user-friendly environment by writing code and moving forward in your career, then this job is for you. We expect you to be a tech-savvy professional, who is curious about new digital technologies and aspires to combine usability with visual design.Ultimately, you should be able to create a functional and attractive digital environment for our company, ensuring a great user experience.Key ResponsibilitiesTechnical Expertise (50%)Use mark-up languages like HTML to create user-friendly web pagesMaintain and improve websiteOptimize applications for maximum speedCollaborate with back-end developers and web designers to improve the usabilityGet feedback from, and build solutions for, stakeholdersCreate quality mock-ups and prototypesHelp back-end developers with coding and troubleshootingEnsure high-quality graphic standards and brand consistencyStay up-to-date on emerging technologiesProper use of task management and time logging toolsMust be familiar with VUE JS, Angular JS, and typescriptProduct Quality Assurance (35%)Conduct functional testing and verification before sending to QASelf-Learning (15%)Be updated with new technologies and trendsAny other additional tasks or responsibilities as required by the business.Required Experience & QualificationsProven work experience of 2+ years as a Front-End DeveloperBSc degree in Computer Science or relevant fieldHands-on experience with mark-up languagesExperience with JavaScript, CSS, and jQueryKnowledge of SASS, web accessibilityKnowledge of version control system (Git, SVN)Knowledge of JavaScript framework (React, Vue, Angular)Must be familiar with Vue JS, Angular JSKnowledge of Vue JS and Typescript is highly preferredFamiliarity with browser testing and debuggingIn-depth understanding of the entire web development process (design, development, and deployment)Understanding of layout aestheticsKnowledge of SEO principlesFamiliarity with software like Adobe Suite, Photoshop, and content management systemsAbility to perform well in a fast-paced environmentGood communication, analytical, and multitasking skillsMust have strong Knowledge on integrate API on frontend applications.Why you’ll love usThrough our people philosophy, we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they’re more fun to share an office with. Join us and surround yourself with like-minded, high-achieving individuals and unbeatable career development opportunities. We offer:Great work culture and environmentEmployee growth and developmentExposure to the latest technologies, teams, and toolsWorld-class best practicesTo know more about us, please visit the link athttps://omgnpprd.wpengine.com/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently-abled, to apply”Tagged as:Frontend DeveloperTo apply for this job please visitomnicommediagroup.com.np.", "Page_URL": "https://www.merorojgari.com/job/frontend-developer/", "websitename": "merorojgari.com"}, {"name": "QA Engineers", "company": "Omnicom Media Group Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteOmnicom Media Group NepalJOB OPPORTUNITYQA EngineersQA Engineer is responsible for creating, maintaining, and executing test artifacts against assigned projects. This role requires estimating test efforts, analyze them, and communicating the test results. The role holder needs to report, track bugs, and verify bug fixes and new functionalities. The role holder is required to all sorts of testing as per requirement and research & implement the test automation process in the required assigned projects. The person with the role should be participating in day-to-day QA activates like reviewing the requirements with developers, project managers, and the AU team for consistency and accuracy and establish a test process and methodology. The role holder works in a project or product group to achieve QA team objectives of achieving high-quality delivery.Key ResponsibilitiesTechnical Expertise (50%)Plan, create and manage the overall Quality Planning strategyDesign, develop and execute automation scripts using open source tools (Especially Selenium TestNG)Estimating, prioritizing, planning, and coordinating quality testing activitiesCreating detailed, comprehensive, and well-structured test plans and test casesTest current products and identifying deficienciesIdentify, record, document thoroughly, and track bugsPerform thorough regression testing when bugs are resolvedDevelop and apply testing processes for new and existing products to meet client needsIdentify key KPIs for product qualityPerform API Testing, Load Testing along with report analysisProduct Quality Assurance (25%)Investigate product quality in order to make improvements to achieve better client satisfactionReviewing quality specifications and technical design documents to provide timely and meaningful feedbackIdentify quality assurance process bottleneck and suggest actions for improvementCollect quality data and Oversee continuous improvement projectsInvestigate the causes of non-conforming software and train users to implement solutions Track quality assurance metrics, like defect densities and open defect countsStakeholder Management (10%)Collaborate with the Product Development team to ensure consistent project executionLiaise with internal teams (e.g. developers and product managers) to identify system requirementsTeam Management (5%)Mentor and guide Junior QASelf-Learning (10%)Stay up-to-date with new testing tools and test strategiesAny other additional tasks or responsibilities as required by the business.Required Experience & QualificationsProven experience of more than 2 years as a Quality Assurance Engineer with web-based Content Management Systems, Responsive Design Test and Complex Data AnalysisBS/MS degree in Computer Science, Engineering or a related subjectShould have experience and knowledge using a variety of different testing techniques such as UI Testing, Automated Testing, Test Driven Development StrategiesExperience in software development is a plusSolid Knowledge of Software Development Life Cycle and Software Test Life CycleSolid knowledge of SQL and scriptingExperience in writing clear, concise, and comprehensive test plans and test casesExperience working in an Agile/Scrum development processExperience in API Testing, Load Testing along with report analysisFamiliarity with HTML, CSS, JavaScript, JAVA, XMLHands-on experience with both white box and black box testingGood knowledge and skills of Project management and Bug tracking tools like JiraA sense of ownership and pride in your performance and its impact on the company’s successExcellent in spoken and written EnglishCritical thinker, problem-solving skills, and good time-management skillsWhy you’ll love usThrough our people philosophy, we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they’re more fun to share an office with. Join us and surround yourself with like-minded, high-achieving individuals and unbeatable career development opportunities. We offer:Great work culture and environmentEmployee growth and developmentExposure to the latest technologies, teams, and toolsWorld-class best practicesTo know more about us, please visit the link athttps://omgnpprd.wpengine.com/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently-abled, to apply”Tagged as:QA EngineerTo apply for this job please visitomnicommediagroup.com.np.", "Page_URL": "https://www.merorojgari.com/job/qa-engineers/", "websitename": "merorojgari.com"}, {"name": "Software Engineers (.NET)", "company": "Omnicom Media Group Nepal", "time": "Full Time", "address": "Anywhere", "deadline": "2022/05/23", "desct": "Full TimeAnywherePosted 2 weeks agoLogin to bookmark this JobWebsiteOmnicom Media Group NepalJOB OPPORTUNITYSoftware Engineers (.NET)This role is responsible to build functional applications and websites. The .NET Developer’s responsibilities include participating in the entire software development life cycle, debugging applications, and configuring existing systems. You are equally happy to roll up your sleeves to write code and review other team members’ work.Ultimately, you’ll use your expertise in the .NET framework to help us deploy high-quality applications.Also, this role should also do efficient communication with the Australian team for getting requirements, do necessary task planning with the team for better completion of the application.This role holder is required to invest time in organizing, upskilling, and training junior counterparts.Key ResponsibilitiesTechnical Expertise (60%)Analyze system requirements and prioritize tasksWrite clean, testable code using .NET programming languagesDevelop technical specifications and architectureTest and debug various .NET applicationsReview and refactor codeDeploy fully functional applicationsUpgrade existing programsDocument development and operational proceduresStay up-to-date on emerging technologiesProper use of task management and time logging toolsComply with project plans and company standardsMaintaining and improving existing codebases and peer review code changesInvestigating and using new technologies where relevantEnsure software is updated with the latest featuresProviding written knowledge transfer materialProduct Quality Assurance (20%)Develop verification plans and quality assurance proceduresConduct testing and verification of software before sending to QAPrepare functional document for QA team for further testing.Team Management (15%)Mentor and upskill junior team membersShould be a team leader, assigning tasks to juniors and helping them.Should help manager on task planning and helps and report to the manager on the task assignedStakeholder Management (5%)Provide regular and effective progress updates to and work closely with Development Project Managers to ensure the management of any delivery risks or issues.Any other additional tasks or responsibilities as required by the business.Experience & Qualifications / Critical elements of successProven work experience above 2+ years as a .NET DeveloperBSc/BA in Computer Science, Engineering or a related fieldShould have knowledge in MVCGood working knowledge in any JS frameworks (AngularJS, Vue, Node) will be added benefit.Hands-on experience on SQLFamiliarity with No-SQL database (Mongo, Redis, etc) will be added benefitProficiency in building CMS based web applications, preferably in Kentico and SitecoreIn-depth knowledge of at least one of the .NET languages (like C# and Visual Basic . NET)Familiarity with agile environmentsExcellent communication skills and troubleshooting abilitiesShould have the knowledge to setup the environment (DEV, UAT, production) and should be able to configure CI/CD tools.Should be able to write unit testWhy you’ll love usThrough our people philosophy, we believe that happy people with a great work/life balance are able to bring the #WOW factor to work and they’re more fun to share an office with. Join us and surround yourself with like-minded, high-achieving individuals and unbeatable career development opportunities.To know more about us, please visit the link athttps://omgnpprd.wpengine.com/Our working hours are generally from 7 am till 4 pm, Monday till Friday.“Omnicom Media Group Nepal is an equal opportunity employer. We encourage candidates of diverse background, women and differently-abled, to apply”Tagged as:Software EngineerTo apply for this job please visitomnicommediagroup.com.np.", "Page_URL": "https://www.merorojgari.com/job/software-engineers-net/", "websitename": "merorojgari.com"}, {"name": "Content Writer", "company": "InformatexTech PVT. LTD", "time": "Fresher", "address": "Kathmandu", "deadline": "August 31, 2022", "desct": "FresherFull TimePart TimeKathmanduPosted 2 weeks agoCloses:August 31, 2022Login to bookmark this JobWebsiteInformatexTech PVT. LTDJOB OPPORTUNITYIELTS / TOEFL /PTE appeared candidate will be an added advantage for Selection Process👉Company Nature: Outsourcing( Australian based)👉Office Hours: 7:00 AM to 3:00 PMWorking Days: 6 Days a Week🔷Note: Fresher can apply. Training will be provided.👉Applying Procedure:Send your application letter and CV/Resume to  hr@informatextech.com📍Your CV/Resume should contain all of the academic scores from schooling to your recent qualification.Only shortlisted candidates will be scheduled for an online Interview and further selection processTagged as:Content Writer,Copywriter,Job in KathmanduFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/informatextech-pvt-ltd-kathmandunepal-full-time-part-time-content-writer/", "websitename": "merorojgari.com"}, {"name": "Quality Assurance Engineer", "company": "eXtensoData Pvt. Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "April 30, 2022", "desct": "Full TimeAnywherePosted 2 weeks agoCloses:April 30, 2022Login to bookmark this JobWebsiteeXtensoData Pvt. Ltd.JOB OPPORTUNITYQuality Assurance EngineerJob Category: Research and Development0rganization: eXtensoData Pvt. Ltd.Req Id: TMEJob Type: Full TimeJob Description / RolesThe main goal of QA engineers is to prevent defects. Quality Control specialists, in their turn, analyze the test results and find mistakes. They are responsible for identifying and eliminating defects in a product (or, in other words, these engineers make sure that developers get the results they expect).ResponsibilitiesAnalyze and clarification of requirements with a customer or a business analyst and provide timely and meaningful feedbackDevelop, document and maintain manual/automated test scripts, test cases, defect tracking and reportsPerform thorough regression testing when bugs are resolvedMaintain the test documentationRecommend improvements in software to enhance user experienceCommunicating with Quality Control about existing defects and how to prevent them in future productsRequirement2-3 years of QA experienceKnowledgeSolid knowledge of SQL and scriptingAbility to work under tight time constraints with dynamic requirementsExperience in automation test frameworksBe excited about automation and building tools to help do your job and assist the rest of the teamKnowledge of quality assurance terminology, methods, and toolsKnowledge Project management and Bug tracking tools like JiraKnowledge of Version Control : GitHub, GitLabExperience with performance and/or security testing is a plusHow to ApplyInterested Candidates must apply for the relevant job with cover letter and detailed CV. Applications should be submitted directly tocareer@extensodata.comApplication Deadline: Apr 30, 2022 10:00 PMFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/aextensodata-pvt-ltd-full-time-quality-assurance-engineer/", "websitename": "merorojgari.com"}, {"name": "Technical Marketing Engineer", "company": "eXtensoData Pvt. Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "April 30, 2022", "desct": "Full TimeAnywherePosted 2 weeks agoCloses:April 30, 2022Login to bookmark this JobWebsiteeXtensoData Pvt. Ltd.JOB OPPORTUNITYTechnical Marketing EngineerJob Category: Research and Development0rganization: eXtensoData Pvt. Ltd.Req Id: TMEJob Type: Full TimeJob Description / RolesTechnical marketing engineer contributes their technical knowledge to marketing campaigns and products. He/She collaborate with sales teams to develop marketing materials, provide sales teams and clients with technical product support, and participate in product demonstrations. We are seeking an innovative technical marketing engineer to support our marketing initiatives.ResponsibilitiesCollaborating with the marketing team on product development and campaign strategies.Determining the technical scope of envisaged projects and providing technical input.Anticipating technical product needs and integrating desired functionalities into the design.Developing technical marketing materials and products, monitoring product performance, and resolving errors.Training marketing teams on product specifications and functionalities.Accompanying marketing teams to marketing events, product launches, and client locations.Delivering presentations and performing product demonstrations.Answering client queries and providing technical product support.Documenting processes and compiling user manuals. Presentation file for the marketing team and clients.Contributing to marketing strategies by researching market trends and associated technologiesRequirementBachelor’s degree in Computer Science, Computer Engineering or related technical discipline [MBAIT, MBA].2 years of experience in software engineering or software development experience.Strong interested about Product and digital Marketing Job.Extensive written, verbal communication, collaboration and interpersonal skills.Great negotiation, persuasion and creative problem-solving skills.Experience managing the software development lifecycle.Extensive knowledge of agile methodologies.Strong organizational and team building skills.Key Skills/ Knowledge:Analyzing informationIntermediate level of programming skills in Java, Linux, SQL and Python etc.Software designSoftware debuggingSoftware documentationProblem solvingBenefits of being part of F1Soft Group Family:Excellent career opportunities and growthAttractive SalariesLunch AllowanceFestival AllowanceHealth and Accidental Insurance CoveragePaid Leaves (Casual, Sick, Paternity and Maternity)How to ApplyWe are always keen to meet energetic and talented professionals who would like to join our team. To apply, please mail your updated cv oncareers@f1soft.comalso includeSubject Lineapplying for.Application Deadline: Apr 30, 2022 10:00 PMFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/f1soft-international-pvt-ltd-full-time-technical-marketing-engineer-2/", "websitename": "merorojgari.com"}, {"name": "Java Developer", "company": "eXtensoData Pvt. Ltd.", "time": "Full Time", "address": "Anywhere", "deadline": "April 30, 2022", "desct": "Full TimeAnywherePosted 2 weeks agoCloses:April 30, 2022Login to bookmark this JobWebsiteeXtensoData Pvt. Ltd.JOB OPPORTUNITYJava DeveloperJob Category: Research and Developmen0rganization: eXtensoData Pvt. Ltd.Req Id: ASJJob Type: Full TimeJob Description / RolesWe are looking for a Java developer with experience in building high performing, scalable, enterprise application if you’re hard working and dedicated. Extensodata is an ideal place to get ahead.ResponsibilitiesDesigning user interaction on web pages.Developing front end website architecture.Developing back-end website applications.Creating servers and databases for functionality.Debug and resolving technical issues and ensuring responsiveness of applications.Designing and developing APIsWork as part of a software development team.Continually engage in professional development.Develop document to track.RequirementSolid understanding of object-oriented programming.Skill for writing reusable Java Libraries.Proficient in JavaScript, HTML, CSS and etc.Familiar with various design and architectural patterns.Proficient in MYSQLKnowledge of programming language and technical terminology.Able to develop ideas and processes and clearly express them.Dedicated team Player.Education Requirement:Degree in Computer engineering, computer science or related fields.How to ApplyWe are always keen to meet energetic and talented professionals who would like to join our team. To apply, please mail your updated cv oncareers@f1soft.comalso includeSubject Lineapplying for.Application Deadline: Apr 30, 2022 10:00 PMTagged as:Java DeveloperFull NameEmail AddressPosition Apply ForMessageUpload CVUpload your CV/resume or any other relevant document. Max. file size: 20 MB.", "Page_URL": "https://www.merorojgari.com/job/f1soft-international-pvt-ltd-full-time-java-developer/", "websitename": "merorojgari.com"}]