[{"name": "Senior .Net Developer", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Tinkune Marg, Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "Technical LeadC#JavascriptCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Tinkune Marg, Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Technical LeadC#JavascriptCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetYou get energy from coding and and you are familiar in the Microsoft ecosystem such as Visual Studio, Azure & .NET CoreYou believe in writing clean, scalable code using C# .NETYou can act as a leader of your team and provide them technical assistanceWorking with API's and microservices is a piece of cake for youScalable and manageable solutions are in your DNAYou are familiar with front-end JS frameworks such as Angular, React or VueWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/senior-net-developer", "Page_URL": "https://merojob.com/senior-net-developer-49/"}, {"name": "Java Developer - Benequick", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "$. 600.00 Monthly", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "JavaObject Oriented ProgrammingJavascriptJqueryHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleKathmanduOffered Salary:$. 600.00 MonthlyApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:JavaObject Oriented ProgrammingJavascriptJqueryHtmlOther SpecificationMandatory: Java, Spring, Hibernate, Angularjs, JUnitMust have skills:Good knowledge of JAVA and Object-Oriented ProgrammingGood knowledge of relational databasesExperience with J2EE, HTML, CSS, JavaScript, jQueryProficiency with Unix-like operating systemsExcellent Verbal and Written CommunicationExcellent Logical and Analytical SkillMath AptitudeTime Management and ProfessionalismOther Job Requirements:IT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksAbility to work independentlyBenefits:Health InsuranceProvident FundDashain Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Govt Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesJob DescriptionDuties and Responsibilities include, but are not limited to:Resolves assigned tasks in an efficient and effective manner(Customer or internal)Quality code with minimal bugsPositive code review resultsUnderstands and follows SDS (Smart Data Solutions) workflow and associated technical systemsApplies analytical and business knowledge to solve customer-specified problems adhering to SDS coding standards and policiesAdheres to SDS’s courteous and professional written and verbal communication standardsA consistently high rating on customer satisfaction surveys 5. Works independently with minimal guidanceDevelopmentCompletes development projects as specified by development manager, adhering to SDS coding standard and policiesPrograms appropriate changes as specified by development manager, adhering to SDS coding standard and policiesReviews applicable changes (in particular system related changes) with peer/manager and get approval on programming changes from managerDevelops test cases and data and test all changes and new modulesOther duties as assignedNew ImplementationsCommunicates with client regularly and documents all specifications and workflows. All implementation meetings are followed up with written listing of all tasksUnderstands related workflow and all associated nuancesCompletes all tasks as specified on the implementation checklistCompletes assigned tasks as specified by the development manager and follow the implementation manual/checklistMeets development milestones consistently. Do “what it takes” to achieve customer go live dateCommunicates to client and management if milestone dates are not metLeverages the expertise of other developers in the team on specific modules (Examples: scanner setup, OCR setup, etc.Sets up customer billing rates as specified on the contract and verify with sales or accounting. (Billing)Tracks and bills all applicable development hours. (Billing)Ensures unnecessary direct labor costs are not incurred in conjunction with the implementation.Business AnalysisUnderstands and follows all assigned customers workflow including import and export processAbility to interpret customer business processes, analyze problems and recommend programmable solutionsRisk DesignationThe role is classified as High Risk, due to access to Protected Healthcare Information. Employees in this role must be free of felony convictions on a background check reportApplying Procedure:Interested and qualified candidates are requested to apply with anupdated Resumeat[email protected]with position applied as emailNote :Only shortlisted candidates will be contacted for the programming test and interviewFreshers are discouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationOR,APPLY NOW", "Page_URL": "https://merojob.com/java-developer-benequick/"}, {"name": "SQL / Database Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "salary": "Negotiable", "deadline": "Nov. 15, 2020 23:55\n(4 days, 14 hours from now)", "education": "Bachelor", "skills": "PlsqlSqlDatabase Management", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 15, 2020 23:55\n(4 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 4 yearsProfessional Skill Required:PlsqlSqlDatabase ManagementOther SpecificationQualificationsBachelor’s in computer science / Engineering.At least 4 years of experience working in TSQL/PLSQL.Skills and Expertise:Experience or Knowledge in AWS cloud services: S3, EC2, EMR, RDS, RedshiftExperience or Knowledge in relational SQL, Snowflake and NoSQL databases, including Postgres, working with the Apache Hadoop EcosystemGood working knowledge of python or Java or C#.Experience or Knowledge in Airflow system, and Tableau.Experience with Agile methodologiesGood knowledge of Shell scripting.Design and implement the development and release process including CICD based strategiesStrong knowledge in SQL scripting, procedures, functions and triggersExperience in data loading, analytics, logical and problem solvingSkilled at optimizing large complicated SQL statementsCapable of troubleshooting common database issuesKnowledge in DTS packagesHave experience working in MS Excel macros is a plus.Good interpersonal and communication skillsWillingness to learn new technologies as per requirement of the Project.Job DescriptionResponsibilities:Develop scripts to load different types of file and automate them through Airflow/Pentaho or ETL application.Develop file processing applications using python/java or C#.Develop, implement and optimize stored procedures and functions using T-SQLResearch required dataHandle common database issues and proceduresCollaborate with other team members and stakeholdersPrepare documentations and specificationsApplying ProcedurePlease apply through the below link :https://jobs.smartrecruiters.com/Verisk/743999721536849-senior-software-engineer-sql-developerorhttps://careers.smartrecruiters.com/Verisk?search=nepalAdditional Information:Verisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice", "Page_URL": "https://merojob.com/front-end-ui-develope/"}, {"name": "Front End / UI Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "salary": "Negotiable", "deadline": "Nov. 15, 2020 23:55\n (4 days, 14 hours from now)", "education": "Bachelor", "skills": "AngularUi/Ux", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 15, 2020 23:55\n (4 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:AngularUi/UxOther SpecificationQualificationsBachelor’s in Computer Science, or related field or equivalent experienceAt least 3 years of professional experience in JavaScript / Angular TechnologySkills and KnowledgePassion for programming in general, rather than a specific languageBe focused, passionate, and strive to find simple solutions to complex problemsAbility to learn new, emerging technologiesYou have a solid general understanding of application components, what happens on the front end, what happens on the back end.You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the aboveAbility to effectively work on multiple projects simultaneously and effectively contend with competing prioritiesPossess strong troubleshooting, code optimization and refactoring skillsHave strong sense of ownership with demonstrated ability to work independently without supervisionTechnical Expertise:JavaScript frameworks (Angular 4+ - preferably the latest verison, AngularJS, React, jQuery), RxJs, Redux, Web markup languages (HTML/HTML5, XML) and Style sheet language (CSS/CSS3), SASS, LESSWell versed in using UX and UI design tools like Adobe Photoshop, Adobe Illustrator, Adobe InDesign and Adobe XDExperience in working with using html frameworks like Bootstrap and FoundationWriting tested and documented JavaScript withExpertise in build processes (Angular CLI, Webpack)Experienced in writing test cases and performing unit testing using frameworks (ex. Jasmine, Karma)Used DevOps and CI/CD in previous work experienceDeveloped software in SCRUM environment using Agile methodologies and involved in SDLC processJob DescriptionResponsibilitiesMake design and technical decisions for Angular projectsPerform unit testing by using different frameworks like Jasmine, KarmaBe involved in all phases of the agile software development lifecycleProactively seek out and minimize pain points within the infrastructure and code baseKeep up to date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesCommunicate proactively with Business stakeholders and provide design suggestionsAnalyze, debug and fix defectsApplying ProcedurePlease apply through the below link :https://jobs.smartrecruiters.com/Verisk/743999721662476-software-engineer-front-end-developerorhttps://careers.smartrecruiters.com/Verisk?search=nepalAdditional Information:Verisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice", "Page_URL": "https://merojob.com/front-end-ui-developer-2/"}, {"name": "QA Automation Engineer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Lalitpur", "salary": "Negotiable", "deadline": "Nov. 15, 2020 23:55\n(4 days, 14 hours from now)", "education": "Bachelor", "skills": "ProgrammingAutomationTestingQa", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 15, 2020 23:55\n(4 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:ProgrammingAutomationTestingQaOther SpecificationQualificationsBachelor’s in Computer Science, or related field or equivalent experience1 to 3 years of professional experience in Software Quality Assurance and Test AutomationSkills and KnowledgePassion to work and grow as a Software QA EngineerAbility to analyze acceptance criteria and discuss scenarios with team with a goal of identifying possible issues upfront even before the feature is developedAbility to build automated test scripts, plan tests and strategies according to the projectThorough and disciplined, ability to analyze a problem and weight severity of the issueDedicated worker skilled at collaborating in a team settingProven excellent problem-solving and analytic skillsDemonstrated excellent communication skillsFamiliarity with Agile workflow as well as Atlassian Jira and ConfluenceTechnical Expertise:Strong understanding of object-oriented programmingGood knowledge of a programming/scripting language – JAVA, C# .Net, Scripting, PythonKnack for writing clean, readable, and easily maintainable QA automation workflowsExperience in testing web services such as RESTful APIExperience in performance testing using tools such as Apache JMeterExperience of testing Search clusters like Solr, Lucene and Elastic SearchProficient in SQL and relational database concepts, experience or knowledge of NoSQL DB preferably MongoDBTechnically familiar with development concepts and formats such as SQL, XML, JSON and scripting languages with experience in testing non-GUI applicationsProficient understanding of code versioning tool and familiarity with Continuous Integration atmosphereKnowledge of AWS services would be a strong plus point.Job DescriptionResponsibilitiesAct as QA lead on a wide variety of projectsLead analysis for the purposes of developing test cases and test data for search intense back-end data applications in such a way that defects are uncovered as early as possibleClearly define test plans, scenarios, scripts, and proceduresPerform hands-on manual testing while scripting automated tests to ensure application functionality, performance and securityContinuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation Suites.Serve as a liaison to business analyst and product owner, providing feedback on application readiness for migrations.Be involved in all phases of the agile software development lifecycleApplying ProcedurePlease apply through the below link :https://careers.smartrecruiters.com/Verisk?search=nepalorhttps://jobs.smartrecruiters.com/Verisk/743999721769464-qa-automation-engineerAdditional Information:Verisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice", "Page_URL": "https://merojob.com/qa-automation-engineer-7/"}, {"name": "Java Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "4", "time": "Full Time", "address": "lalitpur", "salary": "Negotiable", "deadline": "Nov. 14, 2020 11:00\n(3 days, 1 hour from now)", "education": "Bachelor", "skills": "JavaAws", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[4]Employment Type:Full TimeJob Location:lalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 14, 2020 11:00\n(3 days, 1 hour from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavaAwsOther SpecificationQualificationsBachelor’s in Computer Science, or related field or equivalent experience2 to 3 years of professional experience in Java based application developmentSkills and KnowledgeHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsExcellent understanding of OOP design concepts and software development processes and methodsAbility to learn new, emerging technologiesYou have a solid general understanding of application components and search engines – what happens on the front end, what happens on the back end.You’re a professional. That means you follow through on commitments, meet deadlines, don’t cut corners, consider other people’s ideas, play nice with the team, learn from your mistakes, document things and communicate honestly and proactively if you anticipate an issue doing any of the aboveAbility to effectively work on multiple projects simultaneously and effectively contend with competing prioritiesPossess strong troubleshooting, code optimization and refactoring skillsTechnical Expertise:Strong in JAVA programming and JAVA based technologies – JAVA 8+ features, J2EE Framework, Spring FrameworkExperience working in heavily multithreaded applicationExperience or knowledge of Search Engines like Solr, Lucene and Elastic SearchExperience in microservices architecture and RESTful API developmentKnowledge of SQL and NoSQL databases (preferably MongoDB, MSSQL and/or Postgres),Knowledge of queuing and messaging technologies like RabbitMQ, SNS and SQSProficient experience working with Maven, Jenkins, Bamboo, Octopus or any CI/CD tool and deep understanding of continuous integration/continuous delivery. Willing and able to work with DevOps team and contribute to CI/CDKnowledge of AWS services like EC2, S3, Lambda, API Gateway, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus pointJob DescriptionResponsibilitiesDesign, implement and maintain JAVA applicationTake part in software and architectural development activitiesBe involved in all phases of the agile software development lifecycleEngage in technical grooming discussions where you should be able to learn as well as contributeWrite well designed, testable, efficient codeProactively seek out and minimize pain points within the infrastructure and code baseKeep up to date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesEnsure designs follow specificationsPrepare and produce releases of software componentsRecommend changes to improve established java application processesApplying ProcedurePlease apply through the below link :https://careers.smartrecruiters.com/Verisk?search=nepalorhttps://jobs.smartrecruiters.com/Verisk/743999721765581-software-engineer-java-developerAdditional Information:Verisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.Consumer Privacy Notice", "Page_URL": "https://merojob.com/java-developer-119/"}, {"name": "Senior System Engineer", "company": "Verisk Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Lalitpur , Nepal", "salary": "Negotiable", "deadline": "Nov. 19, 2020 23:55\n (1 week, 1 day from now)", "education": "Bachelor", "skills": "Ldap/Ad As Well As Linux Shell/Pyt…LinuxUnixDns", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Lalitpur , NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 19, 2020 23:55\n (1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 4 yearsProfessional Skill Required:Ldap/Ad As Well As Linux Shell/Pyt…LinuxUnixDnsOther Specification4+ years of technical hands on experience, supporting and administering application and systemsPositive, energetic, and self-driven attitude to continually develop technical skills and troubleshoot issuesStrong communication skills - both verbal and writtenExperience in administering Windows/Linux systems, user management and application supportExperience with Linux, Unix, DNS, LDAP/AD as well as Linux shell/Python/PowerShell scripting is a plusFamiliarity with Microsoft SCCM is a plusGood knowledge of Networking (CCNA/CCNP or equivalent work experience)Expert in LAN and WAN management and troubleshooting, supporting multiple remote locationsKnowledge of SD-WAN, SD-BranchFamiliarity with Amazon Web Services a plusFamiliarity in DevOps tools (Chef/Ansible) is a plusJob DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce.  Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.We are looking for a talented and passionate System Engineer on our technology team. We are seeking a high-energy, motivated individual with strong technical, problem-solving, and communication skills to join our engineering team.  The team is responsible for supporting, maintaining production systems and applications.  The candidate will be working in a dynamic, fast paced agile environment whose responsibilities include:Providing technical supportTroubleshoot issues (Network and System)Analyze, install, monitor, and support of application and/or Operating SystemMaintain a high performing network infrastructure through routine monitoring, maintenance and troubleshootingCoordinates with service providers and vendors to ensure reliable serviceSupport and troubleshoot WAN/LAN circuits and servicesManage a variety of support requests to completion to support the needs of our users and clientsAdopting and working on new technologyApplying Procedure :Please apply through the below link :https://smrtr.io/4w8TtOR,APPLY NOW", "Page_URL": "https://merojob.com/senior-system-engineer-12/"}, {"name": "Javascript Developer", "company": "Gurzu Inc", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "Css3JavascriptHtmlNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Css3JavascriptHtmlNode.JsOther SpecificationAt least 2 years’ hands-on front-end development work experienceStrong knowledge of at least one of the modern UI frameworks such as React or VueExcellent knowledge of HTML, CSS;Excellent knowledge of JavaScript and ES8;Experience in Restful services and Node JS and AMQPHands-on experience with build tools like Web-pack;Experience with agile methodologies (SCRUM framework) and Continuous Integration practicesExperience with reactive and functional programmingExperience in developing user-eccentric applicationsProven experience in leading and managing the delivery of projects, in addition any experience leading developers would be highly desirableBachelor's degree in Computer Science, Engineering, similar relevant fieldJob DescriptionArchitect, build and maintain a modern web application based on Node JS;Work closely with product designers in order to deliver great user experiences;Ownership of the whole development and deployment cycle;Collaborate with your team, participate in reviews and pairing sessions in order to ensure high level of code qualityUI/UX implementation using state of the art technologies including HTML 5, CSS 3, React, and further frameworksConception, implementation, and improvement of front-end applicationsExpertise in creating RESTful APIs and Web ServicesUnderstanding the nature of asynchronous programmingExperience in Mongo DB and SQL DBExcellent verbal and written communication skillsTeam spirit with an enthusiastic attitudeAPPLY NOW", "Page_URL": "https://merojob.com/javascript-developer-30/"}, {"name": "RoR developer", "company": "Gurzu Inc", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "Html5JavascriptPostgresqlDatabase Management", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Html5JavascriptPostgresqlDatabase ManagementOther SpecificationAt least three years of demonstrable working experienceProficient on Ruby on RailsMust have a philosophical understanding of software development, deployment and maintenanceMust know the software development best practices, coding conventions and design patterns.Must be able to design/develop RESTful web APIsMust understand the concept, philosophy and importance of TDDProficient understanding of databases including Mongodb, MySQL. Postgresql etcVery good understanding of Git and Linux operating systemJob DescriptionHas a basic understanding of development best practices and comfortable writing codeUses and understands tools needed to debug and diagnose issues in a test and/or simple production environmentUnderstands the scope of medium featuresHas a basic understanding of all their product componentsPerforms standard programming tasksContributes to functional specifications and participates in code reviewsWrites and executes test plansAPPLY NOW", "Page_URL": "https://merojob.com/ror-developer-2/"}, {"name": "Mobile Developer", "company": "Gurzu Inc", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "TechnicalCommunicationProgramming Language", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TechnicalCommunicationProgramming LanguageOther SpecificationMinimum 2 years working as a full-time professional mobile developer with at least 1-year experience in React NativeAt least 3 demonstrable apps made in React-Native or Native(Java/Kotlin/Swift/Objective C) available in stores or gitExcellent communication skills, both verbal and writtenWilling to learn and work on different mobile platforms/frameworks when neededBachelor’s Degree in related technical fieldJob DescriptionWork with in a team to understand, collaborate and deliver the business goalsDevelop, build and deploy advanced applications for the iOS & Android platforms in React NativeDevelop clean, elegant and reusable code that is easy to maintain and extendLeverage native APIs for deep integrations with both iOS and Android platformsDevelop automated tests to ensure high quality of productsImplement third party library and API to the applicationBuilt pixel perfect and smooth UIs across multiple mobile platformsDetect and fix bugs and performance bottlenecksCollaborate with team to deliver an innovative solutionWork with team to understand existing applications and design new features to itKeeping yourself updated on current trends and technologies in this industryAPPLY NOW", "Page_URL": "https://merojob.com/mobile-developer-7/"}, {"name": "Product Designer", "company": "Gurzu Inc", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalCommunicationCreative Thinking", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Problem SolvingAnalyticalCommunicationCreative ThinkingOther SpecificationPrevious working experience as a Product Designer for minimum of 2 year(s)Strong knowledge of the industry and market trendsKnowledge of user centric design processes and methodsSharp analytical and problem-solving skillsExcellent attention to detailA well-rounded portfolio of client work, demonstrating a strong understanding of client objectivesCreativity in mixing up colors, shapes and techniquesOutstanding communication, presentation and leadership skillsFamiliarity with prototyping tools including InVision Studio, Sketch, XD and FigmaJob DescriptionTake part in user experience researchCreate prototypes, wireframes, sketches, journey maps, and other digital tools to test and improve product experiences in collaboration with internal and external customersUse research to challenge and validate design decisions in an ongoing development process that strives to make the customer experience betterDefine the right interaction model and evaluate its successFind creative ways to solve UX problems (e.g. usability, findability)Communicate design ideas and prototypes to developersAPPLY NOW", "Page_URL": "https://merojob.com/product-desinger/"}, {"name": "Machine Learning Engineer - Part Time", "company": "Chulo Solutions", "level": "Mid Level", "vacancy": "1", "time": "Part Time", "address": "Online", "salary": "NRs. 30,000.00 - 45,000.00 Monthly", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "Sequence ModelingNlpMachine LearningPythonCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Part TimeJob Location:OnlineOffered Salary:NRs. 30,000.00 - 45,000.00 MonthlyApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Sequence ModelingNlpMachine LearningPythonCommunicationJob DescriptionWe are looking for:An expert in machine learning to help us to design and build an online e-learning program.A person who can work part-time for about 15 - 20 hours a week. (It is remote work. Working hours can be decided according to your circumstances.)Required skills:Advanced degree in computer science, math, statistics or a related disciplineExtensive data modeling and data architecture skillsProgramming experience in PythonExperience in machine learning frameworks in python such as TensorFlow or KerasStrong knowledge about machine learning and deep learning algorithms such as k-Nearest, NLP and sequence modeling, along with CNNStrong written and verbal communications in EnglishCore responsibilities:Create, check, and modify online courses about machine learningCommunicate with the foreign team for any improvement in our online programsResearch, Design and Frame Machine Learning SystemsUnderstand and Transform the Prototypes of Data ScienceVerifying data quality, and/or ensuring it via data cleaningPerform Machine Learning Model Tests and ExperimentsDevelop the Machine Learning Model as per the NeedSelect and Implement Right Machine Learning AlgorithmsUnderstand Business Objectives and Developing the ML ModelsCompany benefits:Friendly, creative working environment with a foreign teamWorking with the latest technologiesTimely salary reviewRemote working policyApplying Procedure:If you believe you are the one and have a passion to work with us,APPLY NOWwithYour recent resume in PDF formatYour desired weekly working hours and monthly salaryat[email protected].We are looking forward to receiving your application!OR,APPLY NOW", "Page_URL": "https://merojob.com/part-time-machine-learning-engineer-2/"}, {"name": "Sr. React Developer", "company": "Deerhold Nepal", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 22, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "Time ManagementCssHtmlCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 22, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Time ManagementCssHtmlCommunicationInterpersonalOther SpecificationBachelor’s degree in Computer Science, Information Technology, or a similar fieldPrevious experience working as a React.js DeveloperIn-depth knowledge of JavaScript,the DOM, CSS, HTML and front-end languagesKnowledge of REACT tools including React.js, hooks, ReduxExperience with user interface designKnowledge of performance testing frameworks including JestExperience with browser-based debugging and performance testing softwareExcellent troubleshooting skillsFamiliarity with RESTful APIsExperience using GitExcellent communication skills, both written and verbalExperience in cloud platforms such as AWSExperience working on content modeling is a plus pointIn-depth experience working on custom CMS integration and developmentAble to work well on a remote, multi-national team with Agile and ScrumJob DescriptionAs a React Engineer, you are a self-motivated, life long learner with a passion for design and engineering. You love great UX. You like to keep up with the latest trends in the frontend and design world to ensure we are always using the best techniques possible. You are familiar with Agile Scrum. Beyond coding, you enjoy working in an evolving industry.Write codes in React/JavascriptCollaborate closely with the development team to design and launch new featuresTest and troubleshoot the systemUtilize test-driven development practices for the codes generatedSuggest and improve the functionality of the existing systemUtilize best practices with the technologies to ensure effective and efficient processing of tasksApplying Procedure:Interested and eligible candidates are requested to submit their updated resume to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/sr-react-developer-2/"}, {"name": "Backend Developer (Python)", "company": "Tekvortex", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Harihar Bhawan, Pulchowk", "salary": "Negotiable", "deadline": "Nov. 14, 2020 23:55\n(3 days, 14 hours from now)", "education": "Bachelor", "skills": "PythonBackendData AnalyticsBig Data", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Harihar Bhawan, PulchowkOffered Salary:NegotiableApply Before(Deadline):Nov. 14, 2020 23:55\n(3 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:PythonBackendData AnalyticsBig DataJob DescriptionThese are professional openings requiring a minimum of 2 years of experience in the software industry. Currently, we are seeking skilled and passionate development all-rounders to be key players in our dynamic team involved in the research and development of leading enterprise products and services globally.The ideal candidate will have extensive development experience working on enterprise grade SAAS applications. You will have the opportunity to work in a fast-paced environment. You should be ready and excited to learn and implement new technologies.ResponsibilitiesAnalyze product requirements and design/implement solutions to meet the sameMaintain, troubleshoot and enhance large scale enterprise applicationsEvaluate application performance and determine any applicable improvementsParticipate in the evolution of our technologies and practices, occasionally pitch new technologies that you believe in, and participate in workshops to learn new skillsUtilize various open source technologiesUse various tools to orchestrate solutionsBuild independent scripts, web-based tools, micro-services and solutionsWrite scripts and automation using Perl/Python/Bash etc.Configure and manage data sources/solutions like PostgreSQL, Redis, Hadoop, Athena etc.Desired Skills/CharacteristicsBachelor’s\nDegree or MS in Engineering or equivalentFluency in\nprogramming in core Python on Linux using OOP concepts with focus on data\nanalytics (Pandas, NumPy) and visualization (Bokeh, Matplotlib, Plotly)Experience\nwith big data solutions, Hadoop and machine learning is highly desirableExperience\nworking with web services using REST APIsAdequate\nknowledge of relational and NoSQL database systemsWorking\nknowledge of R and Cloud Services (AWS preferred)Strong\nattention to detail while implementing technical specificationsAbility to\nwork effectively with largecode baseusing version control toolsAbility to\nwork and thrive in a fast-paced environment, learn rapidly and master\ndiverse technologies and techniquesCritical\nthinker, strong analytical, problem-solving and time-management skillsExcellent\nverbal and written English communication skillsWillingness\nto work in flexible hours overlapping with US office hours, if neededGood\nattitude and strong work ethics*Remuneration and benefits will be based on experience and will not be a constraint for deserving candidates.Applying Procedure:Candidates can also send their resume directly to[email protected].\nPlease mention the vacancy you are applying for in the subject of the cover\nletter.OR,APPLY NOW", "Page_URL": "https://merojob.com/backend-developer-python-5/"}, {"name": "QA Engineer", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Tinkune Marg, Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "ProactiveCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Tinkune Marg, Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:ProactiveCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetProactiveness on understanding the product and its flowCome up with new and creative ways to test our productPerform software quality assurance using various types of manual and automated testingOf course you know about Performance, Security & Integration TestingYes you work with the scrum team to deliver well-tested software in each sprintYou make suggestions, ask questions and is able to push the limits of the rest of the teamWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/qa-engineer", "Page_URL": "https://merojob.com/qa-engineer-40/"}, {"name": "UI/UX Designer", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Tinkune Marg, Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "Visual CommunicationWeb DesignCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Tinkune Marg, Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Visual CommunicationWeb DesignCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetBuild high-quality mockups and design using Adobe Suite, Sketch etcFollow best practices in responsive design, style standards on fonts, colors and imagesWrite optimized, industry-standard, cross-browser compatible HTML/CSSDeliver strong design based on business requirements, brand, strategy and user empathyWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/ui-ux-designer", "Page_URL": "https://merojob.com/uiux-designer-55/"}, {"name": "Trainee", "company": "Verisk Nepal", "level": "Entry Level", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)", "education": "Bachelor", "skills": "Database ManagementProblem SolvingOrganizationalCommunicationJavascriptInterpersonal", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Entry LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:LalitpurOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Database ManagementProblem SolvingOrganizationalCommunicationJavascriptInterpersonalJob DescriptionRequirement:Good knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Problem solving skillsGood knowledge curve - Ability to learn quickly and implementGood attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skillsQualificationsBachelors in Computer Science / Information Technology or equivalentUp to 1 year of working experience in development are also encouraged to applyApplying ProcedureInterested candidates can apply -https://smrtr.io/4v42X", "Page_URL": "https://merojob.com/software-engineer-trainee-net/"}, {"name": "Vendor Data Analyst", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)", "education": "Bachelor", "skills": "DatabaseSqlCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:DatabaseSqlCommunicationInterpersonalJob DescriptionHe/she should have:Impeccable written and verbal communication skill (English).Someone who loves to communicate with onshore and offshore teamKeenness to learn software tools, able to identify issues with data and work on resolutions.Good Analytical thinkingWell versed in ExcelWho is technology savvy, keeps himself/herself updated on latest technology etc.US Healthcare, database and SQL knowledge will be an added advantageApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/vendor-management-associate-2/"}, {"name": "DevOps Solution Architect", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Tinkune Marg, Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 19, 2020 23:55\n(1 week, 1 day from now)", "education": "Bachelor", "skills": "Devops ToolsCloudCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Tinkune Marg, Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 19, 2020 23:55\n(1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Devops ToolsCloudCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetAbility to evaluate cloud application requirements and make architectural recommendations for implementation, deployment, and provisioning applicationsStrong background integrating CI/CD platformsExperience with infrastructure tools such as Terraform, CloudFormation, or AnsibleProviding supervision and guidance to development teamsExperience with IT architecture, infrastructure, and cloud developmentWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/devops-solution-architect", "Page_URL": "https://merojob.com/devops-solution-architect/"}, {"name": "WordPress Developer (Support Specialist)", "company": "ThemeGrill", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Basundhara, Kathmandu, Nepal", "salary": "NRs. 30,000.00 - 60,000.00 Monthly", "deadline": "Nov. 20, 2020 23:55\n(1 week, 2 days from now)", "education": "Bachelor", "skills": "PhpProblem SolvingCssHtmlLogical ThinkingWordpress", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Basundhara, Kathmandu, NepalOffered Salary:NRs. 30,000.00 - 60,000.00 MonthlyApply Before(Deadline):Nov. 20, 2020 23:55\n(1 week, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:PhpProblem SolvingCssHtmlLogical ThinkingWordpressOther SpecificationKnowledge of WordPress, Themes, Plugin is a mustBasic understanding of HTML/CSS/JS and PHP is mustExcellent command of written English and GrammarExcellent problem-solving skillsLanguage Fluency is mustThe capacity to work well within a teamLogical thinking and attention to detailInterpersonal skills as you will regularly be in contact with colleagues and/or customersThe ability toprioritizeyour workloadThe capacity to clearly explain a technical problem to a customer/colleagueOutstanding listening and questioning skillsSupport background in WordPress related product and related services will be an added advantageNote:Junior and Mid Level are also encouraged to apply. If your cv is interesting we will give you a callJob DescriptionRespond to support questions about ThemeGrill themes, plugins and productsProvide general and technical support to users via Email, Chat, Support Tickets, and ForumsGather feedback from customers and prepare the necessary documentsCollaborate with the developer's members to resolve issues and achieve better resultsTesting and evaluating new technologyOther related duties as assignedCompany Benefits:5 working days a weekTimely salary reviewBonus for the dedicated employeesTimely refreshment and outing programsA Serene workplace with a friendly environmentWe have inhouse Badminton court, Table Tennis, Carrom Board, DartBoard, and Chess to play and enjoy the break timeWe provide Lunch, snacks, Tea and CoffeesNote:Due to the current COVID 19 pandemic, this is currently a ‘Work From Home’ job. Interviews and all will also be done virtually. Once this situation is under control, this will be an office jobApplying ProcedureInterested candidates can apply with CV and Cover Letter viahttps://themegrill.com/apply-now/", "Page_URL": "https://merojob.com/wordpress-developer-technical-support-3/"}, {"name": "Dot Net Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)", "education": "Bachelor", "skills": "Asp.NetAws ServicesCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Asp.NetAws ServicesCommunicationOther SpecificationHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsExperience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Knowledge of cloud-based applications would be a strong plus pointExperience working with large-scale production systems and/or data platformsExperience leading a development effort, including mentoring younger developersExperience interfacing with external groups, product managers, partners, customersBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal)Skills and Qualifications:BS/MS degree in Computer Science, Engineering or a related subjectAt least 1 years full-time work experience with good knowledge of AWS environmentStrong ability to build RESTful services in C# with .NET/.NET Core and Python (nice to have)Net Frameworks 4.5+ and .Net Core 2.0+SQL and NoSQL databases (preferably PostgreSQL and/or DynamoDB), ElasticsearchProficient in SQL and relational database conceptsExperience or Knowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus pointPreferably certified in AWS skillsJob DescriptionVerisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world.In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorshipApplying ProcedureVerisk Analytics is an equal opportunity employerAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.Please apply through the below link :https://smrtr.io/4q7Kforhttps://careers.smartrecruiters.com/Verisk?search=nepalUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.", "Page_URL": "https://merojob.com/dot-net-developer-53/"}, {"name": "Intern/Junior .Net Developer", "company": "GRS Solution", "level": "Entry Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu/Remote", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "C#.NetMvcJavascriptJquery", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Entry LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kathmandu/RemoteOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:C#.NetMvcJavascriptJqueryOther SpecificationEngineering Graduate in Computer Science, BIT, BScIT, CSCIT or related degree from recognized universityProven experience in Commercial Software Development, a solid technical background with .NET, MVC, C#, JavaScript, jQuery, Ajax and SQL ServerJob DescriptionUnderstanding the customer need and application, analyze testing and validation result as well as reporting these metrics in a meaningful wayCollaborating and working closely with the rest of the team, seeking advice and learning from senior developers, being curious and eager to learn as you goProactively communicating during meetings, raising issues when appropriate and thoroughly documenting the approach taken along with results at every step of the projectHighly motivated and interested in staying up to date with the latest technology in the field, sharing learning and best practices with the rest of the teamUnderstanding of Agile methodologiesThe candidate is responsible for writing a maintainable codes to a high standard and work directly under the guidance and supervision of Senior DeveloperResponsible for RDC support to the clientsCompensation PlanAttractive SalaryFestival BonusSSF DeductionsFlexible Timing5 work daysCareer enhancement opportunitiesPerformance Bonus for out-performerApplying Procedure:Interested and qualified candidates can drop an application with updated resume along with testimonials and references at[email protected]within7 daysfrom the date of its announcement.Only shortlisted candidate shall be contacted for interview.Note:An eligible candidate shall be designated with Intern to Junior or remote/freelancer developer as applicable on the basis of experience and merits. An annual compensation plan is subject to negotiation. Applicants applied before can't reapply again.OR,APPLY NOW", "Page_URL": "https://merojob.com/internjunior-net-developer/"}, {"name": "Senior PHP Developer (m/f/x)", "company": "ITONICS Nepal", "level": "Senior Level", "vacancy": "10", "time": "Full Time", "address": "Kathmandu, Central Development Region, Nepal", "salary": "Negotiable", "deadline": "Nov. 21, 2020 23:55\n(1 week, 3 days from now)", "education": "Bachelor", "skills": "TeamworkCritical ThinkingPhpCreative Thinking", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[10]Employment Type:Full TimeJob Location:Kathmandu, Central Development Region, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 21, 2020 23:55\n(1 week, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TeamworkCritical ThinkingPhpCreative ThinkingOther SpecificationProactiveness and enthusiastic natureCreativity and InnovativenessExcellent teamworkSelf-motivated, positive attitude and strong zeal towards learningBE in Computer Science, BE in IT,B.Sc. CSIT, BIM, BIT, BCAJob DescriptionAre you eager to cut through the noise and bureaucracy of corporate software development?  Or just wanting to make a name for yourself in a dynamic team environment? Or perhaps looking for a reason to sharpen all of your skills? Anyone interested in cutting edge web and service-based development is welcome. ITONICS is looking for an enthusiastic Senior Php Developer to join our team.ITONICS is offeringA position with an established leader of innovation and strategic management enterprise software/solutions. Sounds boring so far. We are not focusing on millions of customers loving our location-based dating app. We make market-leading companies in all industries even stronger by boosting their innovation and strategic functions. This requires lots of solid development work and even more magic. If you are the type of person having fun within extreme complexity and building in some magic in your code - let’s talk! At ITONICS you’ll be part of industrial dawn of innovation through insight and collaboration. Building large scale solutions to answer both demanding high level and concrete questions about the future. Welcoming experienced developers with various levels of savviness and focuses, ITONICS has a place for anyone that is devoted to technology and forward-thinking. The ITONICS team is looking for eager and self-motivated individuals to drive solutions into the future.Please ONLY apply if you are available to undertake the position within Kathmandu, Nepal. Grab the chance to work in one of the most exciting and innovative areas in the industry in one of the most exciting cities on the globe - NOW! Please send us your resume (cover letter, CV) to us at[email protected]and state your availability.We need qualified PHP developers with at least four years of experience building and customizing large-scale Drupal sites. The PHP Developer will be responsible for software development for the web-based project. This position requires a strong knowledge of PHP development, as well as working knowledge of HTML, CSS, and JavaScript. We're not looking for the world's top experts in these technologies. We'd rather have someone on our team who can admit they don't know the answer to every problem but is confident in his or her ability to find an answer in a short amount of time. From all of our team members, we expect the following:Personal initiative - you are expected to be proactive, ask good questions, and identify solutionsStrong technical knowledge - previous experiences from which you can draw ideas, and a dedication to continued education and self-improvementDetail-oriented - ensure specifications are accurately translated into deliverables, and test work thoroughlyStrong troubleshooting skills - a curiosity to find the right answer, and research until a good solution is foundDedication to excellence - you take pride in the quality of your workAbove all, we need smart developers who have high standards for themselves, want to learn, and are dedicated to delivering the best possible solutions for clients. Candidates must be comfortable working in teams comprised of consulting, client, and third-party resources, have good communication skills, and a positive, can-do attitudeJob responsibilities:Software development from the initial specification, through to developing, testing and launchingWork collaboratively with other internal and external developers in a multi-dev environmentModify existing functionality of PHP-based codeTest, maintain and troubleshoot existing company web-based applicationsManage and improve site performance (speed, user experience, security)Required Qualification:Minimum 2-years experience of web development (PHP, Javascript, (X)HTML, AJAX, CSS, etc.)Good knowledge of relational databases, version control tools and of developing web services, Familiarity with tools such as Git, SVNComfortable working with debugging tools like Firebug, Chrome inspector, etc. Basically Strong troubleshooting skillsAbility to understand CSS/Javascript changes to have consistent style/impact across platforms and browsersAbility to communicate and work well with others, especially with remote team members through virtual channels such as Slack, email and project management tools. Basically, Good verbal and written communication skillsWell-rounded knowledge of web-based technologiesComfortable working in a collaborative environment with team members and clientsExperience with writing clean and well-documented codeFamiliarity with any CMS, e.g. Drupal (preferred), Wordpress, JoomlaIf you show a strong interest and are familiar with some of our technologies, let’s talk!Company Benefits:A friendly, competitive, and creative working environment with foreign managersCompetitive salary (Greater than the market for deserving candidates)5 working days in a week(10 am-6:30 pm)Powerful Laptops that you can also carry homeFree Lunch from a top-class restaurantPaid Leave, sick leave, vacation Leave, work from home facility available, Mourning Leave, Paternity Leave, Maternity Leave, and Social Security Fund.Refreshment, Recreational, team building activities (Comparatively higher than other company)Extra activity: Cricket, Futsal every week, Table Soccer and Table tennis board is at the officeNote:Salary Provided Based on Experience. No bar for Deserving CandidateCandidates who have previously applied for a job at ITONICS but were not shortlisted for interviews are also encouraged to applyCome on board! Our Kathmandu office is based in a town in a new and modern office building providing a world-class working environment and offer you a handsome salaryApplying Procedure:Please send us your resume(cover letter, CV)to us at[email protected]and state your availability.OR,APPLY NOW", "Page_URL": "https://merojob.com/senior-php-developer-mfx/"}, {"name": "Python Developers", "company": "Numeric Mind Pvt Ltd", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Remote/office in Nepal", "salary": "Negotiable", "deadline": "Nov. 23, 2020 23:55\n(1 week, 5 days from now)", "education": "Bachelor", "skills": "PostgresPythonMssqlBootstrapMvc", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Desktop Support, Programmer/ Software Engineer, Software Architect, Team Leader (Software)Job Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Remote/office in NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 23, 2020 23:55\n(1 week, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:PostgresPythonMssqlBootstrapMvcOther SpecificationExpert in core python, and OOPStrong experience in numpy, pandas desiredAt least 3 months on-job experience as a trainee or an employee; Over 1 year experience preferredEducation: BS in Computer Science or equivalent degreeJob DescriptionAbout Nimble Clinical Research: Nimble Clinical Research is a US based technology company dedicated towards creating innovative software applications for pharmaceutical and biotech companies. We are building our local Nepal team via our partner company, Numeric Mind Pvt Ltd (numericmind.com) in Nepal and looking for the best python developers. Visit Nimble Clinical Research, LLC (nimble-cr.com) to know about our current software applications.About Numeric Mind:Numeric Mind is a statistical service company that provides insightful statistical solutions and data analytical services to enterprises and research firms seeking to make informed business decisions. We offer statistical services using advanced statistical programming tools and techniques to clients ranging from healthcare, biotech, and pharmaceutical companies to financial and telecom sectors. Our statistical expertise tackles a wide variety of problems. In addition to statistical services, Numeric Mind also offers short courses, training, and seminars.Role and ResponsibilitiesAs a Python developer you’ll design and develop highly complex modules in our data analytics platform.The ideal candidate is a self-starter, independent and passionate developer with a strong desire to create high quality applicationsYou are expected to continually learn and apply best software development practices and technologies to the tasks at handUse core python, data analysis related packages (such as numpy, pandas, matplotlib, SciPy) and QT (to design user interface elements)Compensation: Attractive salary, higher than market rate, along with increments every 6 monthsReferral: Do you know someone else who is great python programmer?  Earn NRP 20,000 by referring a candidate. Refer them to us! On successful hiring of the candidate, lasting at least a month of employment, you will get NRP 20,000 as referral reward.Applying ProcedureInterested candidates are requested to send you resume directly to[email protected]cr.com.In the resume include your git repository link andLinkedInprofile link if available", "Page_URL": "https://merojob.com/python-developers-5/"}, {"name": "Senior Developer Node.js / Vue.js", "company": "Outsource Array", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "ScrumVue.JsSoftware DevelopmentNode.JsDatabase Management", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software Engineer, Software Architect, Software ImplementationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:ScrumVue.JsSoftware DevelopmentNode.JsDatabase ManagementJob DescriptionWe are looking for Full Stack developers who need to be able to work on a weekly release schedule, with online demos and a minimal SCRUM routine.Need to be experts at REST webservice, Node.js and/or Vue.js.Our technology stack is:Backend webservices: on Node.js, Postgresql, Docker, Assorted AWS managed services, OAuth2.Front-end: Vue.js, bootstrap.Applying Procedure:Interested candidates are requested to send us your CVs to:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/senior-developer-nodejs-vuejs/"}, {"name": "Application Support Engineer", "company": "Tekvortex", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 16, 2020 23:55\n(5 days, 14 hours from now)", "education": "Bachelor", "skills": "Customer ServiceTeamworkCommunicationAnalytical", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Customer SupportJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 16, 2020 23:55\n(5 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Customer ServiceTeamworkCommunicationAnalyticalJob DescriptionThese are professional openings requiring a\nminimum of 1 year of relevant experience. Currently, we are seeking skilled and\npassionate professionals to provide technical support for our rapidly growing\nlarge-scale enterprise application to our customers worldwide.This is one of a kind opportunity for IT enthusiasts to\ngain global exposure. The ideal candidate will have sound technical knowledge\nacross a wide range of paradigms including IT infrastructure management, datacenters,\nnetworking, virtualization technologies, cloud technologies and so on. If you\nare not exposed to all these areas but are enthusiastic to learn, our experts\nwill be happy to train and get you to speed. You will have the opportunity to\nwork in a fast-paced environment with high profile system integrator like\nAmazon and rapidly learn trending technologies as you grow with us.ResponsibilitiesRespond to product related technical inquiries from\ncustomers.Help customers in product deployment and\ntroubleshooting technical issues, through calls and emails, in a positive,\nprofessional and efficient manner.Document customer issues and resolution steps taken\nto troubleshoot, and report to the product team.Capture customer aspirations, requirements and\nusability issues.Follow-up on customer issues in a timely manner and\nmonitor them to closure.Adhere to all necessary company policies and\nstandard operating procedures.Desired Skills/CharacteristicsBachelor's or equivalent technical degree in\ncomputer science or having considerable relevant experience.Experience of operating and supporting enterprise\napplication(s).Strong dedication to customer service and excellent\ntelephone skills.Strong troubleshooting and analytical skills to\nidentify and resolve application issues.Quick learner and passionate about exploring the\nlatest tools and technologies.Excellent English communication and interpersonal\nskills with ability to coordinate with customers remotely.Must understand the value of accuracy and attention\nto detail.Must be able to work independently on flexible\nschedule.Working knowledge of Linux environment, familiarity\nwith cloud services (AWS preferred), networking and virtualization\ntechnologies will be of added advantage.Applying Procedure:Candidates can also send their resume directly to[email protected].\nPlease mention the vacancy you are applying for in the subject of the cover\nletter.Remuneration to be based on experience and won't be a constraint for deserving candidates.The interview/hiring/training will be conducted remotely till the lock down is\nin place.OR,APPLY NOW", "Page_URL": "https://merojob.com/application-support-engineer-3/"}, {"name": "Quality Developer", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kupondole, Kandevtasthan", "salary": "$. 550.00 - 700.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "Html5JavascriptJquery", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kupondole, KandevtasthanOffered Salary:$. 550.00 - 700.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Html5JavascriptJqueryOther SpecificationSkills :Hands-on experience in JAVA Object-Oriented Programming design concepts and software development processes and methodsStrong knowledge of relational databases, SQLExperience with J2EE, HTML, CSS, JavaScript, jQueryExperience working with version control systems, such as GIT including branching and merging strategies.Excellent troubleshooting and communication skills( Verbal and Written)Excellent Logical and Analytical SkillAttention to detailTime Management and ProfessionalismExperience with technologies listed in previous sectionReporting and MetricsOn-time task completion percentageOther Job Requirements:At least a Bachelor’s degree in Computer Science or equivalentIT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksDesire and ability to continuously improve, discover and expand the limitsAbility to work independently or as a part of a teamJob DescriptionWe are looking for few highly motivated, organized professional Quality Developers in our Nepal office Software Development House Nepal (SDHN)Duties and Responsibilities include, but are not limited to:Resolves assigned tasks in an efficient and effective manner(Customer or internal)Design, implement and maintain JAVA application adhering to SDS coding standards and policiesCommunicate effectively with clients and vendors regularly and documents all specifications and workflows. All implementation meetings are followed up with written listing of all tasksDevelops test cases and data and test all changes and new modulesAdheres to SDS’s courteous and professional written and verbal communication standardsA consistently high rating on customer satisfaction surveys 5. Works independently with minimal guidanceActively involve in improving organizational culture, process, and standardsOther duties as assignedBusiness AnalysisUnderstands and follows all assigned customers workflow including import and export processAbility to interpret customer business processes, analyze problems and recommend programmable solutionsRisk DesignationThe role is classified as High Risk, due to access to Protected Healthcare Information. Employees in this role must be free of felony convictions on a background check reportBenefits:Health InsuranceProvident FundDashain Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Government Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesNote:Only shortlisted candidates will be contacted for the programming test and interviewFresher with excellent understanding of JAVA OOPs programming and communication skills are highly encouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationAPPLY NOW", "Page_URL": "https://merojob.com/quality-developer-5/"}, {"name": "Sr. QA Engineer (Work from Home)", "company": "Remote Coach", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "NRs. 80,000.00 Monthly", "deadline": "Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)", "education": "Bachelor", "skills": "Problem SolvingComputerAuditingMs OfficeDecision Making", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Test EngineerJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NRs. 80,000.00 MonthlyApply Before(Deadline):Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Problem SolvingComputerAuditingMs OfficeDecision MakingOther SpecificationBachelors degree preferredCertifications an advantage including Quality Auditor, Quality Engineer, Quality Improvement Associate, Six SigmaQuality inspection, auditing and testing experienceExperience with implementation of corrective action programsProduct or industry-specific experienceStrong computer skills including Microsoft Office, QA applications and databasesKnowledge of tools, concepts and methodologies of QASolid experience in effective usage of data analysis tools and statistical analysisKnowledge of relevant regulatory requirementsProblem analysis and problem solvingSound judgementDecision-making skillsAgile Project Execution MethodologiesJob DescriptionRemote Coach, a revenue generating start-up is looking for a Senior QA to join its engineering team and evolve the approach to Quality Assurance for its mobile, web and back-end applications. Remote Coach is a premium personal fitness coaching platform, allowing fitness professionals to compliment their direct coaching with clients by hosting virtual personal training sessions at their/their clients convenience. Additionally the platform provides real-time feedback on health data allowing coaches to monitor and tailor their client’s exercise and nutrition programs as necessary.As a Senior QA you will be responsible for:Shaping the company’s approach to functional system, UAT and regression testing.Leading other team members (QA or otherwise) in best practice testing approaches.Identifying, writing and executing functional tests per development sprint.Building and maintaining test suites for ease of regression and UAT.Reviewing and critiquing functional requirements and their suitability for testing.Proposing and identifying test and defect tracking toolsets. Optimising the usage of existing and new toolsets.Reporting on testing output, metrics and providing the leadership team with insights to overall software quality.Essential QualitiesA successful candidate will have the following key skills and qualities:Excellent written and spoken English.Previous experience in writing clear functional tests from requirements and identifying gaps in requirements.Direct functional testing of mobile applications.Direct functional testing of RESTful APIs through toolsets such as Postman.Knowledge of best practice test and defect tracking lifecycles.Team leadership experience (although not necessarily in a testing role).Ability to expand test coverage to fault find and provide meaningful first pass analysis to the development team when raising defects.Desirable QualitiesThe following are desirable but not essential:Experience working in an Agile software development process.Test automation design and implementation.Experience with JIRA and Confluence.Usage of test frameworks such as TestRail.Fault finding using application logs and writing SQL queries (MySQL).What We Will Offer:Flexible working hours, willing to work from homeA Salary dependant on experience and level of the challenge acceptedChance to work with an early-stage startup and be part of our growthChance to learn new skillsChance to work with the product teamApplying Procedure:Interested candidates are requested to send their updated resume directly e-mail to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/sr-qa-engineer-working-from-home/"}, {"name": "Sr./Mid Front-End Developer", "company": "Sage Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "JavascriptTeamworkHtmlCommunicationCss", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptTeamworkHtmlCommunicationCssJob DescriptionJob summary:At Sage, we are a part of a Product Team that delivers and maintains a vast array of products. We  use React to craft our highly responsive user interfaces that our millions of customers use to accomplish their day  to day tasks. Our microservices are managed by Spring Cloud and deployed by Jenkins every day. We are an agile  team that practices Scrum through and through. Sage values diverse experience and knowledge of everyone to  build products.Requirements that we need you to have:Using React to implement UI collaborating with Design TeamFetch responses from API to implement features collaborating with Backend TeamCreate maintainable and reusable componentsBenchmarking code performanceFixing bugs using debuggersReviewing Pull RequestsWriting documentation and blogsMaking products better for our usersGood understanding of the foundation of JavaScript, HTML, and CSSAt least 2 years’ experience in React/ Vue / Angular or similar framework or librariesUnderstands Git enough to use it as a version control systemExperience in interacting JSON based APIProper understanding of Dev tool featuresTeam player with excellent communication skillLonging to learn moreImmediate JoinerBenefits that you’ll get:A beefy laptop for developmentOnline courses or training as requiredCompensation for taking part in ConferencesMedical insurance and moreThe part that might grab your interest:If you believe you tick all the right boxes in the requirements, we promise to provide them with the best benefits  package which includes:Attractive salary packageWeekends off (Saturday –Sunday)Experience of working in a US-based corporateAmazing opportunity for career advancementGuidance and nurture by industry expertsFun, engaging and ever-growing work environmentRecruitment Process: (Virtual)HR InterviewAssessment RoundTwo to three step Tech interviewsTechno-Managerial Interview with Head of EngineeringFinal Interview with CEOHR/Negotiation RoundLocation:Remote or any of our locations in India & Nepal.Applying ProcedureDo you enjoy working in your own zone or love to travel and work?Do you have what it takes to be a part of the fastest growing team of Tech professionals in India/ Nepal?Covered by SAGE’s dev team is on the lookout for remarkable talents who excel at the use of React and has the  benchmarking coding performance. We want the finest developers who are swift on using Scrum and have an  exceptional understanding of JavaScript, HTML, and CSS, who desire to have the professional experience of  working for an international market and enhance their knowledge beyond horizons.If yes!, then send out your updated CV with recent GitHub ID at[email protected]along with the Subject  line“Covered by Sage- Front-End Developer- Sr./Mid.”as per your experience.Nepal HR contact detail:+977 9828555749/ +977 9841391786Note:Only mailed applications will be taken into consideration.", "Page_URL": "https://merojob.com/srmid-front-end-developer/"}, {"name": "SDE I/SDE II/ SDE III", "company": "Sage Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "InterpersonalTeamworkCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:InterpersonalTeamworkCommunicationJob DescriptionYou willWork on Sage’s most complex and impactful Channel Partnerships product Work closely with Sage leadership team and team of great product managers Help teams with helping with defining an architecture that would scale and also  encourage best practices.Work with cross platform teams.Develop and nurture engineers in team, to take best out of themContribute to engineering initiatives and be a key factor for the product development Continuously drive to explore, improve, enhance, automate, and optimize systems and tools  to best meet evolving business and market needsWhat You'll Need (SDE I)6+ months of quality industrial experience.Experience writing production quality server-side applications. Java or Go is preferred Experience working on open-source projects is a huge plus pointSolid clarity of web-development and computer science fundamentalsA high bar for writing clean, maintainable, scalable, and well-tested code. A good amount of exposure client-side technologies is a plus point.A temperament to contribute to architecture and product decisions.What You’ll Need (SDE II):3+ years building high quality scalable applications.2+ years of experience writing production quality server-side applications. Java or Go is  preferredA proven track record of working in quality engineering teamsA temperament to contribute to architecture and product decisionsA high bar for writing clean, maintainable, scalable, and well-tested code.  A good amount of exposure client-side technologies is a plus point.What You'll Need (SDE III)5+ years building high quality scalable applications.3+ years of experience writing production quality server-side applications. Java or Go is  preferredA proven track record of working in quality engineering teamsExperience working on open-source projects, building frameworks, ui platforms at scale  A temperament to contribute to architecture and product decisionsA high bar for writing clean, maintainable, scalable, and well-tested code.  A good amount of exposure client-side technologies is a plus point.An eye to recruit great people in your teamsBenefits that you’ll get:A beefy laptop for developmentOnline courses or training as requiredCompensation for taking part in ConferencesMedical insurance and moreThe part that might grab your interest:If you believe you tick all the right boxes in the requirements, we promise to provide them with  the best benefits package which includes:Attractive salary packageWeekends off (Saturday –Sunday)Experience of working in a US-based corporateAmazing opportunity for career advancementGuidance and nurture by industry expertsFun, engaging and ever-growing work environmentRecruitment Process: (Virtual)HR InterviewAssessment RoundTwo to three step Tech interviewsTechno-Managerial Interview with Head of EngineeringFinal Interview with CEOHR/Negotiation RoundWe have no dearth of Hard Technical Problems, come work with us in a high-growth startup  culture, where your growth is defined by your performance.Location: Remote or any of our locations in India & Nepal.Applying ProcedureDo you enjoy working in your own zone or love to travel and work?Do you have what it takes to be a part of the fastest growing team of Tech professionals in India/  Nepal?If Yes!, Send out your updated CV with recent GitHub ID at[email protected]along with  the Subject line“Covered by Sage- SDE I/SDE II/ SDE III”as per your experience.Nepal HR contact detail:+977 9828555749/ +977 9841391786Note:Only mailed applications will be taken into consideration.", "Page_URL": "https://merojob.com/sde-isde-ii-sde-iii/"}, {"name": "Backend Developer ( Nodejs)", "company": "UBA Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "Html5JavascriptNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Html5JavascriptNode.JsOther SpecificationBE in computer science or similar relevant fieldPrevious working experience as a Node.js Developer for 3 yearsJob DescriptionBuild customer-facing UI and back-end services for payment processing administration and managementCode, test and operate node.js based servicesEffectively use tools and ingenuity to identify and fix defects before they become a problemIn-depth knowledge of Node.jsExperience with REST API development and API securityExperience with Sql and NoSql dbsHands-on experience with HTML, CSS, and AJAXDevelopment experience designing object-oriented JavaScript and SVGApplicable knowledge of web libraries and frameworks such as AngularJS, Polymer, and ClosureFamiliarity with the whole web stack, including protocols and web server optimization techniquesStrong analytical skills and problem solving aptitudeAttention to detailsAPPLY NOW", "Page_URL": "https://merojob.com/backend-developer-nodejs/"}, {"name": "Principal Software Engineer", "company": "Sage Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 14 hours from now)", "education": "Bachelor", "skills": "Problem SolvingTime ManagementTeamworkCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 8 yearsProfessional Skill Required:Problem SolvingTime ManagementTeamworkCommunicationJob DescriptionYou willDesign, architect and deliver the Sage’s most complex and impactful Channel Partnerships product with highest qualityDrive continuous innovation and continuous improvement of the platformWork closely with cross-functional teams, Sage’s leadership team and team of great  product managersEstimates efforts, identify risks, project schedules and drive the closure of allopen  issues on time.Multi-task, identify risks and prioritize responsibilities based on changing requirements.Help teams with helping with defining an architecture that would scale, providecode  reviews and also encourage best practices.Recruit engineers better than you, in collaboration with our recruiting teamLead the team by example. Develop, influence and nurture engineers in team, to take  best out of them and help them grow in their career.What You'll Need8-15+ years of experience in building massively large-scale distributed systems. A  proven performance track record and a team player with high-energy.Expertise and quality experience in writing production quality applications in Java, C++  or GoA knack on problem solving and excellent data structures and algorithms skillsAn eye that is keen on details and precision and provide constructive feedback.Deep knowledge of open source software, frameworks and broader cutting-edge  technologies.Agility and ability to adapt quickly to changing requirements and scope and priorities.A high bar for writing clean, maintainable, scalable, and well-tested code.An eye to recruit great people in your teams and leadership qualitiesWe have no dearth of Hard Technical Problems, come work with us in a high-growth startup  culture, where your growth is defined by your performance.Location: Remote or any of our locations in India & Nepal.Applying ProcedureEmail application to[email protected]. Please mention the role'Principal Engineer' in the subject  line.HR contact detail: +977 9828555749", "Page_URL": "https://merojob.com/principal-software-engineer/"}, {"name": "React Native Developer", "company": "Agile Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Gairidhara, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 12, 2020 23:55\n(1 day, 14 hours from now)", "education": "Bachelor", "skills": "JavascriptNativeMobile Application DevelopmentReact", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Mobile AppsJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Gairidhara, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 12, 2020 23:55\n(1 day, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptNativeMobile Application DevelopmentReactOther SpecificationAt least 2 year experience of building mobile applications using React Native;Experience building and consuming APIs to interact with other applications using REST or GraphQL,Microsoft Graph API, OData etc;Proficiency with HTML, CSS, JavaScript;Experience both Android and IOS development;Experiencein working in an agile environment to quickly iterate and deliver features to users.Company Benefits:Medical, accidental, OPD and COVID-19 insurance schemeFree Lunch at officeCompetitive salary packages to the deserving candidatesAttractive incentives and bonusesA friendly, competitive and creative working environment with higher level of exposure to the top corporate housesPaid leaves in compliance with the labor laws to maintain the healthy work life balance of employeesLoan program facility in case of financial emergency with zero interestConveyance allowance scheme that covers day to day transportation costTechnology allowance program for the employees who prefer using their own laptopsJob DescriptionDesign and implement a mobile application for iOS and Android using React Native;Create a scalable, testable, documented application so that we can grow the product over time;Keep up with technology changes in our space and leverage them when appropriate;Leverage native APIs for deep integrations with both platforms;Build reusable components and front-end libraries for future use;Participate in product design, offer new ideas and understand that not every idea will be adopted;Diagnose and fix bugs and performance bottlenecks for performance that feels native;Work independently to delivery software on time;Document all aspect of your work.APPLY NOW", "Page_URL": "https://merojob.com/react-native-developer-8/"}, {"name": "NodeJS | Typescript | Angular | NestJS Developer", "company": "Thingerz", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Remote, Work From Home", "salary": "NRs. 20,000.00 - 50,000.00 Monthly", "deadline": "Nov. 18, 2020 23:55\n(1 week from now)", "education": "", "skills": "Node.JsJavascriptCommunicationAngular", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Remote, Work From HomeOffered Salary:NRs. 20,000.00 - 50,000.00 MonthlyApply Before(Deadline):Nov. 18, 2020 23:55\n(1 week from now)Job SpecificationExperience Required:More than 2 yearsProfessional Skill Required:Node.JsJavascriptCommunicationAngularOther SpecificationRequired SkillsStrong proficiency with JavaScript and TypescriptStrong working experience with Node.jsExperience with Angular FrameworkExperience with MongoDBDesirable Skills:NestJS FrameworkAngular FrameworkIonic FrameworkTest Driven Development SkillsExperience with Socket IOJob DescriptionIntegration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsImplementation of security and data protectionIntegration of data storage solutionsWrite modular, reusable and excellent quality code, code reviews, and implement best practicesTake responsibility of project and ensure robust hosting, application stability, security and system integrationSupport the migration and redeployment of existing application (if any)APPLY NOW", "Page_URL": "https://merojob.com/nodejs-typescript-developer/"}, {"name": "Full Stack Developer", "company": "Doransoft Pvt. Ltd.", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 12, 2020 23:55\n(1 day, 14 hours from now)", "education": "Bachelor", "skills": "LaravelNode.JsReactCss3Postgresql", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 12, 2020 23:55\n(1 day, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:LaravelNode.JsReactCss3PostgresqlOther SpecificationShould have minimum of 2 years of work experienceHands on experience writing NodeJS + AngularJS/ReactJS + PostgreSQL / MySQL / MongoDB code in productionExperience building highly scalable service APIs (REST, SOAP, Microservices) hosted on cloud environmentExperience with Agile Development, SCRUM, or Extreme Programming methodologies Skills RequiredStrong experience in HTML5, CSS3, Javascript, JQuery and latest Javascript frameworks (Backbone, Bootstrap,Node.js etc)Experience in one or more MVC frameworks(Laravel, Codeigniter, Ruby on Rails, Spring) is a plusCan provide support for existing applicationsSelf Motivated and open minded personGood learning attitudeExperience in integration and deliveryAbility to liaise at all levels within the businessSolid analysis and problem-solving skillsJob DescriptionAbility to work independently or as part of a teamIdentify technical problems and procedures and communicate their applicable solutionsParticipate in collecting information for developing enterprise level applicationsBe part of development team to migrate web applications in other technologies into NodeJS and MongoDB environmentResolve issues related to web application like cross-browser compatibility, security issues and moreDeveloping scalable applications (both Front-end (ReactJS / ReactJS Native and Back-end NodeJS)Basic Knowledge of secure coding practices as it pertains to OWASPExperience of working in a SCRUM/Agile team would be added valueWriting reusable code and libraries, optimize applications for performance and scalabilityDesign and implementation of low-latency, high-availability, and performance applicationsBuilding secured backend API's to be consumed by multiple applications (e.g. web and mobile) Implementation of security and data protectionWhat We OfferDashain BonusYour own workstationAnnual Paid LeavesFree LunchExcellent career opportunities5 days a weekOpen office environmentAPPLY NOW", "Page_URL": "https://merojob.com/full-stack-developer-41/"}, {"name": "UI/UX Designer", "company": "Agile Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Gairidhara, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 12, 2020 23:55\n(1 day, 14 hours from now)", "education": "Bachelor", "skills": "Wireframing And Ui PrototypingVisual CommunicationInteraction DesignUx ResearchAnalytics", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Gairidhara, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 12, 2020 23:55\n(1 day, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Wireframing And Ui PrototypingVisual CommunicationInteraction DesignUx ResearchAnalyticsOther SpecificationUp-to-date knowledge of design software like Adobe,\nIllustrator and PhotoshopKnowledge of wireframe tools (e.g. Figma, Sketch, XD,Wireframe.ccand InVision)Knowledge of design language like CSS, Android XML\nlayoutCompany Benefits:Medical, accidental, OPD and COVID-19 insurance schemeFree Lunch at officeCompetitive salary packages to the deserving candidatesAttractive incentives and bonusesA friendly, competitive and creative working environment with higher level of exposure to the top corporate housesPaid leaves in compliance with the labor laws to maintain the healthy work life balance of employeesLoan program facility in case of financial emergency with zero interestConveyance allowance scheme that covers day to day transportation costTechnology allowance program for the employees who prefer using their own laptopsJob DescriptionGather and evaluate user requirements in collaboration with Managersllustrate design ideas using storyboards, process flows and sitemapsDesign graphic user interface elements, like menus, tabs and widgetsDevelop UI mockups and prototypes that clearly illustrate how sites function and look likeCreate original graphic designs (e.g. images, sketches and tables)Prepare and present rough drafts to internal teamsIdentify and troubleshoot UX problems (e.g. responsiveness)Conduct layout adjustments based on user feedbackAdhere to style standards on fonts, colors and imagesAPPLY NOW", "Page_URL": "https://merojob.com/uiux-designer-53/"}, {"name": "Business Intelligence", "company": "Safalsathi Incorporate Pvt. Ltd.", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "Problem SolvingExcelAnalyticalCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Less than 1 yearProfessional Skill Required:Problem SolvingExcelAnalyticalCommunicationOther SpecificationBachelor’s degree in Information Technology, Computer Science, Engineer or related discipline preferred6 months to 1 year of work experience with proven ability to manage multiple complex projects and clients under tight deadlinesHigh proficiency in Excel; experience with the latest BI features in ExcelStrong SQL skillsBackground in analytics or statistics preferredMust be intellectually curious—innately driven to ask questions and dive into the details and obsessed with problem solving and finding efficiencies to help grow an ever- changing businessExcellent Verbal and Written English skillsJob DescriptionInterpret massive quantitative data, analyze results using statistical techniques and provide ongoing reportsIdentify trends or patterns in complex data setsConduct full analytical life cycle activities which include data gathering, data extraction, analysis, and presentation of resultsIdentify and resolve issues systematically and collect feedback for further modificationFilter and clean data, and review reports, and performance indicators to locate and correct problemAPPLY NOW", "Page_URL": "https://merojob.com/business-intelligence-3/"}, {"name": "Content Writer (Commercial)", "company": "Safalsathi Incorporate Pvt. Ltd.", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "OrganizationalMs OfficeCommunicationSearch Engine Optimization (Seo)", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Content DeveloperJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:OrganizationalMs OfficeCommunicationSearch Engine Optimization (Seo)Other SpecificationKnowledge, Skills and Ability:Proficiency in English and Nepali writing with experience in translation, proofreading and subtitlingExperience in producing copy for digital, print and broadcast channels.Understanding of SEO concepts preferredExceptional skill with the nuances of social media writing, including the use of hashtags, emoji’s and acronymsProficiency with Microsoft Office software, including Word, Excel, PowerPointA collaborative work ethic and easy-going natureAbility to take constructive criticism with ease and graceExperienced at multi-tasking and is not intimidated by the thought of juggling multiple projects and tasks at onceAbility to collaborate across all teams and can own projects from start to finishExcellent organizational, verbal and written communication skillsJob DescriptionWrite original, high- engagement contents that reflects our brand’s voice in various mediums such as for advertisements, media releases, corporate releases, videos, blogs, social media etcCollaborate with Marketing, PR and Customer Service to develop a variety of contentsPrepare and publish articles that describe the company and productsShape language and tone used in sales emails, banners and brochuresLiaise with designers to enrich text with visual aids like images and chartsProduce error-free content that adheres to the company’s style guidelinesSimultaneously manage multiple projects with short deadlinesAPPLY NOW", "Page_URL": "https://merojob.com/content-writer-commercial/"}, {"name": "React Web Developer", "company": "Youth Innovation Lab", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Bishalnagar/ Work from home available.", "salary": "Negotiable", "deadline": "Nov. 14, 2020 23:55\n(3 days, 14 hours from now)", "education": "Bachelor", "skills": "JavascriptReact JsDebugging", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Bishalnagar/ Work from home available.Offered Salary:NegotiableApply Before(Deadline):Nov. 14, 2020 23:55\n(3 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptReact JsDebuggingOther SpecificationMinimum 2 years of experience in JavaScript / React JS TechnologyExperience with user interface designHands-on experience on working with Mapbox GL JS and Mapbox studio is a mustProficient in React and React state management through both Context API and ReduxUnderstanding of Typescript and its implementation in React projectsExperience working with webpack bundler, Babel, ESLintHaving Knowledge of Jest, Recharts and D3 is a plus pointSome experience with version control tool like GitA good understanding of REST APICapable of writing clean and reusable components with re-usability in mindRock solid at working with third-party dependencies and debugging dependency conflictsJob DescriptionPassion for programming in general, rather than a specific languageAbility to learn new, emerging technologiesCommunicate with the technical team, express ideas, and collaborate with the team throughout the design and development processesWriting application interface codes using JavaScript following React.js workflowsPossess strong troubleshooting, code optimization and refactoring skillsDeveloping and implementing front-end architecture to support user interface conceptsDocumenting application changes and developing updatesApplying Procedure:Applicants are requested to drop their CV and cover letter in mentioned mail:srijan@youthinnovationlab.orgAPPLY NOW", "Page_URL": "https://merojob.com/react-web-developer/"}, {"name": "Mean Developer", "company": "Aafanta Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)", "education": "Bachelor", "skills": "JavascriptAjax", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:JavascriptAjaxJob DescriptionQualification and ExperienceBachelor in Information Technology1-2 years of experience requiredSkillsPHP JavaScript, MYSQLJQUERY, AJAX, website & mobile Apps handlingApplying Procedure:Interested candidates are requested to send their updated resume at[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/mean-developer/"}, {"name": "Software Engineering Manager", "company": "Cloudyfox Technology", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "LeadershipAnalyticalCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:LeadershipAnalyticalCommunicationInterpersonalOther SpecificationSkills and Qualifications:Minimum of a bachelor’s degree in engineering/computer science or relatedfieldsMaster’s degree in related field will be added advantage3+ years of engineering experience, ideally in a leading a small team roleAnalytical and mathematical mind, capable of evaluating and solving various  complex problemsLeadership skills necessary to manage and develop a teamOrganizational competencies and project management skills to keep projects, processes, and the entire engineering team on trackSelf-motivated attitude with the ability to multitask and thrive in a timeline-driven environmentInterpersonal communication skills with expertise in distilling complicated topics to a broader audienceAbility to work individually or as part of a teamJob DescriptionWe are seeking an experienced, detail-oriented engineering manager to join our growing team. In this position, you will play a key role in the overall success of our organization by planning, managing, and monitoring engineering functions. You will be responsible for overseeing various engineering projects, processes, budgets, and timelines and making any necessary adjustments in order to ensure successful completion.Responsibilities:Serve as the engineering leader and technical expertAnswer questions and resolve issues brought forth by the engineering teammembersCreate detailed engineering plans, processes, and procedures for engineering staff to use and abide byPropose and oversee budgets and timelines for engineering projectsCheck and confirm the accuracy of the work performed and the methods used by engineering staffConduct various tests and quality assurance checks to verify the quality ofcompleted projectsMonitor and determine various staffing and training needsHire, train, and supervise engineering staff membersSpearhead various research and development initiatives to identify opportunities for new projects and improved processesCommunicate and collaborate with other managers, suppliers, and contractorsPrepare and deliver various engineering-related presentations, both internally and externallyBe a mentor to the teamMotivate the team and bring their voice to top levelsAPPLY NOW", "Page_URL": "https://merojob.com/engineer-manager/"}, {"name": "Sr Software Engineer - Go Lang", "company": "Cloudyfox Technology", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "GraphqlGrpcTdd", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:GraphqlGrpcTddOther SpecificationSkills:Strong knowledge of Go programming language, paradigms, constructs, and idiomsKnowledge of common Goroutine and channel patternsExperience with the full site of Go frameworks and toolsDependency management tools such as Godep, Sltr, etc.Go’s templating languageGo’s code generation tools, such as StringerPopular Go web frameworks, such as RevelRouter packages, such as Gorilla MuxAbility to write clean and effective Godoc commentsFamiliarity with code versioning tools GitTDDExperience on docker or AWS Lambdas will be added advantageExperience with GraphQL, gRPC would be added advantageJob DescriptionWe are looking for a great Go developer who possesses a strong understanding of how best to leverage and exploit the language’s unique paradigms, idioms, and syntax. Your primary focus will be on developing robost microservices using Go. You will ensure that these Go packages and programs are well documented and has a reasonable test coverage. You will coordinate with the rest of the team working on different layers of theinfrastructure. A commitment to collaborative problem solving, sophisticated design, and quality product is essential.Responsibilities:Writing scalable, robust, testable, efficient, and easily maintainable codeTranslating software requirements into stable, working, high performance softwarePlaying a key role in architectural and design decisions, building toward an efficient micro services distributed architecturePeer programming & Code reviewImproving the teamAPPLY NOW", "Page_URL": "https://merojob.com/sr-software-engineer-go-lang/"}, {"name": "Quality Assurance Engineer", "company": "Cloudyfox Technology", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "Problem SolvingCritical ThinkingTechnicalAnalyticalCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Problem SolvingCritical ThinkingTechnicalAnalyticalCommunicationOther SpecificationSkills and Qualifications:BS/BA in computer science, engineering, information technology, or related fieldProven work experience as a QA tester or similar role Significant work history showing aptitude for project management and QA methodologyWorking knowledge of Agile frameworks and regression testing is a plusCompetence in all technical skills needed to document and troubleshoot errorsExperience and familiarity with test management software and SQLStrong critical thinking skills, an analytical mind, and problem-solving aptitudeBe willing to help your teammates, share your knowledge with them, and learn from themBe open to receiving constructive feedback and turning it into process improvementsJob DescriptionWe are currently seeking a highly-skilled Quality Assurance Engineer to assess software quality through manual and automated testing. In this position, you must have a keen eye for detail, excellent organizational, and communication skills. Critical thinking and problem-solving abilities are a must, as well as skilled execution of test cases and a passion for quality.Responsibilities:Review and analyze requirements, specifications, and technical design documents, providing timely feedbackDevelop detailed, comprehensive, and well-structured test plans and test casesCollaborate with QA Engineers to develop effective strategies and test plansConsistently execute test cases (manual and/or automated) and analyze results in a timely mannerEvaluate product code according to specificationsPlay the role of test engineer: Design, develop, and execute automated testsGenerate logs to document testing phases and defectsEffectively report bugs and errors to development teams Help troubleshoot issues.Follow-through and conduct post-release/post-implementation testing Work with cross-functional teams to ensure quality throughout the software development lifecyclePrioritize and plan testing activitiesAPPLY NOW", "Page_URL": "https://merojob.com/quality-assurance-engineer-23/"}, {"name": "Sr Software Engineer – NodeJS", "company": "Cloudyfox Technology", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "Css3Html5Node.JsTypescript", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Css3Html5Node.JsTypescriptOther SpecificationSkills and Qualifications:Strong proficiency with JavaScriptTypeScriptVery good Knowledge of Node.js & ExpressThe nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages eg JadeGood understanding of server-side CSS preprocessorsBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitWe follow TDD so testing should be a easy thing for youWe love AWS so expertise on Lambdas, ECS , DynamoDB will be an addedadvantageExperience with GraphQL would be added advantageJob DescriptionWe are looking for a Node.js Developer to join our awesome team. Your primary focus will be building, documenting, shipping & maintaining apis. Also you will help other engineers & coding ninjas with feedbacks, reviews etc.Responsibilities:Follow api first design and build robust apis for microservicesWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performantapplications, servicesImplementation of security and data protectionIntegration with databases preferably NoSQL - DynamoDBWork in team, is very important, you not only grow yourself, but you growtogetherYou should be flexible & openYou should do sometime peer programming & code reviewsAPPLY NOW", "Page_URL": "https://merojob.com/sr-software-engineer-nodejs/"}, {"name": "Sr iOS Developer – Swift", "company": "Cloudyfox Technology", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "GitTddRestful ApisUi/Ux", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:GitTddRestful ApisUi/UxOther SpecificationSkillsProficient with Objective-C or Swift, and Cocoa TouchExperience with iOS frameworks such as Core Data, Core Animation, etc.Experience with offline storage, threading, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apple’s design principles and interface guidelinesKnowledge of low-level C-based libraries is preferredExperience with performance and memory tuning with tools such as InstrumentsFamiliarity with cloud message APIs and push notificationsKnack for benchmarking and optimizationProficient understanding of GitTDDFamiliarity with continuous integrationJob DescriptionWe are looking for an iOS developer who will be responsible for developing applications for mobile devices powered by Apple’s iOS operating system. Your primary focus will be development of iOS applications and their integration with back-end services. You should be proficient with one of the two programming languages for this platform: Objective-C or Swift.You must also have a strong understanding of the patterns and practices that revolve around the iOS platform. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.ResponsibilitiesDesign and build applications for the iOS platformWriting scalable, robust, testable, efficient, and easily maintainable codeEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationAPPLY NOW", "Page_URL": "https://merojob.com/sr-ios-developer-swift/"}, {"name": "Sr Android Developer – Kotlin", "company": "Cloudyfox Technology", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Anamnagar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "GitTddRestful Apis", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Anamnagar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:GitTddRestful ApisOther SpecificationSkillsProficient with Java or Kotlin, and Android StudioStrong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizesFamiliarity with RESTful APIs to connect Android applications to back-end servicesStrong knowledge of Android UI design principles, patterns, and best practicesExperience with offline storage, threading, and performance tuningAbility to design applications around natural user interfaces, such as “touch”Familiarity with the use of additional sensors, such as gyroscopes and accelerometersKnowledge of the open-source Android ecosystem and the libraries available for common tasksAbility to understand business requirements and translate them into technical requirementsFamiliarity with cloud message APIs and push notificationsA knack for benchmarking and optimizationUnderstanding of Google’s Android design principles and interface guidelinesProficient understanding of GitTDDFamiliarity with continuous integrationJob DescriptionWe are looking for an iOS developer who will be responsible for developing applications for devices powered by the Android operating system. Your primary focus will be the development of Android applications and their integration with back-end services. Due to the fragmentation ofthis ecosystem, you must pay special attention to the application’s compatibility with multiple versions of Android and device types.You must also have a strong understanding of the patterns and practices that revolve around such a platform. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.ResponsibilitiesDesign and build applications for the Android platformTranslate designs and wireframes into high quality codeWriting scalable, robust, testable, efficient, and easily maintainable codeEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatizationAPPLY NOW", "Page_URL": "https://merojob.com/sr-android-developer-kotlin/"}, {"name": "Backend Developer", "company": "Sharelook PTE LTD", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 60,000.00 - 90,000.00 Monthly", "deadline": "Dec. 14, 2020 23:55\n(1 month from now)", "education": "Bachelor", "skills": "CdkDevopsBack End DeveloperAws ArchitectNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 60,000.00 - 90,000.00 MonthlyApply Before(Deadline):Dec. 14, 2020 23:55\n(1 month from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:CdkDevopsBack End DeveloperAws ArchitectNode.JsOther SpecificationStrongly capable NodeJS developer, preferably experience with typescriptExperience with AWS and Lambda's a plus, training will be provided by senior AWS serverless professionalUnderstanding of cybersecurity and efficient codingExperience with DevOps a plusStrong Typescript developerExperience with CDK a plusAble to communicate effectively in EnglishAble to travel when neededJob DescriptionWe are looking for:Experienced NodeJS (Java script) developer.  (AWS architect is a plus)Be the technical product owner of an existing hybrid serverless backend system on AWSResponsibilitiesImplement security and optimisation improvementsImprove DevOps and automated CI/CD workflowBe responsible for ensuring security and privacy compliance in all backend codeOversee evolving the platform to AWS  (from Serverless framework) and typescript (from javascript)Responsible for publishing new changes to live and monitoring the live platformAPPLY NOW", "Page_URL": "https://merojob.com/backend-developer-28/"}, {"name": "Machine Learning", "company": "Sharelook PTE LTD", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 80,000.00 - 100,000.00 Monthly", "deadline": "Dec. 14, 2020 23:55\n(1 month from now)", "education": "Bachelor", "skills": "Ai/MlDatabaseJupyterSparkPython Developer", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 80,000.00 - 100,000.00 MonthlyApply Before(Deadline):Dec. 14, 2020 23:55\n(1 month from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Ai/MlDatabaseJupyterSparkPython DeveloperOther SpecificationYour experience should include:Demonstratable practical experience with machine learning and data science techniquesProven competency in managing your own time and projectsCapable Python developer (with a focus on data science)Familiar with tools such as Jupyter, Spark, databases, etc.Familiar with AI/ML models and strategiesFamiliar with cloud-based ML services a plus (e.g. AWS Sagemaker, Athena, etc.)At least 3 years of relevant working experienceRelevant education a plusJob DescriptionThis is a very hands-on role covering the full data lifecycle: collection, preparation, analysis and reporting. As the lead data scientist you will be expected to be independent and take the initiative with new ideas and feature suggestions for the platform.Natural Language Processing (NLP) will often be a big part of what we do, understanding, interpretating and re-using written and spoken contentDeep learning for data categorisation, course design and content matchingData analytics to drive insights about study progress, knowledge gaps, learning goals, etc.Reporting directly to the owner, your responsibilities will include:Working with the user-facing teams to determine of ML can solve particular requirementsOwnership of all collected data, ensuring it is stored and accessible in a format optimised for data analyticsMonitoring and analysing collected data, and making suggestions on additional data that could be captured for new insightsDesigning and training of models to achieve new data insights and add or improve platform featuresAPPLY NOW", "Page_URL": "https://merojob.com/natural-language-processing/"}, {"name": "WordPress Developer", "company": "Web Experts Nepal", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 29, 2020 23:55\n(2 weeks, 4 days from now)", "education": "Bachelor", "skills": "JavascriptJqueryCommunicationPhp Framework", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 29, 2020 23:55\n(2 weeks, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptJqueryCommunicationPhp FrameworkOther SpecificationQualification:Bachelors in related field is MUST but we do not undermine the skill sets possessed by a personnel who do not meet minimum education criteriaSkills:Should have 2+ year experience working with real time WordPress projectsShould have adequate knowledge in  PHP, MYSQL, JavaScript, jQueryGood knowledge in any PHP frameworks is a plusGood understanding of React is of high valueMust be comfortable working in multiple projects across different framework and platformShould be highly enthusiastic, eager to learn and have strong problem solving skillBe able to document your work and direct project hand-over documentation and/or usage guidesMust have strong communication and written skills (English)Job DescriptionSit with Technical Lead and Projects Coordinator in Requirement Analysis and Features BreakdownDiscuss with team for Estimates based on Features BreakdownSetup Working Environment and maintain files through version control (Git)Follow Company's Coding standards to achieve results with minimum (if not nil) deviationsDevelop and Test builds that meet Client's requirementPerform Unit Testing and make multiple commitsDeploy on staging or on client's serverProvide factual and detailed update document to clientHandle updates and take charge to complete the project based on the timeline and milestones sketchedConduct knowledge sharing session and should always be looking to introduce new and efficient development trendsCompany BenefitsCompetitive SalaryAmazing team of enthusiasts where learning never goes southLunch, Snacks, Tea & Beverages with other refreshmentsFlexible Time SlotTimely Performance Review and Salary IncrementAdrenaline and Adventurous excursions on timely basis along with Office partyDashain and Project/Performance bonusesTraveling allowanceApplying Procedure:Send your updated resume to[email protected]. We would schedule an interview from the final shortlist.OR,APPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-196/"}, {"name": "Wordpress Developer", "company": "Versatile Information Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Birendra Marg, Dill bazar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 30, 2020 23:55\n(2 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptCssHtmlPhpRestful", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Birendra Marg, Dill bazar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 23:55\n(2 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavascriptCssHtmlPhpRestfulOther SpecificationSkills and Qualifications:At least 3 years’ experience working on WordPress platformProven Experience in PHP, mySQL,HTML,CSS and JavascriptExperience in customizing WordPress Plugins and WordPress themesKnowledge of CodeIgnitor, Laravel would be a plusAbility to use RestFul web services and experience in working withJSON and AJAX RequestExtremely detail-oriented with strong attention to detailsProactive and able to work autonomouslyFlexible in work functions and dutiesAbility to prioritise tasks and work on deadlinesMust be a team playerMust be able to work from homeNote:This role is not open for freshers and beginnersJob DescriptionBuilding websites and landing pages in WordPress themeCreating website architectureDesigning and managing the website back-end including database andserver integrationGenerating WordPress theme and pluginsConducting website performance testsTroubleshooting content issuesMonitoring performance of live websitePreparing comprehensive documentation including website manualDesigning and implementing new features and functionalityHelping formulate an effective, responsive design and turning it into aworking theme and pluginCollaborating with the marketing team to complete tasksWorking Hours:7:00 AM to 3:00 PM, Sunday to FridayApplying Procedure:Email us your CV and some samples at[email protected]ORAPPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-197/"}, {"name": "Web Designer", "company": "Core Dreams Innovation", "level": "Mid Level", "vacancy": "2", "time": "Full Time ,\nContract", "address": "Tikhidewal, Satdobato, Lalitpur , Nepal", "salary": "NRs. 20,000.00 - 25,000.00 Monthly", "deadline": "Nov. 14, 2020 23:55\n(3 days, 14 hours from now)", "education": "Bachelor", "skills": "JavascriptHtmlCreative ThinkingUi/Ux", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full Time ,\nContractJob Location:Tikhidewal, Satdobato, Lalitpur , NepalOffered Salary:NRs. 20,000.00 - 25,000.00 MonthlyApply Before(Deadline):Nov. 14, 2020 23:55\n(3 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptHtmlCreative ThinkingUi/UxOther SpecificationOutstanding designing skills and fast learnerExcellent skill in Photoshop, Illustrator or other visual design and wireframing toolsProficiency in HTML, CSS, JavaScript, Bootstrap (or other relevant frameworks)Knowledge of file sharing tool such as Filezilla, GithubWordPress experience is not required, but a huge plusUpload the work in the test serverExcellent knowledge of UI/UX, browser compatibilityExperience with agile methodologiesJob DescriptionPrepare a work plan for the project tasks daily, and provide the work statusReport at the end of the day based on the work plan preparedTesting the developmentShould be a fast & non-frustrating debuggerShould be always ready for challenging taskCommitted to Project timelineHardworking, sincere and serious about their job responsibilitiesCompany Benefits:Lunch facility with tea/ coffee refreshmentPaid over timeSalary will be revised as per the performance for every deserving candidateWorking hours: 9 am - 6 pmWorking Days: Monday to Friday(Saturday and Sunday- Off)AL/SL/CL on monthly providedApplying Procedure:Please apply with a CV and motivation letter/Email to[email protected]Please list out the completed projects for further selectionPlease state/describe your responsibilities within the projects you have accomplishedAPPLY NOW", "Page_URL": "https://merojob.com/web-designer-492/"}, {"name": "Quality Assurance Specialist", "company": "Core Dreams Innovation", "level": "Entry Level", "vacancy": "1", "time": "Contract", "address": "Tikhidewal, Satdobato, Lalitpur , Nepal", "salary": "NRs. 15,000.00 Monthly", "deadline": "Nov. 14, 2020 23:55\n(3 days, 14 hours from now)", "education": "Intermediate", "skills": "Time ManagementProduct TestingCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Entry LevelNo. of Vacancy/s:[1]Employment Type:ContractJob Location:Tikhidewal, Satdobato, Lalitpur , NepalOffered Salary:NRs. 15,000.00 MonthlyApply Before(Deadline):Nov. 14, 2020 23:55\n(3 days, 14 hours from now)Job SpecificationEducation Level:IntermediateExperience Required:Not RequiredProfessional Skill Required:Time ManagementProduct TestingCommunicationInterpersonalOther SpecificationFamiliarity with testing tools and platforms, as well as implications of interactive deliverable on mobile devicesEffective communication, social and interpersonal skillsStrong organization and time-management skillsMeticulous attention to detailExperience with cross-functional account and project management teamsGreat attitudeExperience with Microsoft OfficeNote: Salary Range : Upto Rs 15,000 per monthJob DescriptionAnalyze and translate application requirements into test cases, test data and test proceduresPrepare, execute, and maintain efficient, reusable, and reliable test scripts and test dataDocument and log issues, and work with team members to resolve discrepanciesPerform thorough regression testing when bugs are resolvedCollaborate with creative, project management and account professionals to ensure deliverableare free of defectsCompany Benefits:Lunch facility with tea/ coffee refreshmentPaid over timeSalary will be revised as per the performance for every deserving candidateWorking hours: 9 am - 6 pmWorking Days: Monday to Friday(Saturday and Sunday- Off)AL/SL/CL on monthly providedApplying Procedure:Please apply with a CV and motivation letter/Email to[email protected]Please list out the completed projects for further selectionPlease state/describe your responsibilities within the projects you have accomplishedOR,APPLY NOW", "Page_URL": "https://merojob.com/quality-assurance-specialist-4/"}, {"name": "Flutter Developer", "company": "Smartmobe", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 15, 2020 23:55\n(4 days, 14 hours from now)", "education": "Bachelor", "skills": "Flutter FrameworkCommunicationAgile Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 15, 2020 23:55\n(4 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Flutter FrameworkCommunicationAgile DevelopmentOther SpecificationShould have 2-5 years of good expertise in developing hybrid mobile applications,with at least 2 years of experience in the Flutter frameworkShould have worked on multiple Flutter projectsShould have good communication skillsA strong commitment to quality and willingness to learnExperience with third-party libraries and APIsExperience working in an agile development processBe proficient in using version control and continuous integration, with tools such asBitbucket and GitWrite clear, maintainable and testable code that you are proud ofGood communication skillsSolid understanding of the full mobile development life cycle, including automatedtesting and buildingJob DescriptionDevelop hybrid mobile apps for iOS and Android platform using Flutter frameworkHands of experience in FlutterProven software development experienceEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresReport to the Project Manager/Team Leader regarding the progress, impediments ofassigned project/tasksShare knowledge and ideas among other developers on the project or tools used, oron any R&D done during the project timelineBenefits:Attractive salary to match your performanceMedical and Accidental InsuranceInternet Allowance5 Working days onlyDashain BonusFlexible and creative working environmentRefreshment Parties and OutingsFree lunch/snacks/teaTraining and development programsNote :Female Candidates are encouraged to applyApplying Procedure:If you think you are the perfect one for the above post then send your CV with cover-letter in pdf format to[email protected].Come and Be A Part of the SmartMobe Family!!!SmartMobe Solutions, is an Equal Opportunity Employer. This company does not and will not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law.OR,APPLY NOW", "Page_URL": "https://merojob.com/flutter-developer-11/"}, {"name": "Laravel Developer", "company": "Global Interface", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "New Baneshwor", "salary": "Negotiable", "deadline": "Dec. 01, 2020 23:55\n(2 weeks, 6 days from now)", "education": "Bachelor", "skills": "MysqlPhpLaravel Framework", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:New BaneshworOffered Salary:NegotiableApply Before(Deadline):Dec. 01, 2020 23:55\n(2 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than 1 yearProfessional Skill Required:MysqlPhpLaravel FrameworkOther SpecificationProficient PHP proficiency in large, scalable web applicationsProficient proficiency with LaravelStrong understanding of REST APIs, SQL query authoring, performance tuning, relational database design and working with data at scaleVersion control systems, Git and GitHubFunctional understanding of Unix commands and environmentsGood communication skills and client-oriented attitudeProblem solving skills, analytical mind and positive attitudeResults oriented and focused on meeting deliverable timelinesEagerness to learn new ideas, concepts and technologiesJob DescriptionWrite technical and developed documentation for new and existing applicationsDevelop APIs and applicationsBuild efficient, testable, and reusable PHP modulesSolve complex performance problems and architectural challengesPerform unit and system-level testing using various testing frameworksBuild innovative, state-of-the-art applications and collaborate with the User Experience (UX) team.Ensure HTML, CSS, and shared JavaScript is valid and consistent across applicationsPrepare and maintain all applications utilizing standard development toolsUtilize backend data services and contribute to increase existing data services APIConvey effectively with all task progress, evaluations, suggestions, schedules along with technical and process issuesDocument the development process, architecture, and standard componentsKeep abreast of new trends and best practices in web developmentAPPLY NOW", "Page_URL": "https://merojob.com/laravel-developer-52/"}, {"name": "Quality Assurance Automation", "company": "AlphaBetaTheta Technologies", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Butwal", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)", "education": "Bachelor", "skills": "DebuggingQa AutomationCoding Skills", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:ButwalKathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(3 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:DebuggingQa AutomationCoding SkillsOther SpecificationHands-on professional development experience on testing API, Database and UIExperience with automation testing tools (selenium is preferred)Attention to detailExperience with version control system like gitExcellent research and debugging skillsAbility to work independently as well as with a team to analyze business requirements and develop solutionsClean coding skillsJob DescriptionWe are a growing team and we are seeking to hire a Quality Analyst to join our team. We are a motivated team of individuals handling diverse projects. If perfectionism is your style and finding bugs excites you, this is a great place for you!Gather and understand user requirementsCollaborate with team members to complete the assigned task.Write meaningful test cases with acceptance criteriaCreate a test planSeparate tests into automation and manual testsProduce high-quality automation scripts with a well-structured and organized codeFollow existing framework and suggest new ideas on the automation processProperly communicate databases migrations and schema when going to productionClearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challengesAPPLY NOW", "Page_URL": "https://merojob.com/quality-assurance-automation/"}, {"name": "Software Engineer (.net)", "company": "Tech One Global", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 23:55\n(2 days, 14 hours from now)", "education": "Bachelor", "skills": "JavascriptCssMs-SqlAngularjs.Net", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software Engineer, Software Architect, Technical Lead (Software)Job Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:JavascriptCssMs-SqlAngularjs.NetOther Specification1-2 years of experience with .NET, C#,ASP.NET(Webforms & MVC), and MS-SQLExperience with Visual Studio 2010/2013 or laterExperience with JavaScript, JQuery, AngularJS, CSSMust be able to work at a fast pace, independently and with a team, to  develop  new  applications  and  solve  issues  with  existing applicationsMust have familiarity with SQL Server stored procedures and user defined functions; MS SQL 2008/2012 or laterExperience in SharePoint development will be highly consideredMicrosoft certifications as a solution developer (MCP, MCSD etc.) will be an added advantageStrong SQL knowledge will be an added advantageHe / She should be a strong team player who can work with dynamic  global  team  to  cater  cutting  edge  solutions  to  our Enterprise client across the regionJob DescriptionWeb Application development and IntegrationActively participate in product design reviews by providing creative and practical ideas and solutions in a teamwork environmentIf you are confident that you are ready work with a challenging & winning global team, apply today.Applying Procedure:Interested candidates are requested to send their updated CV at[email protected]or call us at977-9802311210OR,APPLY NOW", "Page_URL": "https://merojob.com/software-engineer-net-13/"}, {"name": "Sr. Frontend Engineer", "company": "Javra Software", "level": "Senior Level", "vacancy": "2", "time": "Contract", "address": "Kumaripati, Lalitpur", "salary": "Negotiable", "deadline": "Nov. 17, 2020 12:30\n(6 days, 2 hours from now)", "education": "Bachelor", "skills": "AnalyticalCommunicationCss3Html5JavascriptCritical Thinking", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:ContractJob Location:Kumaripati, LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 12:30\n(6 days, 2 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than 6 yearsProfessional Skill Required:AnalyticalCommunicationCss3Html5JavascriptCritical ThinkingJob DescriptionApplication development using HTML5, CSS3, and\nJavascript;Data collection\nand integration with AJAX, JSON and XMLComfortable working with web standards, CSS\nbased design and cross-browser compatibility, providing performant and\noptimized products/application.Comfortable with\nobject oriented programming methodologies.Responsible for\nmeeting expectations and deliverables on time and in high quality.Communicates and provide support to project\nteam.Adhere to and help develop best practices.Solid understanding of client deliverables,\nand the ability to take responsibility for them.Deadline-oriented with the ability to\nprioritize multiple projects.Demonstrates\ncreative, technical and analytical skills.Taking part in the preliminary planning of the\napplications.Advising the executive as required constructing\nthe application.Extremely fluent with HTML5, CSS3, and\nJavascript.Working knowledge of SASS/LESS/PostCSS.Strong exposure to frameworks/tools/ecosystems,\nsuch as ReactJS(preferred), jQuery, VueJS, Angular/AngularJS, Grunt/Gulp/Webpack(preferred)\nand have good understanding across the full client-server stack.You will have experience with Agile\nengineering practices.You have worked with both UX/UI developments/design.Troubleshooting experience with advanced HTML5\nand CSS3 applicationAPPLY NOW", "Page_URL": "https://merojob.com/sr-frontend-engineer-2/"}, {"name": "Senior System Administrator", "company": "New IT Venture", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Basbari Kathmandu near Thai embassy", "salary": "Negotiable", "deadline": "Dec. 04, 2020 23:55\n(3 weeks, 2 days from now)", "education": "Bachelor", "skills": "Problem SolvingTeamworkTechnicalAnalytical", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Basbari Kathmandu near Thai embassyOffered Salary:NegotiableApply Before(Deadline):Dec. 04, 2020 23:55\n(3 weeks, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Problem SolvingTeamworkTechnicalAnalyticalOther SpecificationTechnical Requirements:Dynamic, energetic and goal-focused individual with a minimum of 1/2 years of relevant and progressive work experience in Software Development, DevOps and System AdministrationExperienced in CentOS and Ubuntu Linux server administration (Web (Nginx, Apache and Tomcat)/Database/Mail/DNS/Monitoring services)Basic Programming skills on PHP, Java, Python and Popular Scripting languages.Analyze current technology utilized within the company and develop steps and processes to improve and expand upon themDesign and implement build, deployment, and configuration managementBuild and test automation tools for infrastructure provisioningExperience in DevOps tools and Cloud Infrastructure like Docker, Jenkins, GIT, Kubernetes, Ansible, Nagios, AWS TechnologyManage CI and CD tools with teamDocument and design various processes; update existing processesExperience/Knowledge on Live Video Streaming technologies would be considered a meritPreference will be given to the candidate with certification in Linux System Administration / AWS / DevOpsJob DescriptionRoles and Responsibilities:Support development team by performing tasks such as planning, deployment, monitoring, and maintaining local and production infrastructure utilizing a mixture of on premise and cloud systemsPlan, deploy and maintain Media Head-end server, media streams as well as CDN (Content Delivery Network) infrastructure for New IT Venture Corporation.APPLY NOW", "Page_URL": "https://merojob.com/senior-system-administrator-7/"}, {"name": "Java Developer- Full Stack", "company": "SB Solutions Pvt. Ltd.", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 13, 2020 18:00\n(2 days, 8 hours from now)", "education": "Bachelor", "skills": "JavascriptTeamworkCommunicationUi/UxWeb Development", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 13, 2020 18:00\n(2 days, 8 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptTeamworkCommunicationUi/UxWeb DevelopmentJob DescriptionMust\nHave SkillsAt least 2 years of experience in Software development\nusing J2SE and J2EE.Experience in parallel and multithreaded programming.Interest\nin achieving maximum performance from available hardware and software.Familiar\nwith design patterns.UI\nDevelopment Skills (JavaFx, JavaScript, CSS, HTML, jQuery)Hands on\nknowledge on Spring Framework.Strong\nknowledge of Relational Databases, SQL, and ORM technologiesExperience\nworking with source control systems, such as Subversion, and GIT including\nbranching and merging strategies.Preferable\nSkillsHands on\nknowledge on Apache Framework.Knowledge\nof testing frameworks/methodologies.Understanding\nof XML, JSON, web services technologiesExperience\nof tools like (Gitlab, Github, Jira)Experience\nin Continuous Integration leveraging tools such as Maven.Soft\nSkillsAbility to\nwork independently or as part of a teamExperience\nof working in SCRUM/Agile team would be added valueDesire and\nability to continuously improve, discover and expand the limitsCritical thinking\nhas an opinion on various technological topics.Benefits\n& Coverage:Competitive\npay for deserving candidateMedical\nCoverage & AllowanceProvident\nfundFestival\nAllowance&\nBonus, Performance Bonus, Referral BonusVibrant\nteamTeam\noutingsEvents\ncelebrationsTraining\nand DevelopmentRegular\nsalary revision based on performanceFrequent\nteam building activitiesJoining:ImidiatelyNote:Only\nshortlisted candidates will be contacted for the interviewFreshers\nare discouraged to applyNon-Java\ndevelopers with good programming background and willing to switch to Java\ncan also applyInterested and enthusiast candidates are encouraged to apply through Online Or may drop your C.V and Cover letter at[email protected].APPLY NOW", "Page_URL": "https://merojob.com/java-developer-ful-stack/"}, {"name": "Senior Software Engineer", "company": "Logpoint Nepal", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)", "education": "Bachelor", "skills": "JavaPython", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavaPythonJob DescriptionWe are looking for highly motivated individuals for the position of Senior Software Engineer who are looking to grow their career in fast paced environment. You will be developing information systems by studying operations; designing, developing and installing software solutions; support and develop software team. The Senior Software Engineer will lead a team of developers responsible for building new and support existing applications.You must possess ability to prioritize tasks, communicate clearly, have a consistent track record of delivery and excellent software engineering skills. You need to be creative engineering balanced with high quality and a customer focus. Must be able to work across multiple facets of the project and juggle multiple responsibilities at the same time. Strong analytical capability and the ability to create innovative solutions is highly required to perform the responsibility.RequirementsBachelor's Degree/Master's degree in Computer Science is preferred.Fluent with imperative and object-­oriented languages knowledge of Java, Python with sound knowledge of the JVM and the ecosystem of supporting tools inside and outORFull stack development skills with a very good command over JavaScript language & Python and frameworks like Node JS/ React JSExperience working in an agile environmentExperience building complex web systems and applicationsFocused on performance and good knowledge on design patternsExperience implementing and consuming large scale web servicesEagerness and willingness to learn new technologiesKey ResponsibilitiesDevelop software solutions by studying information needs; conferring with users; studying systems flow, data usage and work processes; investigating problem areas; following the software development life-cycle.Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions.Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks;Mentor junior and mid-level engineers.Collaborate with team to brainstorm and create new products.Make informed decisions quickly and taking ownership of services and applications at scale.Work collaboratively with others to achieve goals.Be a persistent, creative problem ­solver.Remain cool and effective in a crisis.Stay on the leading edge of development practices.Passionate about technologies, especially open source.Understand business needs and know how to create the tools to manage them.BenefitsAttractive salary based on experience and qualifications.Gratuity and provident fund schemes.Working in a team environment where initiative and dedication is encouraged.An equal opportunity workplace that values diversity and does not discriminate.High level of responsibility and excellent career possibilities.Open international work environment.Festival expense allowance.Lunch and SnacksFitness PerkMedical and accident insurance.Applying ProcedureInterested Candidates must apply for the relevant job with cover letter and detailed CV. Applications should be submitted directly throughhttps://logpoint.bamboohr.com/jobs/view.php?id=7&source=otherNote that for your application to be taken into consideration you must apply through the relevant link on the Log point careers website.Deadline for applying is5thDecember.Only candidates under serious consideration for a vacant position will be contacted for the selection.", "Page_URL": "https://merojob.com/senior-software-engineer-44/"}, {"name": "PreSales Engineer (Associate/Mid Level)", "company": "Logpoint Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)", "education": "Bachelor", "skills": "LinuxTime ManagementMultitaskingCommunicationFirewall", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(3 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:LinuxTime ManagementMultitaskingCommunicationFirewallJob DescriptionFor our Presales team, we are looking for outstanding engineers to play a key role in demonstrating capabilities of our SIEM, designing and deploying solutions to best fit customer’s requirement. A big part of the job is understanding customer needs, product demo, POCs, trainings, use case designs and implementation.You will be part of the 150+ Engineering Team which consists of Engineering Managers, Security Analysts, Architects, Support Engineers, DevOps, SecOps, QA and Software Engineers collaborating on the different components of the system, therefore, we are actively seeking individuals who can work efficiently on their own, but also take an active role of something bigger and meet expectations from other teams and colleagues.As we are in the cybersecurity domain, information security is prime objective of our solution, so if you know what ISMS means and take pride as a security analyst, we invite you to apply for this position.Job title depends on the experience of the applicants.RequirementsA good grasp of current technologies, network protocols, operating systems and network/information securityGood knowledge of Microsoft Windows server infrastructure, Firewall, Linux servers and cloud technologiesGood command over English and excellent communication skillsOpen minded, learner, adapter, self-organizerPast experience in security positions or customer facing role is a plusPast experience working with SIEM is a plusKnowledge of script and programming languages such as Python, Java or Power Shell is an advantage,Open to travel every now and thenPreSales Engineer is a professional who will be responsible to support and work with the direction of the Lead Architect and other related stakeholders by providing services related to software development.Following are the major job responsibilities:Drive customer engagements in an effort to achieve a technical winManage technical relationship of existing customers to ensure customer satisfaction and renewalsPartner with sales executives to plan, prepare and execute on strategic deals in complex sales cyclesSupport sales executives with solution selling into prospect account baseSuccessfully match customer pain/requirements to proposed solutionsCreate and deliver powerful presentations and demos that clearly communicate the uniqueness of the value propositionManage all technical aspects of RFP / RFI responsesEffectively communicate client needs to the R&D teams for future product enhancementsCollect and document competitive intelligenceIndependently manage the implementation of LogPoint from requirement collection, solution design, implementation, validation and verification.Conduct LogPoint trainings and knowledge transfer sessions across all product linesBenefitsAttractive salary based on experience and qualifications.Gratuity and provident fund schemes.Working in a team environment where initiative and dedication is encouraged.An equal opportunity workplace that values diversity and does not discriminate.High level of responsibility and excellent career possibilities.Open international work environment.Festival expense allowance.Lunch and SnacksFitness PerkMedical and accident insurance.Applying ProcedureInterested Candidates must apply for the relevant job with cover letter and detailed CV. Applications should be submitted directly throughhttps://logpoint.bamboohr.com/jobs/view.php?id=18&source=otherNote that for your application to be taken into consideration you must apply through the relevant link on the Log point careers website.Deadline for applying is5thDecember.Only candidates under serious consideration for a vacant position will be contacted for the selection.", "Page_URL": "https://merojob.com/presales-engineer-associatemid-level/"}, {"name": "IOS Developer -Objective C", "company": "Four Pix Solutions", "level": "Mid Level", "vacancy": "2", "time": "Full Time ,\nPart Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 20, 2020 23:55\n(1 week, 2 days from now)", "education": "Bachelor", "skills": "Objective - CIos", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full Time ,\nPart TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 20, 2020 23:55\n(1 week, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Objective - CIosOther SpecificationBachelors in Computer Engineering/Computer Science or relatedAt least 1 year experience in Objective-C & iOS applicationsProficient with Objective-C & testingFamiliarity with RESTful APIsExperience in IOS is compulsoryFamiliarity with code versioning tools {{such as Git, SVN}}Job DescriptionWrite code in Objective-CCollaborate closely with the development team to design and launch new featuresTest and troubleshoot the applicationUtilize test-driven development practices for the codes generatedSuggest and improve the functionality of the existing systemUtilize best practices with the technologies to ensure effective and efficient processing of tasksAPPLY NOW", "Page_URL": "https://merojob.com/ios-developer-objective-c/"}, {"name": "Microsoft Dynamics 365 /Power Platform Developer", "company": "Agile Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Gairidhara, Kathmandu", "salary": "Negotiable", "deadline": "Dec. 07, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Project ManagementMicrosoft Dynamics 365 Crm And Pow…Sql Server", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Gairidhara, KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 07, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsAge:More than 18 yearsProfessional Skill Required:Project ManagementMicrosoft Dynamics 365 Crm And Pow…Sql ServerOther SpecificationStrong written communications\nespecially related to articulating technical specificationsExperience\nin customizations, JavaScript, C#, .NET, HTML, SQL Server, SSRS including\nplugins, scripting, and form creationExperience\nwith CRM API, REST/ODATA, and SOAP endpointsStrong\nunderstanding of and ability to configure security groups, roles, and\nteamsThe high degree of insight and\nanalytical skillTeam-oriented; willing to align work\nwith team’s priorities and goalsKnowledge\nof the O365 platform as it pertains to feature sets that integrate with\nDynamics CRM solutions including SharePoint and OneDrive/OneNoteFamiliarity\nwith Data Export Service and Azure SQLSSIS\nor other ETL technologiesExperience\nworking with consulting services industry or salesforce automation/project\nservice automation solutionsMicrosoft\nCertificationJob DescriptionResponsible for software\nconfiguration, documentation, implementation, training, and support of Microsoft\nDynamics 365 CRMArchitecting the CRM system, related\ncustomizations, and reports to model the business’ organizational processSupport existing client base with\nsupport issues that ariseAnalyze existing processes and\ndevelop recommendations to improve client performanceMeet deliverable targets and\ncomplete project tasks within budget and to clients’ satisfactionBuilding and configuring CRM forms,\nviews, dashboards, and workflowsDeveloping PowerBI / SSRS reports\nusing Microsoft SQL and FetchXMLIdentify assignment conflicts and\nissues and communicate to Project ManagerBuild positive client relationships\nwhile developing an understanding of customers’ businessesAssist in the integration of\napplication componentsClose cooperation with client teams\nand follow up business requirementIntegrate existing systems and\nservices into the CRM architectureAPPLY NOW", "Page_URL": "https://merojob.com/microsoft-dynamics-365-power-platform-developer/"}, {"name": "Full stack PHP Developer", "company": "MiDas Technologies", "level": "Mid Level", "vacancy": "10", "time": "Full Time", "address": "Thapathali, Kathmandu, Nepal", "salary": "NRs. 50,000.00 - 70,000.00 Monthly", "deadline": "Nov. 16, 2020 23:55\n(5 days, 14 hours from now)", "education": "Bachelor", "skills": "Problem SolvingTime ManagementLogical ThinkingMultitaskingWeb Development", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[10]Employment Type:Full TimeJob Location:Thapathali, Kathmandu, NepalOffered Salary:NRs. 50,000.00 - 70,000.00 MonthlyApply Before(Deadline):Nov. 16, 2020 23:55\n(5 days, 14 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Problem SolvingTime ManagementLogical ThinkingMultitaskingWeb DevelopmentOther SpecificationAnalytical and problem-solving skillsThe capacity to work well within a teamAttention to detailLogical thinkingInterpersonal skills as you will regularly be in contact with colleagues and/or customersThe ability to prioritize your workloadThe capacity to clearly explain a technical problem to a customer/colleagueExperience and Capabilities on Restful API programmingExpertise in web framework (CI is preferable)Must have hands-on working experiences on Core PHP / CodeIgniter / LaravelGood Knowledge of PHP5 or above, MySQL, PostgreSQL  jQuery, JavaScript, HTML5, CSS3, XMLKnowledge of Jquery, BootStrap and JSONGood debugging skillsCore PHP / CodeIgniter (or any MVC based programs with willingness to learn and work with CodeIgniter)Expert in SQLJob DescriptionAssure that all user input is validated before submitting to back-endGood understanding of asynchronous request handling, partial page updates, and AJAX is mostPrior experience in the payment gateway or education ERP domain is a plusWork collaboratively with other internal and external developers in a multi-dev environmentModify existing functionality of PHP-based codeAPPLY NOW", "Page_URL": "https://merojob.com/full-stack-php-developer-3/"}, {"name": "SEO Specialist", "company": "HLE Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Jawalakhel,Lalitpur", "salary": "Negotiable", "deadline": "Nov. 30, 2020 23:55\n(2 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptCssHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Jawalakhel,LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 23:55\n(2 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavascriptCssHtmlOther SpecificationQualification andExperience:BS/MS degree in a quantitative, test-driven field3+ years as SEO SpecialistSkills:Proven SEO experienceSolid understanding of performance marketing,conversion, and online customer acquisitionSolid experience with website analytic tools (e.g, Google Analytics, SEMRush etc)Experience with A/B and multivariate experimentsWorking knowledge of HTML, CSS, and JavaScript development and constraintsKnowledge of ranking factors and search engine algorithmsUp-to-date with the latest trends and best practices in SEOAdvanced written and verbal communication skills.Able to training othersAdvanced Google doc skillsAble to work with minimum supervisionAbility to work under pressureDriven and a strong desire to learnTeam playerQualification:Google Fundamentals of Digital MarketingJob DescriptionExecute tests, collect and analyze data and results, identify trends and insights in order to achieve maximum ROI in organic trafficSupport PPC initiatives and campaignsWork with the content team to optimize copy and landing pages for search engine marketingPerform ongoing keyword discovery, expansion and optimizationResearch and implement search engine optimization recommendationsResearch and analyze competitor strategiesDevelop and implement link building strategyWork with the development team to ensure SEO best practices are properly implemented on newly developed codeWork with editorial and marketing teams to drive SEO in content creation and content programmingRecommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords.Document content SEO processes and propose innovative improvements.Ensure team activities are aligned with project objectives and stakeholders expectations.Provide regular updates to key stakeholders.Any other relevant duties as required from time to time.The Benefits of Joining Us:Get to work with one of our top outsourcing partnersA secure long-term rolePaid annual leave and sick leavePaid maternal and parental leavesA 5-day work week except for 1 Sunday of the monthAn environment that values continuous learning and developmentOffice-sponsored daily breakfasts and other benefitsRecreation room to unwind and chill!Parties and events – we want you to have some fun at work!Accident and health insurance for you and your two family membersOffice sponsored 'Employee Assistance Program'Work Hours:8:00 am to 4:00 pm including 1-hour lunch breakApplying Procedure:Sounds like an opportunity for you? Send us your resume and cover letter to[email protected]with the subject line \"Career:SEO Specialist\", addressing all the essential requirements.Visithlenepal.com.npandhomeloanexperts.com.auto know more about us!Due to the high volume of applications received, we regret that only short-listed candidates will be contacted. Also note that we are working from home currently due to the Covid-19 lockdown, and will continue to do so in the coming months.OR,APPLY NOW", "Page_URL": "https://merojob.com/seo-specialist-45/"}, {"name": "IT Specialist", "company": "S.B.T International", "level": "Mid Level", "vacancy": "1", "time": "Part Time", "address": "Teku, Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalReportingCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Part TimeJob Location:Teku, KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsAge:More than 30 yearsProfessional Skill Required:Problem SolvingAnalyticalReportingCommunicationOther SpecificationDegree in computer science or related field is preferableMore than 3 years of experienceStrong analytical, diagnostic, and problem-solving skillsGood communication ability, both written and verbalPersonable, professional demeanorTechnical understandingProcess improvementData processingReporting research resultsNetworking knowledgePresenting technical informationOperating systemsDocumentation skillsJob DescriptionInstalling\nnew software and hardware componentsRegularly\nevaluating our IT systems to ensure they meet the necessary demandsAssisting\nwith network administration tasksEnsuring\ndata storage is safe and secureResolving\nall issues coworkers have with their IT systems and softwareEducating\ncoworkers about network security and best practices for computer usageSupporting\nthe day-to-day operations of our computer networkMaintaining\nthe surveillance systemsMaintaining the company’s serversCandidates fulfilling the criteria mentioned above may send in their complete‘Curriculum Vitae (CV)to the email address mentioning thepositionyou are applying for.Email:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/it-specialist-10/"}, {"name": "Angular Developer", "company": "Palmmind IT", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Pulchowk", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "Css3HtmlNode.Js", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:PulchowkOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Css3HtmlNode.JsOther SpecificationStrong Knowledge of Angular FrameworkWork as a part of an Agile teamBuild and maintain JS based code baseStrong knowledge of NodeJSGood problem-solving skillsStrong knowledge of developing and utilizing APIsJob DescriptionYou love working in an environment that provides\nsignificant opportunities for learning and growth. You don't just want\nto code, you want to solve real customer problems. You love working with\ncutting-edge technologies.Are you looking for the next big career\nmove ?Integration of user-facing elements developed by a backend developerFocus on coding and debugging and build high-quality reusable codeConduct UI tests and optimize performanceExperience with code merging and branching methodologies using GitOptimization of the application for maximum speed and scalabilityDefine and communicate technical and design requirementsBe involved and participate in the overall application lifecycleParticipate in conferences and educational programsFollow new and emerging technologiesShould be able to work with an existing project with little or no supervisionOther duties as per assigned by line managerAPPLY NOW", "Page_URL": "https://merojob.com/angular-developer-15/"}, {"name": "Front End Developer", "company": "Sharelook PTE LTD", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 35,000.00 - 70,000.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "HtmlJavascriptCssReact Native", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 35,000.00 - 70,000.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:HtmlJavascriptCssReact NativeOther Specification3+ years of experience in software development with a proven track record of technical developmentStrong working experience with ReactJS and its core principlesExperience working with back-end RESTful APIsExperience with HTML, CSS and JavaScript librariesKnowledge in AWS services, Cognito AWS amplify is a plusExperience with React Native is a big advantageGood communication in EnglishJob DescriptionWe are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.Front End Developers are required to work in teams alongside Back end Developers, Graphic Designers and User Experience Designers to ensure all elements of web creation are consistent. This requires excellent communication and interpersonal skills.Responsibilities:Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future useAPPLY NOW", "Page_URL": "https://merojob.com/front-end-developer-100/"}, {"name": "Android Native Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "InterpersonalAndroidNativeCommunicationKotlin", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Mobile AppsJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:InterpersonalAndroidNativeCommunicationKotlinOther SpecificationMinimum 2 years experience of Reactive / RxJava / Kotlin - Native, Knowledge of Flutter will have additional benefitGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNMust have hands on experience on multi threading architectureGood knowledge on RESTFUL API, JSON, HTML, CSS, Javascript, API, XMLGood Knowledge of Android Architecture Component (Live Data , View Model , Room, etc)Must be able to work with third party SDKShould have knowledge of Payment Gateway IntegrationKnowledge of Local Notification and Remote Push NotificationShould have brief knowledge of Android UI design guidelinesExcellent knowledge of offline storageExperience with writing clean and well-documented codeStrong communication skillAbility to perform as part of a team as well as individuallyAnalytical, positive and solution-oriented approach to problemsMust be able to work within provided deadlineJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/android-native-developer-2/"}, {"name": "React Js Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupandole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "Css3JavascriptHtml", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupandoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Css3JavascriptHtmlOther SpecificationMinimum 1 years experience in React JsThorough understanding of React.js and its core principlesExperience in user interface development including HTML, CSS, JavaScript.Experience in Asynchronous programmingGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNUnderstanding of functional components and hooksHave successfully completed at least 2 projectsJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/react-js-developer-3/"}, {"name": "iOS Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "TddGitCommunicationIos", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Mobile AppsJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TddGitCommunicationIosOther SpecificationMinimum 2 years experience of Objective-C or SwiftExperience with offline storage, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apple’s design principles and interface guidelinesKnowledge of low-level C-based libraries is preferredExperience with performance and memory tuning with toolsFamiliarity with cloud message APIs and push notificationsExcellent knowledge of offline storageExperience with writing clean and well-documented codeStrong communication skillGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/ios-developer-105/"}, {"name": "Laravel Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "JavascriptTeamworkHtmlMysql", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptTeamworkHtmlMysqlOther SpecificationMinimum 2 years experience of web development (PHP Laravel,JavaScript, (X)HTML, AJAX, CSS, etc.)Good knowledge of relational databases, version control tools and of developing web services, Familiarity with tools such as Git, SVNAbility to understand CSS/JavaScriptchanges to have consistent style/impact across platforms and browsersExperience with writing clean and well-documented codeComfortable working with debugging tools like Firebug, Chrome inspector etc. Basically strong troubleshooting skillsGood knowledge on RESTFUL API, JSON, HTML, CSS,JavaScript, API, XMLStrong knowledge of MySQL and proficient in writing SQL queriesStrong communication skillAbility to perform as part of a team as well as individuallyAnalytical, positive and solution-oriented approach to problemsGood Knowledge of web Based Application/Website ArchitectureShould be able to work in teamJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/laravel-developer-54/"}, {"name": "Quality Analyst (Mid)", "company": "Sage Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 13 hours from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalTeamworkCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Problem SolvingAnalyticalTeamworkCommunicationJob DescriptionRequirements that we need you to have:Mid QA Engineer candidates should have 2+ years' experience in automating or extending test  frameworksMid QA Engineer should have 2+ years of coding experience with standard Object Oriented languages like  Java (Preferred)Experience with enterprise-level applicationKnowledge and understanding of Business Domain (preference on Security Software or SIEM)Familiarity and/or programming experience with Python, Java and web-based technologiesBasic SQL and data skillsUnderstanding of configuration issues related to software development; UNIX experience preferredExperience maintaining test environments, automated testing tools, and other resources in support of the  SQA processStrong written and verbal communication skillsTeam player with strong analytical, problem-solving, and communication skillsAbility to work under tight deadlinesBe curious about how things work and love breaking thingsBe passionate about technology trends and all things related to testingBe excited about automation and building tools to help do your job and help the rest of the teamYou'd be a perfect fit if:Business Domain Knowledge – Insurance/Finance (Preferably Insurance).Performance Testing, API testing, and Automation SkillsBenefits that you’ll get:A beefy laptop for developmentOnline courses or training as requiredCompensation for taking part in ConferencesProvident fund, gratuity, insurance and moreThe part that might grab your interest:If you believe you tick all the right boxes in the requirements, we promise to provide them with the best benefits  package which includes:Attractive salary packageWeekends off (Saturday –Sunday)Experience of working in a US-based corporateAmazing opportunity for career advancementGuidance and nurture by industry expertsFun, engaging and ever-growing work environmentWhat your responsibilities at SAGE Nepal be like:Perform software quality assurance, including black-box testing, white box testing, user acceptance  testing, and maintenance regression testingAutomate tests using available and open-source tools and technologies.Understand and Code in standard Object-Oriented languages like Java and Scripting languages like  JavaScript, ShellLearn and employ automation tools like SeleniumEvaluate testing- and inspection plans for projects of varying technology, complexity, and sizeDevelop and document test scripts, test cases, defect tracking and reports Create and maintain manual and/or automated test scripts, test data, and other deliverables related to  the software quality assurance (SQA) processReview log files and other run-time documentation for defects and issuesAnalyze the results of software tests and provide results for use in development code inspections and  group reviews of project deliverablesDetect, document, and track system defects throughout the SQA processUnder the direction of product management, participate in user acceptance testingPerform maintenance regression testingWork with development teams to support and implement  applicationsSupport in organizational process & management.Support in software process (QA, Dev, configuration, management, project mgmt, etc.)Support in planning, designing & implementation of the software QA process.Participate in extracurricular organizational activities.Other duties as assignedApplying ProcedureDo you enjoy working in your own zone or love to travel and work?Do you have what it takes to be a part of the fastest growing team of Tech professionals in India/ Nepal?Covered by SAGE’s dev team is on the lookout for remarkable talents who excel at the use of React and has the  benchmarking coding performance. We want the finest developers who are swift on using Scrum and have an  exceptional understanding of JavaScript, HTML, and CSS, who desire to have the professional experience of  working for an international market and enhance their knowledge beyond horizons.If yes!, then send out your updated CV at[email protected]along with the Subject line “Covered by Sage- Quality Analyst-Mid.” as per your experience.Nepal HR contact detail:+977 9828555749/ +977 9841391786Note: Only mailed applications will be taken into consideration.", "Page_URL": "https://merojob.com/quality-assurance-16/"}, {"name": "Quality Analyst (Sr.)", "company": "Sage Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 13 hours from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalTeamworkCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 4 yearsProfessional Skill Required:Problem SolvingAnalyticalTeamworkCommunicationJob DescriptionRequirements that we need you to have:Sr. QA Engineer candidates should have 4+ years' experience in automating or extending test  frameworksSr. QA Engineer should have 4+ years of coding experience with standard Object Oriented  languages like Java (Preferred)Experience with enterprise-level applicationKnowledge and understanding of Business Domain (preference on Security Software or SIEM)Familiarity and/or programming experience with Python, Java and web-based technologiesBasic SQL and data skillsUnderstanding of configuration issues related to software development; UNIX experience  preferredExperience maintaining test environments, automated testing tools, and other resources in  support of the SQA processStrong written and verbal communication skillsTeam player with strong analytical, problem-solving, and communication skillsAbility to work under tight deadlinesBe curious about how things work and love breaking thingsBe passionate about technology trends and all things related to testingBe excited about automation and building tools to help do your job and help the rest of the  teamYou'd be a perfect fit if:Business Domain Knowledge – Insurance/Finance (Preferably Insurance).Performance Testing, API testing, and Automation SkillsBenefits that you’ll get:Online courses or training as requiredCompensation for taking part in ConferencesMedical insurance and moreThe part that might grab your interest:If you believe you tick all the right boxes in the requirements, we promise to provide them with the best  benefits package which includes:Attractive salary packageWeekends off (Saturday –Sunday)Experience of working in a US-based corporateAmazing opportunity for career advancementGuidance and nurture by industry expertsFun, engaging and ever-growing work environmentWhat your responsibilities at SAGE Nepal be like:Perform software quality assurance, including black-box testing, white box testing, user  acceptance testing, and maintenance regression testingAutomate tests using available and open-source tools and technologies.Understand and Code in standard Object-Oriented languages like Java and Scripting languages  like JavaScript, ShellLearn and employ automation tools like SeleniumEvaluate testing- and inspection plans for projects of varying technology, complexity, and sizeDevelop and document test scripts, test cases, defect tracking and reports Create and maintain manual and/or automated test scripts, test data, and other deliverables  related to the software quality assurance (SQA) processReview log files and other run-time documentation for defects and issuesAnalyze the results of software tests and provide results for use in development code  inspections and group reviews of project deliverablesDetect, document, and track system defects throughout the SQA processUnder the direction of product management, participate in user acceptance testingPerform maintenance regression testingWork with development teams to support and  implement applicationsSupport in organizational process & management.Support in software process (QA, Dev, configuration, management, project mgmt, etc.)Support in planning, designing & implementation of the software QA process.Participate in extracurricular organizational activities.Other duties as assignedApplying ProcedureDo you enjoy working in your own zone or love to travel and work?Do you have what it takes to be a part of the fastest growing team of Tech professionals in India/ Nepal?Covered by SAGE’s dev team is on the lookout for remarkable talents who excel at the use of React and has the benchmarking coding performance. We want the finest developers who are swift on using Scrum and have an exceptional understanding of JavaScript, HTML, and CSS, who desire to have the professional experience of working for an international market and enhance their knowledge beyond horizons.If yes!, then send out your updated CV at[email protected]along with the Subject line “Covered by Sage-Quality Analyst- Sr.” as per your experience.Nepal HR contact detail:+977 9828555749/ +977 9841391786Note:Only mailed applications will be taken into consideration.", "Page_URL": "https://merojob.com/qa-sr/"}, {"name": "Backend Developer- Mid. /Sr.", "company": "Sage Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 17, 2020 23:55\n(6 days, 13 hours from now)", "education": "Bachelor", "skills": "Problem SolvingOrganizationalTeamworkCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 17, 2020 23:55\n(6 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Problem SolvingOrganizationalTeamworkCommunicationJob DescriptionRequirements that we need you to have:5 to 7 Years of experience into Product Development projects for Mid role8 to 10 Years of experience into Product Development projects for Senior roleAdept with Project Planning, Defining Technology Stack, SDLC management and TestingCandidates from Product Development companies are preferred but not mandatoryShould be adept with Agile development model and should be willing to work with a rapid development model with a Start-up organizationAttention to details and problem-solving skills with strong leadership capabilities and business acumen.Strong Organizational and Planning Skills and ability to handle change managementFlexible and ability to adapt to a rapidly changing environmentCrisis handling and risk mitigation skillsHave lead a team of more than 6 people for min 2 yearsYou'd be perfect fit if:Good understanding of CI/CD pipeline and tools like Jenkins.Experience in writing Python and Bash script if needed.Benefits that you’ll get:A beefy laptop for developmentOnline courses or training as requiredCompensation for taking part in ConferencesThe part that might grab your interest:If you believe you tick all the right boxes in the requirements, we promise to provide them with the bestbenefits package which includes:Attractive salary packageWeekends off (Saturday –Sunday)Experience of working in a US-based corporateAmazing opportunity for career advancementGuidance and nurture by industry expertsFun, engaging and ever-growing work environmentWhat your responsibilities at Covered by Sage be like:Proficient in Java and OOP, with a good knowledge of its ecosystemsExperience with the Spring Boot framework.The familiarity of microservice architecture and Spring Cloud.Good knowledge of Spring Admin, Eureka, Zuul, Zipkins, and all other cloud tools.Handful experience with No-SQL, especially MongoDB and Elastic Search.Familiar with various design and architectural patternsSkill for writing reusable Java librariesFamiliarity with concepts of MVC, JDBC, and RESTfulExperience with both external and embedded databasesUnderstanding fundamental design principles behind a scalable applicationCreating database schemas that represent and support business processesBasic understanding of JVM, its limitations, weaknesses, and workaroundsImplementing automated testing platforms and unit testsProficient understanding of code versioning tools, such as GitFamiliarity with build tools such as Ant, Maven, and GradleFamiliarity with continuous integrationWe have no dearth of Hard Technical Problems, come work with us in a high-growth startup culture,where your growth is defined by your performance.Location: Remote or any of our locations in India & Nepal.Applying ProcedureDo you enjoy working in your own zone or love to travel and work?Do you have what it takes to be a part of the fastest growing team of Tech professionals in India/ Nepal?Covered by SAGE’s dev team is on the lookout for remarkable talents who excel at the use of React and has the benchmarking coding performance. We want the finest developers who are swift on using Scrum and have an exceptional understanding of JavaScript, HTML, and CSS, who desire to have the professional experience of working for an international market and enhance their knowledge beyond horizons.If yes!, then send out your updated CV with recent GitHub ID at[email protected]along with the Subject line “Covered by Sage- Back-End Developer- Sr./Mid.”as per your experience.Nepal HR contact detail:+977 9828555749/ +977 9841391786Note:Only mailed applications will be taken into consideration.", "Page_URL": "https://merojob.com/backend-developer-mid-sr/"}, {"name": "Software Developer", "company": "INFICARE", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)", "education": "Bachelor", "skills": "Microsoft Sql ServerAsp.NetCommunicationClassic Asp", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(4 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Microsoft Sql ServerAsp.NetCommunicationClassic AspOther SpecificationShould be at least Bachelor graduateMust have at least 1 years of experience in related fieldWorking experience in Web Applications is mustGood Knowledge of Microsoft SQL Server, Classic ASP,ASP.NETStrong Analytical, Problem Solving and Conceptual skillsAbility to handle pressure and meet tight deadlinesShould have excellent communication skill with fluent EnglishGood learning attitude and adaptive learning abilitiesJob DescriptionWork on different Web Base applicationsWork according to the given tasksCreates efficient and logical databasesDesigns and codes superior technical solutionsAnalyze requirements, create designs and architect solutions using formal methodsProducing code using .NET (C#)Work cooperatively in a project-focused development teamSoftware testingNote:We have facility of Work from Home during the time of LockdownApplying Procedure:Interested Candidates are requested to submit their updatedCVand aCoverletterthrough Email:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/software-developer-122/"}, {"name": "Senior WordPress Programmer", "company": "", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Dhobhighat, Jhamsikhel, Lalitpur", "salary": "Negotiable", "deadline": "Nov. 16, 2020 23:55\n(5 days, 13 hours from now)", "education": "Bachelor", "skills": "HtmlResponsive DesignCssWordpress", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Dhobhighat, Jhamsikhel, LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 16, 2020 23:55\n(5 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:HtmlResponsive DesignCssWordpressOther SpecificationShould have minimum 2+ years of professional work experience in WordPressExtensive knowledge and experience of building WordPress websitesShould have experience in WordPress theme and plugin developmentKnowledge of WordPress coding standard andbest practices for developing efficient and high-quality back-end systemKnowledge of responsive design/css is a plusjQuery, JavaScript, AJAX knowledge is importantGood knowledge of WooCommerceProficient understanding of code versioning tools (such as Git)Experience with building REST API services and integrating with 3rd party API servicesAdvanced proficiency in coding and applying effective techniquesHave a good understanding of Gutenberg, Blocks, Sage, WP Bakery, Elementor and premium themes.Experience in code review and optimisationJob DescriptionWe are looking for an experienced WordPress Developer to join our team.Responsibilities:Build and maintain simple to complex websites in WordPressPlanning and executing the development process efficientlyCommunicate effectively with team members and PM’s throughout the developmentDevelop and maintain WP plugins/themes and build custom solutions depending on the requirementsBenefits:Competitive Salary and benefitsLunch providedUnlimited Tea/Coffee and snacksRegular Team building eventsTeam partiesAPPLY NOW", "Page_URL": "https://merojob.com/senior-wordpress-programmer-10/"}, {"name": "AngularJS Developer", "company": "", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Baluwatar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 30, 2020 16:20\n(2 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptCssHtmlAngularExperience With Restful Services", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Baluwatar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 16:20\n(2 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than 2 yearsProfessional Skill Required:JavascriptCssHtmlAngularExperience With Restful ServicesJob DescriptionDelivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building RESTful APICommunicating with external web services.APPLY NOW", "Page_URL": "https://merojob.com/angularjs-developer-6/"}, {"name": "Website Developer", "company": "", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Tripureshwor", "salary": "Negotiable", "deadline": "Nov. 16, 2020 23:55\n(5 days, 13 hours from now)", "education": "Bachelor", "skills": "WritingEditingCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:TripureshworOffered Salary:NegotiableApply Before(Deadline):Nov. 16, 2020 23:55\n(5 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:WritingEditingCommunicationJob DescriptionWebsite and software application designing, building, or maintaining.Using scripting or authoring languages, management tools, content creation tools, applications and digital media.Conferring with teams to resolve conflicts, prioritize needs, develop content criteria, or choose solutions.Directing or performing Website updates.Developing or validating test routines and schedules to ensure that test cases mimic external interfaces and address all browser and device types.Editing, writing, or designing Website content, and directing team members who produce content.Maintaining an understanding of the latest Web applications and programming practices through education, study, and participation in conferences, workshops, and groups.Back up files from Web sites to local directories for recovery.Identifying problems uncovered by customer feedback and testing, and correcting or referring problems to appropriate personnel for correction.Determining user needs by analyzing technical requirements.APPLY NOW", "Page_URL": "https://merojob.com/website-developer-17/"}, {"name": "Digital Marketer", "company": "", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kupondol, lalitpur", "salary": "NRs. 10,000.00 - 15,000.00 Monthly", "deadline": "Nov. 13, 2020 23:55\n(2 days, 13 hours from now)", "education": "Bachelor", "skills": "", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Technical Sales/ IT MarketingJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kupondol, lalitpurOffered Salary:NRs. 10,000.00 - 15,000.00 MonthlyApply Before(Deadline):Nov. 13, 2020 23:55\n(2 days, 13 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than 1 yearOther SpecificationKnowledge of creative marketing strategies, concepts, and practices, project management and performance measurementSkill in problem-solving and metrics-driven thinking as well as effective communicationExperience with Google Analytics and social media management and monitoring toolsAbility to generate and edit creative photo and video contentAbility to learn quickly, work independently, think creatively, meet deadlines, and achieve goalsJob DescriptionWe are looking for a energetics Digital Marketer employee for handle our website and social media pageBuild, grow, and manage LN’s digital, social, and traditional media presenceMonitors and manages the company’s digital media profile and presence. Includes Website, Blog, eBlasts, Facebook, Twitter, Instagram, and additional channels deemed relevantResponds to comments, inquiries and engages in relevant social media discussions about LN, competitors, and/or industry, both from existing customers as well as new audiencesImplements strategies and tactics to get the word out about our company and drive qualified trafficRun regular digital promotions and campaigns, track, measure, analyze all initiatives and be prepared to provide weekly reporting to all stakeholdersMonitor key industry pages and sites to identify opportunities, respond to issues, contribute to the conversation, share relevant information, and maintain brand presenceConducts market research to determine market requirements for existing and future projectsDeploys successful marketing campaigns and owns implementation from ideation to execution, all while consistently articulating accurate brand voiceExpands and develops marketing platformsDelivers marketing within budgetCreates marketing presentationsAPPLY NOW", "Page_URL": "https://merojob.com/digital-marketer-10/"}, {"name": "IT Officer", "company": "", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "", "salary": "", "deadline": "", "education": "", "skills": "", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeApply Before(Deadline):Nov. 15, 2020, 11:55 p.m. (4 days, 13 hours from now)Bachelor in Information technology or related subjects with a substantial  working experience within relevant fields and have obtained and maintained relevant certificates. Minimum three years of relevant work experienceIT officer will be responsible for maintaining and supporting the smooth operation of  TLMN information Technology services and systems including computers, networks, storage, internet, software applications and server systemsApplying ProcedureLink to the Job applicationhttps://preview.tinyurl.com/formAHSubmit application form,CV with 3 referencesclearly indicating the position to[email protected]closing date for application is15November, 2020.\"TLM Nepalis an equal opportunity employer\"We encourage candidates of diverse backgrounds, women and persons with disability, to apply\" TLM Nepal is committed to safeguarding: protecting children and vulnerable adults and as such candidates will be subject to pre-employment checks", "Page_URL": "https://merojob.com/it-officer-389/"}]