[{"name": "Senior .Net Developer", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Tinkune Marg, Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "Technical LeadC#JavascriptCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Tinkune Marg, Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Technical LeadC#JavascriptCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetYou get energy from coding and and you are familiar in the Microsoft ecosystem such as Visual Studio, Azure & .NET CoreYou believe in writing clean, scalable code using C# .NETYou can act as a leader of your team and provide them technical assistanceWorking with API's and microservices is a piece of cake for youScalable and manageable solutions are in your DNAYou are familiar with front-end JS frameworks such as Angular, React or VueWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/senior-net-developer", "Page_URL": "https://merojob.com/senior-net-developer-49/"}, {"name": "Java Developer - Benequick", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "$. 600.00 - 750.00 Monthly", "deadline": "Dec. 12, 2020 23:55\n(2 weeks, 6 days from now)", "education": "Bachelor", "skills": "JavaObject Oriented ProgrammingJavascriptJqueryHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleKathmanduOffered Salary:$. 600.00 - 750.00 MonthlyApply Before(Deadline):Dec. 12, 2020 23:55\n(2 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:JavaObject Oriented ProgrammingJavascriptJqueryHtmlOther SpecificationMandatory: Java, Spring, Hibernate, Angularjs, JUnitMust have skills:Good knowledge of JAVA and Object-Oriented ProgrammingGood knowledge of relational databasesExperience with J2EE, HTML, CSS, JavaScript, jQueryProficiency with Unix-like operating systemsExcellent Verbal and Written CommunicationExcellent Logical and Analytical SkillMath AptitudeTime Management and ProfessionalismOther Job Requirements:IT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksAbility to work independentlyBenefits:Health InsuranceProvident FundDashain Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Govt Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesJob DescriptionDuties and Responsibilities include, but are not limited to:Resolves assigned tasks in an efficient and effective manner(Customer or internal)Quality code with minimal bugsPositive code review resultsUnderstands and follows SDS (Smart Data Solutions) workflow and associated technical systemsApplies analytical and business knowledge to solve customer-specified problems adhering to SDS coding standards and policiesAdheres to SDS’s courteous and professional written and verbal communication standardsA consistently high rating on customer satisfaction surveys 5. Works independently with minimal guidanceDevelopmentCompletes development projects as specified by development manager, adhering to SDS coding standard and policiesPrograms appropriate changes as specified by development manager, adhering to SDS coding standard and policiesReviews applicable changes (in particular system related changes) with peer/manager and get approval on programming changes from managerDevelops test cases and data and test all changes and new modulesOther duties as assignedNew ImplementationsCommunicates with client regularly and documents all specifications and workflows. All implementation meetings are followed up with written listing of all tasksUnderstands related workflow and all associated nuancesCompletes all tasks as specified on the implementation checklistCompletes assigned tasks as specified by the development manager and follow the implementation manual/checklistMeets development milestones consistently. Do “what it takes” to achieve customer go live dateCommunicates to client and management if milestone dates are not metLeverages the expertise of other developers in the team on specific modules (Examples: scanner setup, OCR setup, etc.Sets up customer billing rates as specified on the contract and verify with sales or accounting. (Billing)Tracks and bills all applicable development hours. (Billing)Ensures unnecessary direct labor costs are not incurred in conjunction with the implementation.Business AnalysisUnderstands and follows all assigned customers workflow including import and export processAbility to interpret customer business processes, analyze problems and recommend programmable solutionsRisk DesignationThe role is classified as High Risk, due to access to Protected Healthcare Information. Employees in this role must be free of felony convictions on a background check reportApplying Procedure:Interested and qualified candidates are requested to apply with anupdated Resumeat[email protected]with position applied as emailNote :Only shortlisted candidates will be contacted for the programming test and interviewFreshers are discouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationOR,APPLY NOW", "Page_URL": "https://merojob.com/java-developer-benequick/"}, {"name": "Sr. React Developer", "company": "Deerhold Nepal", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 22, 2020 23:55\n(11 hours from now)", "education": "Bachelor", "skills": "Time ManagementCssHtmlCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 22, 2020 23:55\n(11 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Time ManagementCssHtmlCommunicationInterpersonalOther SpecificationBachelor’s degree in Computer Science, Information Technology, or a similar fieldPrevious experience working as a React.js DeveloperIn-depth knowledge of JavaScript,the DOM, CSS, HTML and front-end languagesKnowledge of REACT tools including React.js, hooks, ReduxExperience with user interface designKnowledge of performance testing frameworks including JestExperience with browser-based debugging and performance testing softwareExcellent troubleshooting skillsFamiliarity with RESTful APIsExperience using GitExcellent communication skills, both written and verbalExperience in cloud platforms such as AWSExperience working on content modeling is a plus pointIn-depth experience working on custom CMS integration and developmentAble to work well on a remote, multi-national team with Agile and ScrumJob DescriptionAs a React Engineer, you are a self-motivated, life long learner with a passion for design and engineering. You love great UX. You like to keep up with the latest trends in the frontend and design world to ensure we are always using the best techniques possible. You are familiar with Agile Scrum. Beyond coding, you enjoy working in an evolving industry.Write codes in React/JavascriptCollaborate closely with the development team to design and launch new featuresTest and troubleshoot the systemUtilize test-driven development practices for the codes generatedSuggest and improve the functionality of the existing systemUtilize best practices with the technologies to ensure effective and efficient processing of tasksApplying Procedure:Interested and eligible candidates are requested to submit their updated resume to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/sr-react-developer-2/"}, {"name": "Trainee", "company": "Verisk Nepal", "level": "Entry Level", "vacancy": "1", "time": "Full Time", "address": "Lalitpur", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "Database ManagementProblem SolvingOrganizationalCommunicationJavascriptInterpersonal", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Entry LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:LalitpurOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Database ManagementProblem SolvingOrganizationalCommunicationJavascriptInterpersonalJob DescriptionRequirement:Good knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)Problem solving skillsGood knowledge curve - Ability to learn quickly and implementGood attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skillsQualificationsBachelors in Computer Science / Information Technology or equivalentUp to 1 year of working experience in development are also encouraged to applyApplying ProcedureInterested candidates can apply -https://smrtr.io/4v42X", "Page_URL": "https://merojob.com/software-engineer-trainee-net/"}, {"name": "Vendor Data Analyst", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(1 week, 6 days from now)", "education": "Bachelor", "skills": "DatabaseSqlCommunicationInterpersonal", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(1 week, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:DatabaseSqlCommunicationInterpersonalJob DescriptionHe/she should have:Impeccable written and verbal communication skill (English).Someone who loves to communicate with onshore and offshore teamKeenness to learn software tools, able to identify issues with data and work on resolutions.Good Analytical thinkingWell versed in ExcelWho is technology savvy, keeps himself/herself updated on latest technology etc.US Healthcare, database and SQL knowledge will be an added advantageApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/vendor-management-associate-2/"}, {"name": "DevOps Solution Architect", "company": "Proshore Nepal", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "", "salary": "Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)", "deadline": "", "education": "Bachelor", "skills": "Devops ToolsCloudCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Database Engineer/Database Programmer, Programmer/ Software Engineer, Software Architect, Software Implementation, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeOffered Salary:NegotiableApply Before(Deadline):Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Devops ToolsCloudCommunicationJob DescriptionWe want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers.Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a teamYou are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetAbility to evaluate cloud application requirements and make architectural recommendations for implementation, deployment, and provisioning applicationsStrong background integrating CI/CD platformsExperience with infrastructure tools such as Terraform, CloudFormation, or AnsibleProviding supervision and guidance to development teamsExperience with IT architecture, infrastructure, and cloud developmentWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activitiesPaid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday'sOpen office environmentThis is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype.During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skillsApplying ProcedureInterested and enthusiast candidates are encouraged to apply from our career page directlyhttps://careers.proshore.eu/devops-solution-architect", "Page_URL": "https://merojob.com/devops-solution-architect/"}, {"name": "Dot Net Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "Asp.NetAws ServicesCommunication", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Asp.NetAws ServicesCommunicationOther SpecificationHave strong sense of ownership with demonstrated ability to work independentlyBe focused, passionate, and strive to find simple solutions to complex problemsHave previous design/development experience with large-scale production systems and/or data platforms with knowledge of high availability cloud-based applicationsExperience working with Business Stakeholders. Ability to elaborate and convert business requirements into technical requirements, create architecture and design documents for the stakeholders.Knowledge of cloud-based applications would be a strong plus pointExperience working with large-scale production systems and/or data platformsExperience leading a development effort, including mentoring younger developersExperience interfacing with external groups, product managers, partners, customersBe comfortable working in a dynamic environmentExcellent communication skills (written and verbal)Skills and Qualifications:BS/MS degree in Computer Science, Engineering or a related subjectAt least 1 years full-time work experience with good knowledge of AWS environmentStrong ability to build RESTful services in C# with .NET/.NET Core and Python (nice to have)Net Frameworks 4.5+ and .Net Core 2.0+SQL and NoSQL databases (preferably PostgreSQL and/or DynamoDB), ElasticsearchProficient in SQL and relational database conceptsExperience or Knowledge of AWS services like EC2, Lambda, API Gateway, Kinesis, AWS Batch, Athena, Aurora PostgreSQL, DynamoDB, Elasticsearch is a strong plus pointPreferably certified in AWS skillsJob DescriptionVerisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world.In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorshipApplying ProcedureVerisk Analytics is an equal opportunity employerAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.Please apply through the below link :https://smrtr.io/4q7Kforhttps://careers.smartrecruiters.com/Verisk?search=nepalUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.", "Page_URL": "https://merojob.com/dot-net-developer-53/"}, {"name": "Python Developers", "company": "Numeric Mind Pvt Ltd", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Remote/office in Nepal", "salary": "Negotiable", "deadline": "Nov. 23, 2020 23:55\n(1 day, 11 hours from now)", "education": "Bachelor", "skills": "PostgresPythonMssqlBootstrapMvc", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Desktop Support, Programmer/ Software Engineer, Software Architect, Team Leader (Software)Job Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Remote/office in NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 23, 2020 23:55\n(1 day, 11 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:PostgresPythonMssqlBootstrapMvcOther SpecificationExpert in core python, and OOPStrong experience in numpy, pandas desiredAt least 3 months on-job experience as a trainee or an employee; Over 1 year experience preferredEducation: BS in Computer Science or equivalent degreeJob DescriptionAbout Nimble Clinical Research: Nimble Clinical Research is a US based technology company dedicated towards creating innovative software applications for pharmaceutical and biotech companies. We are building our local Nepal team via our partner company, Numeric Mind Pvt Ltd (numericmind.com) in Nepal and looking for the best python developers. Visit Nimble Clinical Research, LLC (nimble-cr.com) to know about our current software applications.About Numeric Mind:Numeric Mind is a statistical service company that provides insightful statistical solutions and data analytical services to enterprises and research firms seeking to make informed business decisions. We offer statistical services using advanced statistical programming tools and techniques to clients ranging from healthcare, biotech, and pharmaceutical companies to financial and telecom sectors. Our statistical expertise tackles a wide variety of problems. In addition to statistical services, Numeric Mind also offers short courses, training, and seminars.Role and ResponsibilitiesAs a Python developer you’ll design and develop highly complex modules in our data analytics platform.The ideal candidate is a self-starter, independent and passionate developer with a strong desire to create high quality applicationsYou are expected to continually learn and apply best software development practices and technologies to the tasks at handUse core python, data analysis related packages (such as numpy, pandas, matplotlib, SciPy) and QT (to design user interface elements)Compensation: Attractive salary, higher than market rate, along with increments every 6 monthsReferral: Do you know someone else who is great python programmer?  Earn NRP 20,000 by referring a candidate. Refer them to us! On successful hiring of the candidate, lasting at least a month of employment, you will get NRP 20,000 as referral reward.Applying ProcedureInterested candidates are requested to send you resume directly to[email protected]cr.com.In the resume include your git repository link andLinkedInprofile link if available", "Page_URL": "https://merojob.com/python-developers-5/"}, {"name": "Senior Developer Node.js / Vue.js", "company": "Outsource Array", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "ScrumVue.JsSoftware DevelopmentNode.JsDatabase Management", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software Engineer, Software Architect, Software ImplementationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:ScrumVue.JsSoftware DevelopmentNode.JsDatabase ManagementJob DescriptionWe are looking for Full Stack developers who need to be able to work on a weekly release schedule, with online demos and a minimal SCRUM routine.Need to be experts at REST webservice, Node.js and/or Vue.js.Our technology stack is:Backend webservices: on Node.js, Postgresql, Docker, Assorted AWS managed services, OAuth2.Front-end: Vue.js, bootstrap.Applying Procedure:Interested candidates are requested to send us your CVs to:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/senior-developer-nodejs-vuejs/"}, {"name": "Quality Developer", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kupondole, Kandevtasthan", "salary": "$. 550.00 - 700.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "Html5JavascriptJquery", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kupondole, KandevtasthanOffered Salary:$. 550.00 - 700.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Html5JavascriptJqueryOther SpecificationSkills :Hands-on experience in JAVA Object-Oriented Programming design concepts and software development processes and methodsStrong knowledge of relational databases, SQLExperience with J2EE, HTML, CSS, JavaScript, jQueryExperience working with version control systems, such as GIT including branching and merging strategies.Excellent troubleshooting and communication skills( Verbal and Written)Excellent Logical and Analytical SkillAttention to detailTime Management and ProfessionalismExperience with technologies listed in previous sectionReporting and MetricsOn-time task completion percentageOther Job Requirements:At least a Bachelor’s degree in Computer Science or equivalentIT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksDesire and ability to continuously improve, discover and expand the limitsAbility to work independently or as a part of a teamJob DescriptionWe are looking for few highly motivated, organized professional Quality Developers in our Nepal office Software Development House Nepal (SDHN)Duties and Responsibilities include, but are not limited to:Resolves assigned tasks in an efficient and effective manner(Customer or internal)Design, implement and maintain JAVA application adhering to SDS coding standards and policiesCommunicate effectively with clients and vendors regularly and documents all specifications and workflows. All implementation meetings are followed up with written listing of all tasksDevelops test cases and data and test all changes and new modulesAdheres to SDS’s courteous and professional written and verbal communication standardsA consistently high rating on customer satisfaction surveys 5. Works independently with minimal guidanceActively involve in improving organizational culture, process, and standardsOther duties as assignedBusiness AnalysisUnderstands and follows all assigned customers workflow including import and export processAbility to interpret customer business processes, analyze problems and recommend programmable solutionsRisk DesignationThe role is classified as High Risk, due to access to Protected Healthcare Information. Employees in this role must be free of felony convictions on a background check reportBenefits:Health InsuranceProvident FundDashain Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Government Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesNote:Only shortlisted candidates will be contacted for the programming test and interviewFresher with excellent understanding of JAVA OOPs programming and communication skills are highly encouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationAPPLY NOW", "Page_URL": "https://merojob.com/quality-developer-5/"}, {"name": "Sr. QA Engineer (Work from Home)", "company": "Remote Coach", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "NRs. 80,000.00 Monthly", "deadline": "Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)", "education": "Bachelor", "skills": "Problem SolvingComputerAuditingMs OfficeDecision Making", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Test EngineerJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NRs. 80,000.00 MonthlyApply Before(Deadline):Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Problem SolvingComputerAuditingMs OfficeDecision MakingOther SpecificationBachelors degree preferredCertifications an advantage including Quality Auditor, Quality Engineer, Quality Improvement Associate, Six SigmaQuality inspection, auditing and testing experienceExperience with implementation of corrective action programsProduct or industry-specific experienceStrong computer skills including Microsoft Office, QA applications and databasesKnowledge of tools, concepts and methodologies of QASolid experience in effective usage of data analysis tools and statistical analysisKnowledge of relevant regulatory requirementsProblem analysis and problem solvingSound judgementDecision-making skillsAgile Project Execution MethodologiesJob DescriptionRemote Coach, a revenue generating start-up is looking for a Senior QA to join its engineering team and evolve the approach to Quality Assurance for its mobile, web and back-end applications. Remote Coach is a premium personal fitness coaching platform, allowing fitness professionals to compliment their direct coaching with clients by hosting virtual personal training sessions at their/their clients convenience. Additionally the platform provides real-time feedback on health data allowing coaches to monitor and tailor their client’s exercise and nutrition programs as necessary.As a Senior QA you will be responsible for:Shaping the company’s approach to functional system, UAT and regression testing.Leading other team members (QA or otherwise) in best practice testing approaches.Identifying, writing and executing functional tests per development sprint.Building and maintaining test suites for ease of regression and UAT.Reviewing and critiquing functional requirements and their suitability for testing.Proposing and identifying test and defect tracking toolsets. Optimising the usage of existing and new toolsets.Reporting on testing output, metrics and providing the leadership team with insights to overall software quality.Essential QualitiesA successful candidate will have the following key skills and qualities:Excellent written and spoken English.Previous experience in writing clear functional tests from requirements and identifying gaps in requirements.Direct functional testing of mobile applications.Direct functional testing of RESTful APIs through toolsets such as Postman.Knowledge of best practice test and defect tracking lifecycles.Team leadership experience (although not necessarily in a testing role).Ability to expand test coverage to fault find and provide meaningful first pass analysis to the development team when raising defects.Desirable QualitiesThe following are desirable but not essential:Experience working in an Agile software development process.Test automation design and implementation.Experience with JIRA and Confluence.Usage of test frameworks such as TestRail.Fault finding using application logs and writing SQL queries (MySQL).What We Will Offer:Flexible working hours, willing to work from homeA Salary dependant on experience and level of the challenge acceptedChance to work with an early-stage startup and be part of our growthChance to learn new skillsChance to work with the product teamApplying Procedure:Interested candidates are requested to send their updated resume directly e-mail to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/sr-qa-engineer-working-from-home/"}, {"name": "Backend Developer ( Nodejs)", "company": "UBA Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "Html5JavascriptNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Html5JavascriptNode.JsOther SpecificationBE in computer science or similar relevant fieldPrevious working experience as a Node.js Developer for 3 yearsJob DescriptionBuild customer-facing UI and back-end services for payment processing administration and managementCode, test and operate node.js based servicesEffectively use tools and ingenuity to identify and fix defects before they become a problemIn-depth knowledge of Node.jsExperience with REST API development and API securityExperience with Sql and NoSql dbsHands-on experience with HTML, CSS, and AJAXDevelopment experience designing object-oriented JavaScript and SVGApplicable knowledge of web libraries and frameworks such as AngularJS, Polymer, and ClosureFamiliarity with the whole web stack, including protocols and web server optimization techniquesStrong analytical skills and problem solving aptitudeAttention to detailsAPPLY NOW", "Page_URL": "https://merojob.com/backend-developer-nodejs/"}, {"name": "ETL Developer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "4", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 11, 2020 14:25\n(2 weeks, 5 days from now)", "education": "Bachelor", "skills": "ProgrammingSqlEtl", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[4]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 11, 2020 14:25\n(2 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:ProgrammingSqlEtlJob DescriptionSupport, development and data operation workloadCoordinate and communicate effectively with team members and various stakeholdersUnderstand the business requirement, produce code and conduct testing to ensure that product meets the requirementsIdentify and test for bugs and bottlenecks in the ETL solutionEnsure the best possible performance and quality in the packagesParticipate in different support activitiesApplying Procedure:Please visit mentioned website :https://careers.smartrecruiters.com/Verisk?search=nepalOR,APPLY NOW", "Page_URL": "https://merojob.com/etl-developer-3/"}, {"name": "ETL - Tester / QA Engineer", "company": "Verisk Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 11, 2020 18:55\n(2 weeks, 5 days from now)", "education": "Bachelor", "skills": "SqlEtlTesting", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 11, 2020 18:55\n(2 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:SqlEtlTestingJob DescriptionAct as QA lead on a wide variety of data intense projectsLead analysis for the purposes of developing test cases and test data for back-end data intense applicationPerform hands-on manual testing while scripting automated tests to ensure application and data qualityTest ETL systems in Pentaho which includes Data Analysis, Test Data Creation in different format/input files and Testing regulated data – majority in a scripted automated environmentContinuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation SuitesServe as a liaison to business analyst and product owner, providing feedback on application readiness for migrationsAdditional Information: Verisk Analytics is an equal opportunity employerAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disabilityApplying Procedure:Please visit mentioned website:https://careers.smartrecruiters.com/Verisk?search=nepalorhttps://jobs.smartrecruiters.com/Verisk/743999721164045-software-engineer-data-qa-automation-engineerUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property.Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resumeConsumer Privacy NoticeOR,APPLY NOW", "Page_URL": "https://merojob.com/etl-tester-qa-engineer-2/"}, {"name": "Java Developer-Quickclaim", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kupondole", "salary": "$. 600.00 - 750.00 Monthly", "deadline": "Dec. 12, 2020 23:55\n(2 weeks, 6 days from now)", "education": "Bachelor", "skills": "Java And Object Oriented Programmi…JavascriptJqueryHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KupondoleKathmanduOffered Salary:$. 600.00 - 750.00 MonthlyApply Before(Deadline):Dec. 12, 2020 23:55\n(2 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Java And Object Oriented Programmi…JavascriptJqueryHtmlJob DescriptionMust have skills:Good knowledge of JAVA and Object-Oriented ProgrammingGood knowledge of relational databasesExperience with J2EE, HTML, CSS, JavaScript, jQueryProficiency with Unix-like operating systemsExcellent Verbal and Written CommunicationExcellent Logical and Analytical SkillMath AptitudeTime Management and ProfessionalismOther Job Requirements:IT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksAbility to work independentlyBenefits:Health InsuranceProvident FundDashai Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Govt Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesApplying Procedure:Under the current COVID situation, we plan to conduct a remote examination (Java proficiency test). But before we send you the questionnaire details, we would like you to have your system ready with following prerequisites for the examination:JDK 1.8EclipseOnce these are ready, Interested and qualified candidates are requested to apply with the above setup confirmation and anupdated Resumeat[email protected]with position applied as email.We will send you the exam details/questions and exam date by the next following day during the business hour.You will have 3 hrs to complete the exam and submit it to us via[email protected]. The examination will comprise of the OOP concept, File handling, and code debugging.Note :Only shortlisted candidates will be contacted for the programming test and interviewFreshers are discouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationOR,APPLY NOW", "Page_URL": "https://merojob.com/java-developer-quickclaim/"}, {"name": "Senior Dot Net Developer", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptAnalyticalCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:JavascriptAnalyticalCommunicationSoftware DevelopmentJob DescriptionResponsibilitiesTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAQualifications and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc would be an added advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/senior-dot-net-developer-13/"}, {"name": "Dot Net Developer", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptAnalyticalCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptAnalyticalCommunicationSoftware DevelopmentJob DescriptionResponsibilitiesTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAQualifications and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 2 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc would be an added advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/dot-net-developer-54/"}, {"name": "Senior Java Developer", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Angular 5JqueryMicrosoft Sql ServerOracleJavascriptCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Angular 5JqueryMicrosoft Sql ServerOracleJavascriptCommunicationSoftware DevelopmentJob DescriptionExperience developing enterprise applications with proven enterprise experience level with RDBMS and SQL (Oracle and/or Microsoft SQL Server)Experience with Continuous Integration and writing automated unit and integration testsStrong object-oriented programming skills using JavaKnowledge of relevant technologies inclusive of (Angular 5, JavaScript, JOuery)Knowledge of algorithms and data structuresFamiliar with design patternsKnowledge of secure coding practices as it pertains to OWASPKnowledge of Version Control Software tools such as SVN, bitbucketExperience with Software development/management tools using the Atlassian suite (JIRA, Confluence)Experience with both Windows and Unix Operating systemQualifications and Education RequirementsBS Computer Science or related field or equivalent industry experienceAt least 5 years of experience in Software developmentSoft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valueDesire and ability to continuously improve, discover and expand the limitsCritical thinking has an opinion on various technological topics.Applying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/senior-java-developer-46/"}, {"name": "Java Developer", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "CssHtmlJqueryJavascriptCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:CssHtmlJqueryJavascriptCommunicationSoftware DevelopmentJob DescriptionResponsibilitiesInvolve in all stages of the project life cycle: requirements definition, design, and development.Translate application stories and requirements into functional applications.Write neat and clean code for desktop and web application.Create test cases and follow test cases to implement the requirements.Active participation in Project level discussion/meeting.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAQualifications and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsAt least 2 years of experience in Software development using J2SE and J2EE.Experience in parallel and multithreaded programmingKnowledge of algorithms and data structuresInterest in achieving maximum performance from available hardware and softwareFamiliar with design patternsUI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery)Hands on knowledge on Spring Framework.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsHands on knowledge on Apache Camel FrameworkKnowledge of testing frameworks/methodologies (TestNG, JUnit, TDD)Understanding of XML, JSON, web services technologiesExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valueDesire and ability to continuously improve, discover and expand the limitsCritical thinking, has an opinion on various technological topics.Applying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/java-developer-120/"}, {"name": "Senior Oracle – PL/SQL Developer", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "AnalyticalCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:AnalyticalCommunicationSoftware DevelopmentJob DescriptionResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Qualifications and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsAt least 5 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/senior-oracle-plsql-developer-7/"}, {"name": "Oracle- PL/SQL Developer", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "AnalyticalCommunicationSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:AnalyticalCommunicationSoftware DevelopmentJob DescriptionExperienceUnderstanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.EducationBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesRequired Technical SkillMinimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo)Other SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/oracle-plsql-developer-7/"}, {"name": "Senior Test Automation Engineer", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Relational DatabaseSoftware TestingSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Relational DatabaseSoftware TestingSoftware DevelopmentJob DescriptionResponsibilitiesTest Automation Engineers would be expected to be doing following:Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Qualifications and Education RequirementsBachelor Degree or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application ServerApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/senior-test-automation-engineer-4/"}, {"name": "Test Automation Engineer", "company": "COTIVITI NEPAL", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Relational DatabaseSoftware TestingSoftware Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Relational DatabaseSoftware TestingSoftware DevelopmentJob DescriptionResponsibilitiesTest Automation Engineers would be expected to be doing following:Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Qualification and Education RequirementsBachelor’s degree or equivalent degree in Computer related studiesMust Have SkillsMinimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application ServerApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/test-automation-engineer-7/"}, {"name": "Business Analyst", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Problem SolvingOrganizationalDecision MakingInterpersonalCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Problem SolvingOrganizationalDecision MakingInterpersonalCommunicationJob DescriptionThe Business Analyst is the liaison between the agile sprint team and the business (SME, Product Manager and Product Owner). Works to create and refine the feature backlog in preparation for the next Program Increment through defining innovative improvements to business processes in order to meet the business requirements. Works with the Sprint Team to foster a collaborative atmosphere and provide clear understanding of the business problem being solved. Works well in a team-structured environment.ResponsibilitiesReviews existing legacy application documentation to develop an understanding of the existing functionality.Meets with business leadership (SME, Product Manager and Product Owner) to clarify business requirements.Documents existing business processes and proposes innovative improvements.Develops a clear definition and acceptance criteria for each of the features to ensure the business requirements will be addressed.Assists with documentation and prioritization of the business value associated with the business requirements.Develops product expertise.Conduct user acceptance testsQualificationsBachelor Degree in Computer or related field.5+ years of business analysis experience.Experience in an agile software development environment an asset.Possesses excellent communication, organizational and observational skills.Proficient problem solving skills with good judgment and decision making.Must work well as a member of a team.Applying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/business-analyst-50/"}, {"name": "Project Manager", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Problem SolvingTime ManagementDecision MakingCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Problem SolvingTime ManagementDecision MakingCommunicationJob DescriptionResponsibilitiesConduct and facilitate the planning. Help team to define their goals on each planning.Facilitate all the sprint rituals of own team.Coordinate with other teams on the Agile Release Train (ART) as needed. Participate in SOS to present own team's progress.Own team’s commitments and help team to achieve their goal.Help remove impediments and foster an environment for high-performing team dynamics, continuous flow, and relentless improvement.Help and guide the team to optimally plan their capacity.Make sure the team’s utilization is efficiently managed and has higher productivity.Conduct regular retrospective on every event. Make sure every action items have individual/team’s name and a date expected to get resolved with a follow up.Manage team’s RAID – Risk, Assumption, Issues and Dependencies.Compile, collect, produce and publish team’s report on different metrics.Work with Engineering manager for team’s development that helps the team to be more productive as well as efficient.Escalate to higher authority as required on any case that needs resolution from cross team.Coach the team in Scrum, Extreme Programming (XP), Kanban, and SAFe, ensuring that the agreed Agile process is being followed.Develop, document and conduct Agile development and process training as required – getting started and regular refresher training. Work with organization training manager/specialistRequirementsMinimum five years’ experience in similar role.Applying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/project-manager-398/"}, {"name": "Senior MS-SQL Developer", "company": "COTIVITI NEPAL", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Relational DatabaseAnalyticalCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 5 yearsProfessional Skill Required:Relational DatabaseAnalyticalCommunicationJob DescriptionResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Qualifications and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS.Preferable SkillsExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added valueApplying ProcedureTo apply, please login tohttp://www.cotiviti.com.np/jobsor Send your CV to[email protected]", "Page_URL": "https://merojob.com/senior-ms-sql-developer-3/"}, {"name": "Account Management Programmer-Java", "company": "Software Development House Nepal", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kupondole", "salary": "$. 900.00 Monthly", "deadline": "Nov. 27, 2020 00:00\n(4 days, 11 hours from now)", "education": "Bachelor", "skills": "Java And Object Oriented Programmi…JavascriptJqueryHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KupondoleKathmanduOffered Salary:$. 900.00 MonthlyApply Before(Deadline):Nov. 27, 2020 00:00\n(4 days, 11 hours from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Java And Object Oriented Programmi…JavascriptJqueryHtmlOther SpecificationGood knowledge of JAVA and Object-Oriented ProgrammingGood knowledge of relational databasesExperience with J2EE, HTML, CSS, JavaScript, jQueryProficiency with Unix-like operating systemsExcellent Verbal and Written CommunicationExcellent Logical and Analytical SkillMath AptitudeTime Management and ProfessionalismOther Job Requirements:IT experienceAvailability to work nights and weekends if necessaryMust be able to work on Holidays to take care of urgent tasksAbility to work independentlyJob DescriptionNight shift (7:45 PM - 3:45AM)Benefits:Health InsuranceProvident FundDashai Bonus, Performance Bonus, Referral Bonus15 Days PTO13 Days Govt Holidays5 Working Days per WeekRegular salary revision based on performanceFrequent team building activitiesOffered Salary :$900++ per monthApplying Procedure:Interested and qualified candidates are requested to apply with anupdated Resumeat[email protected]with position applied as emailNote :Only shortlisted candidates will be contacted for the programming test and interviewFreshers are discouraged to applyNon-Java developers with good programming background and willing to switch to Java can applyKeep checking inbox regularly for email notificationOR,APPLY NOW", "Page_URL": "https://merojob.com/account-management-programmer-java/"}, {"name": "Full Stack Developer", "company": "Supreme IT Solutions", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Css3LaravelNode.JsPostgresqlReact", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Css3LaravelNode.JsPostgresqlReactOther SpecificationShould have minimum of 2 years of work experienceHands on experience writing NodeJS + AngularJS/ReactJS + PostgreSQL / MySQL / MongoDB code in productionExperience building highly scalable service APIs (REST, SOAP, Microservices) hosted on cloud environmentExperience with Agile Development, SCRUM, or Extreme Programming methodologies Skills RequiredStrong experience in HTML5, CSS3, Javascript, JQuery and latest Javascript frameworks (Backbone, Bootstrap,Node.js etc)Experience in one or more MVC frameworks(Laravel, Codeigniter, Ruby on Rails, Spring) is a plusCan provide support for existing applicationsSelf Motivated and open minded personGood learning attitudeExperience in integration and deliveryAbility to liaise at all levels within the businessSolid analysis and problem-solving skillsJob DescriptionAbility to work independently or as part of a teamIdentify technical problems and procedures and communicate their applicable solutionsParticipate in collecting information for developing enterprise level applicationsBe part of development team to migrate web applications in other technologies into NodeJS and MongoDB environmentResolve issues related to web application like cross-browser compatibility, security issues and moreDeveloping scalable applications (both Front-end (ReactJS / ReactJS Native and Back-end NodeJS)Basic Knowledge of secure coding practices as it pertains to OWASPExperience of working in a SCRUM/Agile team would be added valueWriting reusable code and libraries, optimize applications for performance and scalabilityDesign and implementation of low-latency, high-availability, and performance applicationsBuilding secured backend API's to be consumed by multiple applications (e.g. web and mobile) Implementation of security and data protectionWhat We OfferDashain BonusYour own workstationAnnual Paid LeavesFree LunchExcellent career opportunities5 days a weekOpen office environmentAPPLY NOW", "Page_URL": "https://merojob.com/full-stack-developer-42/"}, {"name": "Web Developers (.NET, SQL, Angular, Blazor) 100% Remote Job", "company": "Web Talents Dot Net", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Nepal", "salary": "Negotiable", "deadline": "Dec. 20, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "AngularSql.NetBlazorSoftware EngineeringWeb Development", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 20, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:AngularSql.NetBlazorSoftware EngineeringWeb DevelopmentJob DescriptionWeb developers at Web Talents are an essential part of the product team,\nresponsible for building web applications. You will work in a remote team of developers\nwhere we are currently building out and scaling up web applications.We offer flexible hours and 100% remote job.Skills We Are Looking ForBachelor's\ndegree in Computer Science or related field.  Equivalent\nexperience will be considered.Experience\nin C# and SQL developmentExperience\nin Angular or Blazor developmentUnderstanding\nthe basics of relational database design and SQL programming (any database)Understanding\nthe basics of object-oriented programming (any language)Experience\nin Boilerplate or ABP framework is a plusThe Persons We Are Looking ForA good\ncommunicator in EnglishA\npositive, smart team memberEager\nto build and ship softwareHungry\nto learn new technologies and frameworksPassionate\nabout quality and seeing things to completionSalary:Salary is negotiable (depends on skills and experience)This position is not for fresh-graduated developers.Applying Procedure:Interested candidates should send their CV at[email protected].OR,APPLY NOW", "Page_URL": "https://merojob.com/web-developers-net-sql-angular-blazor-100-remote-job/"}, {"name": "Team Lead (Java/Spring Framework)", "company": "Agram Infotech", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Birgunj", "salary": "Negotiable", "deadline": "Dec. 20, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalLogical ThinkingCreative Thinking", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:BirgunjOffered Salary:NegotiableApply Before(Deadline):Dec. 20, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than 3 yearsProfessional Skill Required:Problem SolvingAnalyticalLogical ThinkingCreative ThinkingOther SpecificationBachelor's degree in Computer Science or related field of study OR equivalent combination of training and experience3+ years of overall software development experienceMust have led a team of 3 to 5 people for a period of at least 1 year.Hands on experience using the following, with advanced skills in at least one, and at least moderate skills in the rest:Hands on experience with at least 1 Java framework, such as: Spring and spring Boot (MVC)Html/CssAjax & XML and JSON and JQueryReact.jsExperience with (3 or more of the following):Various common javascript librariesResponsive designCreating and consuming secure web services, web APISecure website design and developmentNice To HaveExperience with Git, Azure DevOpsExperience with SQL Server 2012/2014Experience with automated unit testing and integration testingExperience with graceful degradation and/or progressive enhancement websitesNote:The ideal candidate is a smart, energetic, flexible person who can think creatively, and can work effectively independently as well as part of a collaborative team. They love writing software and solving complex problems and has a hunger for new knowledge. They strive to achieve superior results through high performance and execution excellence. They take calculated risks and exercise innovation. They move quickly, but not at the expense of results. Lastly, they hold themselves accountable.Job DescriptionPosition Summary:As Java Software Engineer, you will be part of an agile development team building and supporting software systems. In this crucial role, you'll work on a high performing team and be involved with the design, development, testing, and support of desktop, mobile and web applications.Who We Are:We are a startup software company focused on software development, Internet of Things, Cyber Security and Artificial IntelligenceOur Vision:Identify social challenges and develop technical solutions to ease themOur Mission:To be a leading and innovative software solution provider in NepalEssential Job Functions:Work with a cross-functional, highly talented team to design, develop and deliver new featuresUse the latest technologies to design and build flexible, scalable, reliable and high-performing applicationsWrite tests and perform code reviews to ensure that we're shipping reliable, readable, and reusable codeSupport our current applications, investing in fixing technical debt, and refactoring opportunitiesDevelop and design user interface components, web services, API’s, and database integrationsMust have led a team of 3 to 5 people for a period of at least 1 yearMust have good verbal and written communication skills (Should be able to talk fluently and write emails without grammatical mistakes)Proven experience of delivering on-time and with qualityProven experience of handling risks and providing mitigation strategiesAPPLY NOW", "Page_URL": "https://merojob.com/team-lead-javaspring-framework-2/"}, {"name": "Senior PHP Developer (WordPress)", "company": "ThemeGrill", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Basundhara, Kathmandu, Nepal", "salary": "NRs. 50,000.00 - 100,000.00 Monthly", "deadline": "Dec. 20, 2020 23:55\n(4 weeks from now)", "education": "Bachelor", "skills": "Traits And Design PatternOopAutoloadingNamespaceMvc", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Basundhara, Kathmandu, NepalOffered Salary:NRs. 50,000.00 - 100,000.00 MonthlyApply Before(Deadline):Dec. 20, 2020 23:55\n(4 weeks from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Traits And Design PatternOopAutoloadingNamespaceMvcOther SpecificationWe are looking for a Senior PHP Developer who can work on WordPress and have a strong working history on PHP and WordPress Projects. If you are tired of working with clients project and would like to explore working on Products then this job is for you. Also, if you have a solid knowledge of PHP but randomly worked with WordPress feel free to apply.Should have a minimum of 3-year experience in PHP or WordPressShould have advanced proficiency in PHP including modern PHP practices( OOP, MVC, Namespace, autoloading, Traits, and Design Pattern )Should have knowledge on integration of third-party APIsGood Knowledge of databasesShould have sound knowledge of core javascript, ajax or fluent in any one javascript framework like react, Vue, angularFamiliarity with package managers such as Composer and NPM.Sound Knowledge of anyone PHP framework like CodeIgniter, Laravel, SymfonyShould have Knowledge of Git, SVNKnowledge of WordPress, Plugin anatomy would be plusShould be able to lead a team for WordPress DevelopmentShould be able to work in a teamContribution to open source project would be a huge plus ,If you have created any WordPress plugin attach the link or send a zip file.Job DescriptionDevelop WordPress Plugins from scratch.Carry out team planning as well as product planning.Fixing bugs and small enhancements that come into our WordPress plugins.Refactoring legacy code with particular attention to backward compatibility.Maintain and enhance existing WordPress Products, modules, and Applications.Initiating new ideas for new modules, products.Company Benefits:5 working days a weekTimely salary reviewBonus for the dedicated employeeTimely refreshment and outing programsA serene working environment with inhouse Table tennis and Badminton court, Carrom Board, DartBoard, and Chess to play and enjoy the break timeWe provide Lunch, Snacks, Tea, and coffeesNote: Due to the current COVID 19 pandemic, this is currently a 'Work From Home' job. Interviews and all will also be done virtually. Once this situation is under control, this will be an office job.Applying ProcedureInterested candidates can send links, Projects, GitHub repo links of your best work till now along with CV and Cover letter viahttps://themegrill.com/apply-now/.", "Page_URL": "https://merojob.com/senior-php-developer-wordpress/"}, {"name": "React JS/React Native Developer", "company": "Diagonal Technologies", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Sankhamul, Lalitpur", "salary": "NRs. 30,000.00 - 100,000.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "CssReact NativeReactjsLaravel Framework", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software Engineer, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Sankhamul, LalitpurOffered Salary:NRs. 30,000.00 - 100,000.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:CssReact NativeReactjsLaravel FrameworkJob DescriptionDiagonal Technologiesis looking for aSenior React JS/React Native Developerto join our development team. Your role mainly will revolve around front-end (ReactJS/React Native). We are open to application from all levels and your experience is relevant depending on the level you wish to apply for.About You:Strong experience in a front-end JS/Typescript library.Primary:ReactJS, React NativeSecondary:FlutterCapable of maintaing your own css code as styled components.Strong knowledge in building web apps using Node.js, PHP (Laravel/Joomla/Magento) - Yes we always are in look for full-stack developerMust have good idea of OOP, Algorithm and at least one Relational Database Management System.Experience with Linux based system, and docker is desirablePreferably contribution to open source projects or shareable public repositoriesCurious about new technologiesHave good communication skills with good command over English languageWe Offer:Personal and professional growth opportunitiesFlexible working hours (given you meet the deadlines)Geographically distributed teamCompetitive salary (Please include expected salary on your application)Flexibility to work from home maximum of 4 days per month (10 days per month during COVID pandemic)P.S.This is a full-time position and not a freelancing positionAPPLY NOW", "Page_URL": "https://merojob.com/react-jsreact-native-developer/"}, {"name": "Senior Web Developer", "company": "Diagonal Technologies", "level": "Senior Level", "vacancy": "5", "time": "Full Time", "address": "Sankhamul, Lalitpur", "salary": "NRs. 50,000.00 - 350,000.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "FlutterNodejsLaravel FrameworkReactjsDbms", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software Engineer, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:Sankhamul, LalitpurOffered Salary:NRs. 50,000.00 - 350,000.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsAge:Less than 45 yearsProfessional Skill Required:FlutterNodejsLaravel FrameworkReactjsDbmsJob DescriptionDiagonal Technologiesand Our Partner company DVC.Ventures are looking for a Senior Web Developers to join our development team here in Nepal and in Germany.We are strictly looking for applicants with 3 or more years of experience. You do not need experineceAbout You:Strong knowledge in building web apps using Primary: PHP (Laravel, Typo3, Symfony) OR Node.js OR Java OR GolangMust have good idea of OOP, Algorithm and at least one Relational Database Management SystemGood knowledge of Messaging Queue and basic DevOps (Docker, Kubernetes, Swarm)Strong experience in a front-end JS/Typescript library.Primary:ReactJS, React Native, Vue JS, AngularGood knowledge of Serverless ComputationExperience with Linux based system is desirablePreferably contribution to open source projects or shareable public repositoriesCurious about new technologiesHave good communication skills with good command over English languageGerman Language Skills would be icing on the cake.Background of Machine Learning and AI are welcome to apply tooWe Offer:Personal and professional growth opportunitiesFlexible working hours (given you meet the deadlines)Geographically distributed teamCompetitive salary (Please include expected salary on your application)10 vacation days per year in addition to public holidays.5 days work week.Paid Relocation (Incase you apply and are picked for dvc.ventures)Accommodation Paid (Incase you apply and are picked for dvc.ventures)P.S.This is a full-time position and not a freelancing positionAPPLY NOW", "Page_URL": "https://merojob.com/senior-web-developer-46/"}, {"name": "WordPress Developer & Designer", "company": "eHostingServer", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Balkumari–9 , Ring Road", "salary": "NRs. 35,000.00 - 50,000.00 Monthly", "deadline": "Dec. 06, 2020 23:55\n(2 weeks from now)", "education": "Intermediate", "skills": "Web DesignPhpWordpress", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Graphic Designer, Programmer/ Software Engineer, Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Balkumari–9 , Ring RoadOffered Salary:NRs. 35,000.00 - 50,000.00 MonthlyApply Before(Deadline):Dec. 06, 2020 23:55\n(2 weeks from now)Job SpecificationEducation Level:IntermediateExperience Required:More than or equals to 2 yearsProfessional Skill Required:Web DesignPhpWordpressOther SpecificationDeveloperShould have a minimum of two year experience in WordPressAdvanced Knowledge about WordPress Themes and Plugins DevelopmentExperience with common WP plugins such as Elementor Page Builders, WooCommerce, GutenbergKnowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQueryExperience working with debugging tools such as Chrome Inspector and FirebugBasic Knowledge of database like MYSQLBasic Knowledge of Git, SVN would be a plusAbility to manage the projectGood communication skillsDesignerShould have a minimum of two year experience in WordPressAdvanced Knowledge about WordPress Themes and Plugins DevelopmentExperience with common WP plugins such as Elementor Page Builders, WooCommerce, GutenbergKnowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQueryExperience working with debugging tools such as Chrome Inspector and FirebugBasic Knowledge of database like MYSQLBasic Knowledge of Git, SVN would be a plusAbility to manage the projectGood communication skillsJob DescriptionDeveloperDevelopment of existing and new WordPress Themes and PluginsBug fixing of our WordPress ThemesConducting WordPress Themes Performance Tests.Working on new features for our WordPress ProductsCreating new ideas for our WordPress Products EnhancementDesignerDesign PSD/Sketch/HD/figma Mockup DesignStrong knowledge of Slicing ( HTML5, CSS3, JavaScript & jquery  ) in given deadlinesGood understanding of color combination & color contrastGood understanding of Typography & Font-facesDesigning webpage layout specially for WordPress ThemesAPPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-designer/"}, {"name": "Senior PHP Developer (m/f/x)", "company": "ITONICS Nepal", "level": "Senior Level", "vacancy": "10", "time": "Full Time", "address": "Kathmandu, Central Development Region, Nepal", "salary": "Negotiable", "deadline": "Dec. 07, 2020 23:55\n(2 weeks, 1 day from now)", "education": "Bachelor", "skills": "TeamworkCritical ThinkingPhpCreative Thinking", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[10]Employment Type:Full TimeJob Location:Kathmandu, Central Development Region, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 07, 2020 23:55\n(2 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TeamworkCritical ThinkingPhpCreative ThinkingOther SpecificationProactiveness and enthusiastic natureCreativity and InnovativenessExcellent teamworkSelf-motivated, positive attitude and strong zeal towards learningBE in Computer Science, BE in IT,B.Sc. CSIT, BIM, BIT, BCAJob DescriptionAre you eager to cut through the noise and bureaucracy of corporate software development?  Or just wanting to make a name for yourself in a dynamic team environment? Or perhaps looking for a reason to sharpen all of your skills? Anyone interested in cutting edge web and service-based development is welcome. ITONICS is looking for an enthusiastic Senior Php Developer to join our team.ITONICS is offeringA position with an established leader of innovation and strategic management enterprise software/solutions. Sounds boring so far. We are not focusing on millions of customers loving our location-based dating app. We make market-leading companies in all industries even stronger by boosting their innovation and strategic functions. This requires lots of solid development work and even more magic. If you are the type of person having fun within extreme complexity and building in some magic in your code - let’s talk! At ITONICS you’ll be part of industrial dawn of innovation through insight and collaboration. Building large scale solutions to answer both demanding high level and concrete questions about the future. Welcoming experienced developers with various levels of savviness and focuses, ITONICS has a place for anyone that is devoted to technology and forward-thinking. The ITONICS team is looking for eager and self-motivated individuals to drive solutions into the future.Please ONLY apply if you are available to undertake the position within Kathmandu, Nepal. Grab the chance to work in one of the most exciting and innovative areas in the industry in one of the most exciting cities on the globe - NOW! Please send us your resume (cover letter, CV) to us at[email protected]and state your availability.We need qualified PHP developers with at least four years of experience building and customizing large-scale Drupal sites. The PHP Developer will be responsible for software development for the web-based project. This position requires a strong knowledge of PHP development, as well as working knowledge of HTML, CSS, and JavaScript. We're not looking for the world's top experts in these technologies. We'd rather have someone on our team who can admit they don't know the answer to every problem but is confident in his or her ability to find an answer in a short amount of time. From all of our team members, we expect the following:Personal initiative - you are expected to be proactive, ask good questions, and identify solutionsStrong technical knowledge - previous experiences from which you can draw ideas, and a dedication to continued education and self-improvementDetail-oriented - ensure specifications are accurately translated into deliverables, and test work thoroughlyStrong troubleshooting skills - a curiosity to find the right answer, and research until a good solution is foundDedication to excellence - you take pride in the quality of your workAbove all, we need smart developers who have high standards for themselves, want to learn, and are dedicated to delivering the best possible solutions for clients. Candidates must be comfortable working in teams comprised of consulting, client, and third-party resources, have good communication skills, and a positive, can-do attitudeJob responsibilities:Software development from the initial specification, through to developing, testing and launchingWork collaboratively with other internal and external developers in a multi-dev environmentModify existing functionality of PHP-based codeTest, maintain and troubleshoot existing company web-based applicationsManage and improve site performance (speed, user experience, security)Required Qualification:Minimum 2-years experience of web development (PHP, Javascript, (X)HTML, AJAX, CSS, etc.)Good knowledge of relational databases, version control tools and of developing web services, Familiarity with tools such as Git, SVNComfortable working with debugging tools like Firebug, Chrome inspector, etc. Basically Strong troubleshooting skillsAbility to understand CSS/Javascript changes to have consistent style/impact across platforms and browsersAbility to communicate and work well with others, especially with remote team members through virtual channels such as Slack, email and project management tools. Basically, Good verbal and written communication skillsWell-rounded knowledge of web-based technologiesComfortable working in a collaborative environment with team members and clientsExperience with writing clean and well-documented codeFamiliarity with any CMS, e.g. Drupal (preferred), Wordpress, JoomlaIf you show a strong interest and are familiar with some of our technologies, let’s talk!Company Benefits:A friendly, competitive, and creative working environment with foreign managersCompetitive salary (Greater than the market for deserving candidates)5 working days in a week(10 am-6:30 pm)Powerful Laptops that you can also carry homeFree Lunch from a top-class restaurantPaid Leave, sick leave, vacation Leave, work from home facility available, Mourning Leave, Paternity Leave, Maternity Leave, and Social Security Fund.Refreshment, Recreational, team building activities (Comparatively higher than other company)Extra activity: Cricket, Futsal every week, Table Soccer and Table tennis board is at the officeNote:Salary Provided Based on Experience. No bar for Deserving CandidateCandidates who have previously applied for a job at ITONICS but were not shortlisted for interviews are also encouraged to applyCome on board! Our Kathmandu office is based in a town in a new and modern office building providing a world-class working environment and offer you a handsome salaryApplying Procedure:Please send us your resume(cover letter, CV)to us at[email protected]and state your availability.OR,APPLY NOW", "Page_URL": "https://merojob.com/senior-php-developer-mfx-2/"}, {"name": "Mean Developer", "company": "Aafanta Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)", "education": "Bachelor", "skills": "JavascriptAjax", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:JavascriptAjaxJob DescriptionQualification and ExperienceBachelor in Information Technology1-2 years of experience requiredSkillsPHP JavaScript, MYSQLJQUERY, AJAX, website & mobile Apps handlingApplying Procedure:Interested candidates are requested to send their updated resume at[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/mean-developer/"}, {"name": "Backend Developer", "company": "Sharelook PTE LTD", "level": "Senior Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 60,000.00 - 90,000.00 Monthly", "deadline": "Dec. 14, 2020 23:55\n(3 weeks, 1 day from now)", "education": "Bachelor", "skills": "CdkDevopsBack End DeveloperAws ArchitectNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 60,000.00 - 90,000.00 MonthlyApply Before(Deadline):Dec. 14, 2020 23:55\n(3 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:CdkDevopsBack End DeveloperAws ArchitectNode.JsOther SpecificationStrongly capable NodeJS developer, preferably experience with typescriptExperience with AWS and Lambda's a plus, training will be provided by senior AWS serverless professionalUnderstanding of cybersecurity and efficient codingExperience with DevOps a plusStrong Typescript developerExperience with CDK a plusAble to communicate effectively in EnglishAble to travel when neededJob DescriptionWe are looking for:Experienced NodeJS (Java script) developer.  (AWS architect is a plus)Be the technical product owner of an existing hybrid serverless backend system on AWSResponsibilitiesImplement security and optimisation improvementsImprove DevOps and automated CI/CD workflowBe responsible for ensuring security and privacy compliance in all backend codeOversee evolving the platform to AWS  (from Serverless framework) and typescript (from javascript)Responsible for publishing new changes to live and monitoring the live platformAPPLY NOW", "Page_URL": "https://merojob.com/backend-developer-28/"}, {"name": "Machine Learning", "company": "Sharelook PTE LTD", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 80,000.00 - 100,000.00 Monthly", "deadline": "Dec. 14, 2020 23:55\n(3 weeks, 1 day from now)", "education": "Bachelor", "skills": "Ai/MlDatabaseJupyterSparkPython Developer", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 80,000.00 - 100,000.00 MonthlyApply Before(Deadline):Dec. 14, 2020 23:55\n(3 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Ai/MlDatabaseJupyterSparkPython DeveloperOther SpecificationYour experience should include:Demonstratable practical experience with machine learning and data science techniquesProven competency in managing your own time and projectsCapable Python developer (with a focus on data science)Familiar with tools such as Jupyter, Spark, databases, etc.Familiar with AI/ML models and strategiesFamiliar with cloud-based ML services a plus (e.g. AWS Sagemaker, Athena, etc.)At least 3 years of relevant working experienceRelevant education a plusJob DescriptionThis is a very hands-on role covering the full data lifecycle: collection, preparation, analysis and reporting. As the lead data scientist you will be expected to be independent and take the initiative with new ideas and feature suggestions for the platform.Natural Language Processing (NLP) will often be a big part of what we do, understanding, interpretating and re-using written and spoken contentDeep learning for data categorisation, course design and content matchingData analytics to drive insights about study progress, knowledge gaps, learning goals, etc.Reporting directly to the owner, your responsibilities will include:Working with the user-facing teams to determine of ML can solve particular requirementsOwnership of all collected data, ensuring it is stored and accessible in a format optimised for data analyticsMonitoring and analysing collected data, and making suggestions on additional data that could be captured for new insightsDesigning and training of models to achieve new data insights and add or improve platform featuresAPPLY NOW", "Page_URL": "https://merojob.com/natural-language-processing/"}, {"name": "WordPress Developer", "company": "Web Experts Nepal", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 29, 2020 23:55\n(1 week from now)", "education": "Bachelor", "skills": "JavascriptJqueryCommunicationPhp Framework", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 29, 2020 23:55\n(1 week from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptJqueryCommunicationPhp FrameworkOther SpecificationQualification:Bachelors in related field is MUST but we do not undermine the skill sets possessed by a personnel who do not meet minimum education criteriaSkills:Should have 2+ year experience working with real time WordPress projectsShould have adequate knowledge in  PHP, MYSQL, JavaScript, jQueryGood knowledge in any PHP frameworks is a plusGood understanding of React is of high valueMust be comfortable working in multiple projects across different framework and platformShould be highly enthusiastic, eager to learn and have strong problem solving skillBe able to document your work and direct project hand-over documentation and/or usage guidesMust have strong communication and written skills (English)Job DescriptionSit with Technical Lead and Projects Coordinator in Requirement Analysis and Features BreakdownDiscuss with team for Estimates based on Features BreakdownSetup Working Environment and maintain files through version control (Git)Follow Company's Coding standards to achieve results with minimum (if not nil) deviationsDevelop and Test builds that meet Client's requirementPerform Unit Testing and make multiple commitsDeploy on staging or on client's serverProvide factual and detailed update document to clientHandle updates and take charge to complete the project based on the timeline and milestones sketchedConduct knowledge sharing session and should always be looking to introduce new and efficient development trendsCompany BenefitsCompetitive SalaryAmazing team of enthusiasts where learning never goes southLunch, Snacks, Tea & Beverages with other refreshmentsFlexible Time SlotTimely Performance Review and Salary IncrementAdrenaline and Adventurous excursions on timely basis along with Office partyDashain and Project/Performance bonusesTraveling allowanceApplying Procedure:Send your updated resume to[email protected]. We would schedule an interview from the final shortlist.OR,APPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-196/"}, {"name": "Wordpress Developer", "company": "Versatile Information Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Birendra Marg, Dill bazar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 30, 2020 23:55\n(1 week, 1 day from now)", "education": "Bachelor", "skills": "JavascriptCssHtmlPhpRestful", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Birendra Marg, Dill bazar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 23:55\n(1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavascriptCssHtmlPhpRestfulOther SpecificationSkills and Qualifications:At least 3 years’ experience working on WordPress platformProven Experience in PHP, mySQL,HTML,CSS and JavascriptExperience in customizing WordPress Plugins and WordPress themesKnowledge of CodeIgnitor, Laravel would be a plusAbility to use RestFul web services and experience in working withJSON and AJAX RequestExtremely detail-oriented with strong attention to detailsProactive and able to work autonomouslyFlexible in work functions and dutiesAbility to prioritise tasks and work on deadlinesMust be a team playerMust be able to work from homeNote:This role is not open for freshers and beginnersJob DescriptionBuilding websites and landing pages in WordPress themeCreating website architectureDesigning and managing the website back-end including database andserver integrationGenerating WordPress theme and pluginsConducting website performance testsTroubleshooting content issuesMonitoring performance of live websitePreparing comprehensive documentation including website manualDesigning and implementing new features and functionalityHelping formulate an effective, responsive design and turning it into aworking theme and pluginCollaborating with the marketing team to complete tasksWorking Hours:7:00 AM to 3:00 PM, Sunday to FridayApplying Procedure:Email us your CV and some samples at[email protected]ORAPPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-197/"}, {"name": "Laravel Developer", "company": "Global Interface", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "New Baneshwor", "salary": "Negotiable", "deadline": "Dec. 01, 2020 23:55\n(1 week, 2 days from now)", "education": "Bachelor", "skills": "MysqlPhpLaravel Framework", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:New BaneshworOffered Salary:NegotiableApply Before(Deadline):Dec. 01, 2020 23:55\n(1 week, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than 1 yearProfessional Skill Required:MysqlPhpLaravel FrameworkOther SpecificationProficient PHP proficiency in large, scalable web applicationsProficient proficiency with LaravelStrong understanding of REST APIs, SQL query authoring, performance tuning, relational database design and working with data at scaleVersion control systems, Git and GitHubFunctional understanding of Unix commands and environmentsGood communication skills and client-oriented attitudeProblem solving skills, analytical mind and positive attitudeResults oriented and focused on meeting deliverable timelinesEagerness to learn new ideas, concepts and technologiesJob DescriptionWrite technical and developed documentation for new and existing applicationsDevelop APIs and applicationsBuild efficient, testable, and reusable PHP modulesSolve complex performance problems and architectural challengesPerform unit and system-level testing using various testing frameworksBuild innovative, state-of-the-art applications and collaborate with the User Experience (UX) team.Ensure HTML, CSS, and shared JavaScript is valid and consistent across applicationsPrepare and maintain all applications utilizing standard development toolsUtilize backend data services and contribute to increase existing data services APIConvey effectively with all task progress, evaluations, suggestions, schedules along with technical and process issuesDocument the development process, architecture, and standard componentsKeep abreast of new trends and best practices in web developmentAPPLY NOW", "Page_URL": "https://merojob.com/laravel-developer-52/"}, {"name": "Quality Assurance Automation", "company": "AlphaBetaTheta Technologies", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Butwal", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "DebuggingQa AutomationCoding Skills", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:ButwalKathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:DebuggingQa AutomationCoding SkillsOther SpecificationHands-on professional development experience on testing API, Database and UIExperience with automation testing tools (selenium is preferred)Attention to detailExperience with version control system like gitExcellent research and debugging skillsAbility to work independently as well as with a team to analyze business requirements and develop solutionsClean coding skillsJob DescriptionWe are a growing team and we are seeking to hire a Quality Analyst to join our team. We are a motivated team of individuals handling diverse projects. If perfectionism is your style and finding bugs excites you, this is a great place for you!Gather and understand user requirementsCollaborate with team members to complete the assigned task.Write meaningful test cases with acceptance criteriaCreate a test planSeparate tests into automation and manual testsProduce high-quality automation scripts with a well-structured and organized codeFollow existing framework and suggest new ideas on the automation processProperly communicate databases migrations and schema when going to productionClearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challengesAPPLY NOW", "Page_URL": "https://merojob.com/quality-assurance-automation/"}, {"name": "Senior System Administrator", "company": "New IT Venture", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Basbari Kathmandu near Thai embassy", "salary": "Negotiable", "deadline": "Dec. 04, 2020 23:55\n(1 week, 5 days from now)", "education": "Bachelor", "skills": "Problem SolvingTeamworkTechnicalAnalytical", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Basbari Kathmandu near Thai embassyOffered Salary:NegotiableApply Before(Deadline):Dec. 04, 2020 23:55\n(1 week, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Problem SolvingTeamworkTechnicalAnalyticalOther SpecificationTechnical Requirements:Dynamic, energetic and goal-focused individual with a minimum of 1/2 years of relevant and progressive work experience in Software Development, DevOps and System AdministrationExperienced in CentOS and Ubuntu Linux server administration (Web (Nginx, Apache and Tomcat)/Database/Mail/DNS/Monitoring services)Basic Programming skills on PHP, Java, Python and Popular Scripting languages.Analyze current technology utilized within the company and develop steps and processes to improve and expand upon themDesign and implement build, deployment, and configuration managementBuild and test automation tools for infrastructure provisioningExperience in DevOps tools and Cloud Infrastructure like Docker, Jenkins, GIT, Kubernetes, Ansible, Nagios, AWS TechnologyManage CI and CD tools with teamDocument and design various processes; update existing processesExperience/Knowledge on Live Video Streaming technologies would be considered a meritPreference will be given to the candidate with certification in Linux System Administration / AWS / DevOpsJob DescriptionRoles and Responsibilities:Support development team by performing tasks such as planning, deployment, monitoring, and maintaining local and production infrastructure utilizing a mixture of on premise and cloud systemsPlan, deploy and maintain Media Head-end server, media streams as well as CDN (Content Delivery Network) infrastructure for New IT Venture Corporation.APPLY NOW", "Page_URL": "https://merojob.com/senior-system-administrator-7/"}, {"name": "Senior Software Engineer", "company": "Logpoint Nepal", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(1 week, 6 days from now)", "education": "Bachelor", "skills": "JavaPython", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(1 week, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavaPythonJob DescriptionWe are looking for highly motivated individuals for the position of Senior Software Engineer who are looking to grow their career in fast paced environment. You will be developing information systems by studying operations; designing, developing and installing software solutions; support and develop software team. The Senior Software Engineer will lead a team of developers responsible for building new and support existing applications.You must possess ability to prioritize tasks, communicate clearly, have a consistent track record of delivery and excellent software engineering skills. You need to be creative engineering balanced with high quality and a customer focus. Must be able to work across multiple facets of the project and juggle multiple responsibilities at the same time. Strong analytical capability and the ability to create innovative solutions is highly required to perform the responsibility.RequirementsBachelor's Degree/Master's degree in Computer Science is preferred.Fluent with imperative and object-­oriented languages knowledge of Java, Python with sound knowledge of the JVM and the ecosystem of supporting tools inside and outORFull stack development skills with a very good command over JavaScript language & Python and frameworks like Node JS/ React JSExperience working in an agile environmentExperience building complex web systems and applicationsFocused on performance and good knowledge on design patternsExperience implementing and consuming large scale web servicesEagerness and willingness to learn new technologiesKey ResponsibilitiesDevelop software solutions by studying information needs; conferring with users; studying systems flow, data usage and work processes; investigating problem areas; following the software development life-cycle.Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions.Update job knowledge by studying state-of-the-art development tools, programming techniques and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks;Mentor junior and mid-level engineers.Collaborate with team to brainstorm and create new products.Make informed decisions quickly and taking ownership of services and applications at scale.Work collaboratively with others to achieve goals.Be a persistent, creative problem ­solver.Remain cool and effective in a crisis.Stay on the leading edge of development practices.Passionate about technologies, especially open source.Understand business needs and know how to create the tools to manage them.BenefitsAttractive salary based on experience and qualifications.Gratuity and provident fund schemes.Working in a team environment where initiative and dedication is encouraged.An equal opportunity workplace that values diversity and does not discriminate.High level of responsibility and excellent career possibilities.Open international work environment.Festival expense allowance.Lunch and SnacksFitness PerkMedical and accident insurance.Applying ProcedureInterested Candidates must apply for the relevant job with cover letter and detailed CV. Applications should be submitted directly throughhttps://logpoint.bamboohr.com/jobs/view.php?id=7&source=otherNote that for your application to be taken into consideration you must apply through the relevant link on the Log point careers website.Deadline for applying is5thDecember.Only candidates under serious consideration for a vacant position will be contacted for the selection.", "Page_URL": "https://merojob.com/senior-software-engineer-44/"}, {"name": "PreSales Engineer (Associate/Mid Level)", "company": "Logpoint Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Dec. 05, 2020 23:55\n(1 week, 6 days from now)", "education": "Bachelor", "skills": "LinuxTime ManagementMultitaskingCommunicationFirewall", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 05, 2020 23:55\n(1 week, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:LinuxTime ManagementMultitaskingCommunicationFirewallJob DescriptionFor our Presales team, we are looking for outstanding engineers to play a key role in demonstrating capabilities of our SIEM, designing and deploying solutions to best fit customer’s requirement. A big part of the job is understanding customer needs, product demo, POCs, trainings, use case designs and implementation.You will be part of the 150+ Engineering Team which consists of Engineering Managers, Security Analysts, Architects, Support Engineers, DevOps, SecOps, QA and Software Engineers collaborating on the different components of the system, therefore, we are actively seeking individuals who can work efficiently on their own, but also take an active role of something bigger and meet expectations from other teams and colleagues.As we are in the cybersecurity domain, information security is prime objective of our solution, so if you know what ISMS means and take pride as a security analyst, we invite you to apply for this position.Job title depends on the experience of the applicants.RequirementsA good grasp of current technologies, network protocols, operating systems and network/information securityGood knowledge of Microsoft Windows server infrastructure, Firewall, Linux servers and cloud technologiesGood command over English and excellent communication skillsOpen minded, learner, adapter, self-organizerPast experience in security positions or customer facing role is a plusPast experience working with SIEM is a plusKnowledge of script and programming languages such as Python, Java or Power Shell is an advantage,Open to travel every now and thenPreSales Engineer is a professional who will be responsible to support and work with the direction of the Lead Architect and other related stakeholders by providing services related to software development.Following are the major job responsibilities:Drive customer engagements in an effort to achieve a technical winManage technical relationship of existing customers to ensure customer satisfaction and renewalsPartner with sales executives to plan, prepare and execute on strategic deals in complex sales cyclesSupport sales executives with solution selling into prospect account baseSuccessfully match customer pain/requirements to proposed solutionsCreate and deliver powerful presentations and demos that clearly communicate the uniqueness of the value propositionManage all technical aspects of RFP / RFI responsesEffectively communicate client needs to the R&D teams for future product enhancementsCollect and document competitive intelligenceIndependently manage the implementation of LogPoint from requirement collection, solution design, implementation, validation and verification.Conduct LogPoint trainings and knowledge transfer sessions across all product linesBenefitsAttractive salary based on experience and qualifications.Gratuity and provident fund schemes.Working in a team environment where initiative and dedication is encouraged.An equal opportunity workplace that values diversity and does not discriminate.High level of responsibility and excellent career possibilities.Open international work environment.Festival expense allowance.Lunch and SnacksFitness PerkMedical and accident insurance.Applying ProcedureInterested Candidates must apply for the relevant job with cover letter and detailed CV. Applications should be submitted directly throughhttps://logpoint.bamboohr.com/jobs/view.php?id=18&source=otherNote that for your application to be taken into consideration you must apply through the relevant link on the Log point careers website.Deadline for applying is5thDecember.Only candidates under serious consideration for a vacant position will be contacted for the selection.", "Page_URL": "https://merojob.com/presales-engineer-associatemid-level/"}, {"name": "Microsoft Dynamics 365 /Power Platform Developer", "company": "Agile Solutions", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Gairidhara, Kathmandu", "salary": "Negotiable", "deadline": "Dec. 07, 2020 23:55\n(2 weeks, 1 day from now)", "education": "Bachelor", "skills": "Project ManagementMicrosoft Dynamics 365 Crm And Pow…Sql Server", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Gairidhara, KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 07, 2020 23:55\n(2 weeks, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsAge:More than 18 yearsProfessional Skill Required:Project ManagementMicrosoft Dynamics 365 Crm And Pow…Sql ServerOther SpecificationStrong written communications\nespecially related to articulating technical specificationsExperience\nin customizations, JavaScript, C#, .NET, HTML, SQL Server, SSRS including\nplugins, scripting, and form creationExperience\nwith CRM API, REST/ODATA, and SOAP endpointsStrong\nunderstanding of and ability to configure security groups, roles, and\nteamsThe high degree of insight and\nanalytical skillTeam-oriented; willing to align work\nwith team’s priorities and goalsKnowledge\nof the O365 platform as it pertains to feature sets that integrate with\nDynamics CRM solutions including SharePoint and OneDrive/OneNoteFamiliarity\nwith Data Export Service and Azure SQLSSIS\nor other ETL technologiesExperience\nworking with consulting services industry or salesforce automation/project\nservice automation solutionsMicrosoft\nCertificationJob DescriptionResponsible for software\nconfiguration, documentation, implementation, training, and support of Microsoft\nDynamics 365 CRMArchitecting the CRM system, related\ncustomizations, and reports to model the business’ organizational processSupport existing client base with\nsupport issues that ariseAnalyze existing processes and\ndevelop recommendations to improve client performanceMeet deliverable targets and\ncomplete project tasks within budget and to clients’ satisfactionBuilding and configuring CRM forms,\nviews, dashboards, and workflowsDeveloping PowerBI / SSRS reports\nusing Microsoft SQL and FetchXMLIdentify assignment conflicts and\nissues and communicate to Project ManagerBuild positive client relationships\nwhile developing an understanding of customers’ businessesAssist in the integration of\napplication componentsClose cooperation with client teams\nand follow up business requirementIntegrate existing systems and\nservices into the CRM architectureAPPLY NOW", "Page_URL": "https://merojob.com/microsoft-dynamics-365-power-platform-developer/"}, {"name": "SEO Specialist", "company": "HLE Nepal", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Jawalakhel,Lalitpur", "salary": "Negotiable", "deadline": "Nov. 30, 2020 23:55\n(1 week, 1 day from now)", "education": "Bachelor", "skills": "JavascriptCssHtml", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Jawalakhel,LalitpurOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 23:55\n(1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavascriptCssHtmlOther SpecificationQualification andExperience:BS/MS degree in a quantitative, test-driven field3+ years as SEO SpecialistSkills:Proven SEO experienceSolid understanding of performance marketing,conversion, and online customer acquisitionSolid experience with website analytic tools (e.g, Google Analytics, SEMRush etc)Experience with A/B and multivariate experimentsWorking knowledge of HTML, CSS, and JavaScript development and constraintsKnowledge of ranking factors and search engine algorithmsUp-to-date with the latest trends and best practices in SEOAdvanced written and verbal communication skills.Able to training othersAdvanced Google doc skillsAble to work with minimum supervisionAbility to work under pressureDriven and a strong desire to learnTeam playerQualification:Google Fundamentals of Digital MarketingJob DescriptionExecute tests, collect and analyze data and results, identify trends and insights in order to achieve maximum ROI in organic trafficSupport PPC initiatives and campaignsWork with the content team to optimize copy and landing pages for search engine marketingPerform ongoing keyword discovery, expansion and optimizationResearch and implement search engine optimization recommendationsResearch and analyze competitor strategiesDevelop and implement link building strategyWork with the development team to ensure SEO best practices are properly implemented on newly developed codeWork with editorial and marketing teams to drive SEO in content creation and content programmingRecommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords.Document content SEO processes and propose innovative improvements.Ensure team activities are aligned with project objectives and stakeholders expectations.Provide regular updates to key stakeholders.Any other relevant duties as required from time to time.The Benefits of Joining Us:Get to work with one of our top outsourcing partnersA secure long-term rolePaid annual leave and sick leavePaid maternal and parental leavesA 5-day work week except for 1 Sunday of the monthAn environment that values continuous learning and developmentOffice-sponsored daily breakfasts and other benefitsRecreation room to unwind and chill!Parties and events – we want you to have some fun at work!Accident and health insurance for you and your two family membersOffice sponsored 'Employee Assistance Program'Work Hours:8:00 am to 4:00 pm including 1-hour lunch breakApplying Procedure:Sounds like an opportunity for you? Send us your resume and cover letter to[email protected]with the subject line \"Career:SEO Specialist\", addressing all the essential requirements.Visithlenepal.com.npandhomeloanexperts.com.auto know more about us!Due to the high volume of applications received, we regret that only short-listed candidates will be contacted. Also note that we are working from home currently due to the Covid-19 lockdown, and will continue to do so in the coming months.OR,APPLY NOW", "Page_URL": "https://merojob.com/seo-specialist-45/"}, {"name": "IT Specialist", "company": "S.B.T International", "level": "Mid Level", "vacancy": "1", "time": "Part Time", "address": "Teku, Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)", "education": "Bachelor", "skills": "Problem SolvingAnalyticalReportingCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Part TimeJob Location:Teku, KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsAge:More than 30 yearsProfessional Skill Required:Problem SolvingAnalyticalReportingCommunicationOther SpecificationDegree in computer science or related field is preferableMore than 3 years of experienceStrong analytical, diagnostic, and problem-solving skillsGood communication ability, both written and verbalPersonable, professional demeanorTechnical understandingProcess improvementData processingReporting research resultsNetworking knowledgePresenting technical informationOperating systemsDocumentation skillsJob DescriptionInstalling\nnew software and hardware componentsRegularly\nevaluating our IT systems to ensure they meet the necessary demandsAssisting\nwith network administration tasksEnsuring\ndata storage is safe and secureResolving\nall issues coworkers have with their IT systems and softwareEducating\ncoworkers about network security and best practices for computer usageSupporting\nthe day-to-day operations of our computer networkMaintaining\nthe surveillance systemsMaintaining the company’s serversCandidates fulfilling the criteria mentioned above may send in their complete‘Curriculum Vitae (CV)to the email address mentioning thepositionyou are applying for.Email:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/it-specialist-10/"}, {"name": "Angular Developer", "company": "Palmmind IT", "level": "Senior Level", "vacancy": "3", "time": "Full Time", "address": "Pulchowk", "salary": "Negotiable", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "Css3HtmlNode.Js", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Senior LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:PulchowkOffered Salary:NegotiableApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Css3HtmlNode.JsOther SpecificationStrong Knowledge of Angular FrameworkWork as a part of an Agile teamBuild and maintain JS based code baseStrong knowledge of NodeJSGood problem-solving skillsStrong knowledge of developing and utilizing APIsJob DescriptionYou love working in an environment that provides\nsignificant opportunities for learning and growth. You don't just want\nto code, you want to solve real customer problems. You love working with\ncutting-edge technologies.Are you looking for the next big career\nmove ?Integration of user-facing elements developed by a backend developerFocus on coding and debugging and build high-quality reusable codeConduct UI tests and optimize performanceExperience with code merging and branching methodologies using GitOptimization of the application for maximum speed and scalabilityDefine and communicate technical and design requirementsBe involved and participate in the overall application lifecycleParticipate in conferences and educational programsFollow new and emerging technologiesShould be able to work with an existing project with little or no supervisionOther duties as per assigned by line managerAPPLY NOW", "Page_URL": "https://merojob.com/angular-developer-15/"}, {"name": "Front End Developer", "company": "Sharelook PTE LTD", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "NRs. 35,000.00 - 70,000.00 Monthly", "deadline": "Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)", "education": "Bachelor", "skills": "HtmlJavascriptCssReact Native", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NRs. 35,000.00 - 70,000.00 MonthlyApply Before(Deadline):Dec. 09, 2020 23:55\n(2 weeks, 3 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:HtmlJavascriptCssReact NativeOther Specification3+ years of experience in software development with a proven track record of technical developmentStrong working experience with ReactJS and its core principlesExperience working with back-end RESTful APIsExperience with HTML, CSS and JavaScript librariesKnowledge in AWS services, Cognito AWS amplify is a plusExperience with React Native is a big advantageGood communication in EnglishJob DescriptionWe are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.Front End Developers are required to work in teams alongside Back end Developers, Graphic Designers and User Experience Designers to ensure all elements of web creation are consistent. This requires excellent communication and interpersonal skills.Responsibilities:Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future useAPPLY NOW", "Page_URL": "https://merojob.com/front-end-developer-100/"}, {"name": "Android Native Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)", "education": "Bachelor", "skills": "InterpersonalAndroidNativeCommunicationKotlin", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Mobile AppsJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:InterpersonalAndroidNativeCommunicationKotlinOther SpecificationMinimum 2 years experience of Reactive / RxJava / Kotlin - Native, Knowledge of Flutter will have additional benefitGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNMust have hands on experience on multi threading architectureGood knowledge on RESTFUL API, JSON, HTML, CSS, Javascript, API, XMLGood Knowledge of Android Architecture Component (Live Data , View Model , Room, etc)Must be able to work with third party SDKShould have knowledge of Payment Gateway IntegrationKnowledge of Local Notification and Remote Push NotificationShould have brief knowledge of Android UI design guidelinesExcellent knowledge of offline storageExperience with writing clean and well-documented codeStrong communication skillAbility to perform as part of a team as well as individuallyAnalytical, positive and solution-oriented approach to problemsMust be able to work within provided deadlineJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/android-native-developer-2/"}, {"name": "React Js Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupandole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)", "education": "Bachelor", "skills": "Css3JavascriptHtml", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupandoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Css3JavascriptHtmlOther SpecificationMinimum 1 years experience in React JsThorough understanding of React.js and its core principlesExperience in user interface development including HTML, CSS, JavaScript.Experience in Asynchronous programmingGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNUnderstanding of functional components and hooksHave successfully completed at least 2 projectsJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/react-js-developer-3/"}, {"name": "iOS Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)", "education": "Bachelor", "skills": "TddGitCommunicationIos", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Mobile AppsJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TddGitCommunicationIosOther SpecificationMinimum 2 years experience of Objective-C or SwiftExperience with offline storage, and performance tuningFamiliarity with RESTful APIs to connect iOS applications to back-end servicesKnowledge of other web technologies and UI/UX standardsUnderstanding of Apple’s design principles and interface guidelinesKnowledge of low-level C-based libraries is preferredExperience with performance and memory tuning with toolsFamiliarity with cloud message APIs and push notificationsExcellent knowledge of offline storageExperience with writing clean and well-documented codeStrong communication skillGood knowledge of relational databases, version control tools, Familiarity with tools such as Git, SVNJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/ios-developer-105/"}, {"name": "Laravel Developer", "company": "Peace Nepal DOT Com", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)", "education": "Bachelor", "skills": "JavascriptTeamworkHtmlMysql", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Web Developer/Web DesignerJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:KupondoleOffered Salary:NegotiableApply Before(Deadline):Dec. 08, 2020 23:55\n(2 weeks, 2 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:JavascriptTeamworkHtmlMysqlOther SpecificationMinimum 2 years experience of web development (PHP Laravel,JavaScript, (X)HTML, AJAX, CSS, etc.)Good knowledge of relational databases, version control tools and of developing web services, Familiarity with tools such as Git, SVNAbility to understand CSS/JavaScriptchanges to have consistent style/impact across platforms and browsersExperience with writing clean and well-documented codeComfortable working with debugging tools like Firebug, Chrome inspector etc. Basically strong troubleshooting skillsGood knowledge on RESTFUL API, JSON, HTML, CSS,JavaScript, API, XMLStrong knowledge of MySQL and proficient in writing SQL queriesStrong communication skillAbility to perform as part of a team as well as individuallyAnalytical, positive and solution-oriented approach to problemsGood Knowledge of web Based Application/Website ArchitectureShould be able to work in teamJob DescriptionParticipate in project discussion/analysisCoding/ProgrammingReporting to Project ManagerLearning and using new technologiesManage and improve application performanceAPPLY NOW", "Page_URL": "https://merojob.com/laravel-developer-54/"}, {"name": "Software Developer", "company": "INFICARE", "level": "Mid Level", "vacancy": "5", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)", "education": "Bachelor", "skills": "Microsoft Sql ServerAsp.NetCommunicationClassic Asp", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[5]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 10, 2020 23:55\n(2 weeks, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:Microsoft Sql ServerAsp.NetCommunicationClassic AspOther SpecificationShould be at least Bachelor graduateMust have at least 1 years of experience in related fieldWorking experience in Web Applications is mustGood Knowledge of Microsoft SQL Server, Classic ASP,ASP.NETStrong Analytical, Problem Solving and Conceptual skillsAbility to handle pressure and meet tight deadlinesShould have excellent communication skill with fluent EnglishGood learning attitude and adaptive learning abilitiesJob DescriptionWork on different Web Base applicationsWork according to the given tasksCreates efficient and logical databasesDesigns and codes superior technical solutionsAnalyze requirements, create designs and architect solutions using formal methodsProducing code using .NET (C#)Work cooperatively in a project-focused development teamSoftware testingNote:We have facility of Work from Home during the time of LockdownApplying Procedure:Interested Candidates are requested to submit their updatedCVand aCoverletterthrough Email:[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/software-developer-122/"}, {"name": "Python Developer", "company": "Pathway Technologies", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Thapathali, Kathmandu, Central Development Region, Nepal", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "PythonMssqlWeb ApiMvcPostgresBootstrap", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Thapathali, Kathmandu, Central Development Region, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:PythonMssqlWeb ApiMvcPostgresBootstrapOther SpecificationWell versed in Python application development withDjangoStrong command in Python and PostgreSQL DatabaseGood knowledge of HTML5, CSS3, Bootstrap, jQuery and JavaScriptStrong communication skillsPick up new techniques wit steep learining curveAbility to work individually or in a teamExcellent logical and analytical skillsJob DescriptionAttend project meetings and communicate with clientsUnderstand project details and realize project deadlinesWrite codes with standard documentationConstantly learn, develop expertise and share within teamTake ownership of the project from planning to implementation/deliveryMust maintain expertise on the new technologiesFlexible and ready to accept new challengesSalary and BenefitsLunch facilitiesProvident fundCITOther benefitsApplication Procedure:Interested candidates meeting the given criteria are requested to send their updated resume and cover letter with job title to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/python-developers-6/"}, {"name": "Android Developer", "company": "Pathway Technologies", "level": "Mid Level", "vacancy": "3", "time": "Full Time", "address": "Thapathali, Kathmandu, Central Development Region, Nepal", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "Mobile Application DevelopmentTeamworkAndroid", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[3]Employment Type:Full TimeJob Location:Thapathali, Kathmandu, Central Development Region, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Mobile Application DevelopmentTeamworkAndroidOther SpecificationStrong interest in Mobile App developmentIndependent, self-motivated, and an avid passion in technologiesExperience with Java and android application developmentStrong user interface development experienceMust be flexible and capable of handling multiple projects/tasksTeam player with initiative to work on development projectsStrong enthusiasm to work on various mobile platformsJob DescriptionDesign and develop smartphone applications (Android)Participate in the architecture and design of the smartphone application and its platformImplement entire suite of the software in rapid deployment or development environmentConstantly learn and develop expertise in the software developmentMust maintain expertise on the new releasesReport senior team about the productFlexible and ready to accept new challengesSalary and Benefits:Lunch facilitiesProvident fundCITOther benefitsApplication Procedure:Interested candidates meeting the given criteria are requested to send their updated resume and cover letter with job title to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/android-developers-6/"}, {"name": "Frontend Developer", "company": "Smartmobe", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu, Nepal", "salary": "Negotiable", "deadline": "Nov. 27, 2020 23:55\n(5 days, 11 hours from now)", "education": "Bachelor", "skills": "Html5JavascriptCssNode.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Kathmandu, NepalOffered Salary:NegotiableApply Before(Deadline):Nov. 27, 2020 23:55\n(5 days, 11 hours from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:Html5JavascriptCssNode.JsJob DescriptionSkills & Requirements:Strong proficiency with HTML5, CSS & JavaScript.Familiarity with Jira, Redmine, or similar project management and issue tracking softwareExperience with responsive frameworksProficient with code versioning tools, such as: Git / Mercurial / SVN.Working experience with typescript and ES6+Experience in Angular 2.x. Working Knowledge of Angular 4.x would be a plusWorking experience with a modern JavaScript framework (Angular, React, Vue, etc… We use Angular 2.x)Knowledge of Node.js,, npm and its package managerExperience with TDD approach.Working knowledge of CSS preprocessors like Sass and LESS.Proficient understanding of cross-browser compatibility issues and ways to work around them.Seamlessly Switch Between Multiple ProjectsSolid Understanding of Object-Oriented Programming (OOP)APPLY NOW", "Page_URL": "https://merojob.com/frontend-developer-91/"}, {"name": "Front End Developer", "company": "Guras Technology Pvt Ltd", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "JavascriptCssHtmlJquery", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:JavascriptCssHtmlJqueryOther SpecificationDegree in Computer Science or related fieldUnderstanding of key design principlesProficiency with HTML, CSS, JavaScript and jQueryAlso Proficiency with React JsReact native will be additionalUnderstanding of server-side CSSUnderstanding of SEO PrinciplesExperience with graphic design applications such as Adobe IllustratorGood Knowledge on cross-browser and cross-device compatibilityCandidates with Python coding skills re encouraged to apply.Job DescriptionDetermining the structure and design of web pagesEnsuring user experience determines design choicesDeveloping features to enhance the user experienceStriking a balance between functional and aesthetic designEnsuring web design is optimized for smartphonesBuilding reusable code for future useOptimizing web pages for maximum speed and scalabilityUtilizing a variety of markup languages to write web pagesMaintaining brand consistency throughout the designCandidates withAPPLY NOW", "Page_URL": "https://merojob.com/front-end-developer-101/"}, {"name": "Full-Stack Developer", "company": "Guras Technology Pvt Ltd", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)", "education": "Bachelor", "skills": "Problem SolvingOrganizationalCommunicationProject Management", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 18, 2020 23:55\n(3 weeks, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:Less than or equals to 3 yearsProfessional Skill Required:Problem SolvingOrganizationalCommunicationProject ManagementOther SpecificationDegree in Computer ScienceStrong organizational and project management skillsProficiency with fundamental front end languages such as HTML, CSS and JavaScriptFamiliarity with JavaScript frameworks such as Angular JS, React and AmberProficiency with server side languages such as Python, Java, PHP and .NetFamiliarity with database technology such as MySQL, Oracle and MongoDBExcellent verbal communication skillsGood problem solving skillsAttention to detailCandidates with Python coding skills are encouraged to apply.Job DescriptionDeveloping front end website architectureDesigning user interactions on web pagesDeveloping back end website applicationCreating servers and databases for functionalityEnsuring cross-platform optimization for mobile phonesEnsuring responsiveness of applicationsWorking alongside graphic designers for web design featuresSeeing through a project from conception to finished productDesigning and developing APIsMeeting both technical and consumer needsStaying abreast of developments in web applications and programming languagesAPPLY NOW", "Page_URL": "https://merojob.com/full-stack-developer-43/"}, {"name": "Sr. Software Engineer - Node JS", "company": "Cloudyfox Technology", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "Html5JavascriptCss3Node.Js", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 3 yearsProfessional Skill Required:Html5JavascriptCss3Node.JsOther SpecificationSuperb and demonstrable advanced-level experience with NodeJSExperience writing native modules with NodeJSAdvanced working knowledge of JavaScriptExcellent object-oriented design skillsComfort with Linux and basic Linux system administration techniquesFamiliarity with JavaScript build and test automation systems such as Gulp, Grunt, MochaAbility to identify and apply common patterns and principles of software architectureExperience with GitTherefore, a basic understanding of front-end technologies is necessary as well.Strong proficiency with JavaScript and/or ES6/typescript/coffescriptKnowledge of Node.js and frameworks available for itUnderstanding the nature of asynchronous programming and its quirks and workaroundsGood understanding of server-side templating languages such as Jade, EJSGood understanding of server-side CSS preprocessors such as Stylus, Less, etcBasic understanding of front-end technologies, such as HTML5, and CSS3Understanding accessibility and security complianceUser authentication and authorization between multiple systems, servers, and environmentsIntegration of multiple data sources and databases into one systemUnderstanding fundamental design principles behind a scalable applicationUnderstanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimizing output to match the specific platformCreating database schemas that represent and support business processesImplementing automated testing platforms and unit testsPrevious experience with PHP Frameworks like laravel , Yii, CI and Wordpress is a plusJob DescriptionResponsible for managing the interchange of data between the server and the usersDevelopment of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-endIntegration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsImplementation of security and data protectionIntegration of data storage solutionsAPPLY NOW", "Page_URL": "https://merojob.com/senior-node-js/"}, {"name": "Software Developer in Test", "company": "Mukundo.COM", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Nov. 29, 2020 23:55\n(1 week from now)", "education": "Bachelor", "skills": "TroubleshootingJavascriptAnalyticalPython", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 29, 2020 23:55\n(1 week from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:TroubleshootingJavascriptAnalyticalPythonOther SpecificationBS/MS degree in Computer Science, Engineering or a related subject2+ years experience with the software development lifecycle (requirements analysis, design, code, integration & test)Experience working with programming languages such as JAVA, PythonIn depth knowledge of commonly used automation frameworks (e.g. Appium, WebDriver API/ JSON Wire Protocol and etc.)Hands-on experience as a software test engineerStrong knowledge of software QA methodologies, tools and processesExperience in writing clear, concise and comprehensive test plans and test casesStrong knowledge of software development lifecycle, testing process and toolsWeb UI Functional and compatibility/responsive testing experienceStrong analytical and troubleshooting skillsCan anticipate, identify, track, and resolve issues with limited support and directionExceptional attention to detailProactive and Self-organized and self-motivatedComfortable working in a fast paced, highly collaborative, dynamic work environmentShows creativity and initiative to improve product test coverage and effectivenessA passion for learning, innovation, objectivity, and teamworkJob DescriptionIn this role, you will be responsible for performing testing activities and raise the quality bar of the products. You will design, build, test, and deploy effective test automation solutions and apply appropriate automation technologies to meet the short and long-term goals of the company. To succeed in this position, you will be highly accurate, efficient, detail-orientated, organized, possess strong time-management skills and the ability to multitask.Create detailed, comprehensive and well-structured test plans and test casesEstimate, prioritize, plan and coordinate testing activitiesDesign, develop and execute manual and automation scripts using open source tools such as Python and SeleniumMonitor, track, and report on software failures and defectsDevelop and apply testing processes for new and existing products to meet quality standardsTrack quality assurance metrics, like defect densities and open defect countsCommunicate with both technical and business teams about quality and test reportsCome up with test strategy for the company and help raise the quality bar of the productsEvaluate product functionality and create test strategies and test cases to assess product qualityRecommend improvements in software to enhance user experienceWorks together with the software development team to enhance and improve productsNice to have:Experience with Agile methodologySelenium/Python/Java/C#Web Automation experiencee-commerce domain knowledgeMobile app testingNote:Please contact us if you meet the above mentioned qualificationsAPPLY NOW", "Page_URL": "https://merojob.com/software-qa-engineer-sdet-qa-software-tester/"}, {"name": "Senior Quality Analyst", "company": "Smartmobe", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)", "education": "Bachelor", "skills": "DocumentationAgileIos", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 19, 2020 23:55\n(3 weeks, 6 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 4 yearsProfessional Skill Required:DocumentationAgileIosOther SpecificationMinimum 4+ years of experienceExcellent knowledge and experience of mobile app testing (iOS/Android) & web app testingExcellent documentation skill to prepare test plans, test cases and test reportsExperience of automation testing tools like selenium, appium etcExcellent skills and experience to design and implement test procedures, test scripts, test cases in collaboration with other team membersExcellent knowledge and experience on agile/scrum software development methodologySelf motivated, positive attitude and keen to learn new testing tools & technologiesProactiveness and enthusiastic natureJob DescriptionWe are looking for a full-time Senior Quality Analyst with excellent technical skills, an out of the box thinker and a passionate tech professionalAnalyze user stories and functional specifications to help ensure the quality of mobile and web applicationsPrepare and execute test plans, test scripts, test cases and assure the quality of the projectEnsure the documentation and communication of test results and issues to the team and clientsLead QA team in a projectBugs/improvement with team members, project manager and other stakeholders through an issue tracking system of the companyContribute to improve the quality assurance process of the company through new researches, technologies and toolsWe offer:Attractive salary to match your performanceMedical and Accidental InsuranceInternet Allowance5 Working days onlyDashain BonusFlexible and creative working environmentRefreshment Parties and OutingsFree lunch/snacks/teaTraining and development programsApplying Procedure:If you think you are the perfect one for the above post then send your CV with cover-letter in pdf format to[email protected]Come and Be A Part of SmartMobe Family!!!SmartMobe Solutions, is an Equal Opportunity Employer. This company does not and will not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable lawOR,APPLY NOW", "Page_URL": "https://merojob.com/senior-quality-analyst-2/"}, {"name": "DevOps Engineer", "company": "Cloudyfox Technology", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "Dec. 04, 2020 23:55\n(1 week, 5 days from now)", "education": "Bachelor", "skills": "AwsAnsibleCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:KathmanduOffered Salary:NegotiableApply Before(Deadline):Dec. 04, 2020 23:55\n(1 week, 5 days from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 1 yearProfessional Skill Required:AwsAnsibleCommunicationOther SpecificationStrong Linux system administration backgroundKnowledge of at least one programming languageManaging production infrastructure with Terraform, CloudFormation, etcAbility to present and communicate the architecture in a visual formStrong knowledge of AWSConfiguration Management experience such as Ansible, Chef, Puppet, or similarJob DescriptionWe are looking for an experienced DevOps engineer that will help our team establish DevOps practice. You will work closely with the technical lead to identify and establish DevOps practices in the companyYou will establish configuration management, automate our infrastructure, implement continuous integration, and train the team in DevOps best practiceWorking on ways to automate and improve development and release processesImplement and improve the CI pipelineImplement, maintain and improve monitoring and alertingWorking with software developers and software engineers to ensure that development follows established processes and works as intendedBuild and maintain highly available systemsEnsuring that systems are safe and secure against cybersecurity threatsAPPLY NOW", "Page_URL": "https://merojob.com/devops-engineer-20/"}, {"name": "iOS Developer", "company": "Pathway Technologies", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Thapathali, Kathmandu, Central Development Region, Nepal", "salary": "Negotiable", "deadline": "Dec. 03, 2020 23:55\n(1 week, 4 days from now)", "education": "Bachelor", "skills": "IosMobile Application DevelopmentTeamwork", "desct": "Basic Job InformationJob Category:IT & Telecommunication>Programmer/ Software EngineerJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Thapathali, Kathmandu, Central Development Region, NepalOffered Salary:NegotiableApply Before(Deadline):Dec. 03, 2020 23:55\n(1 week, 4 days from now)Job SpecificationEducation Level:BachelorExperience Required:Not RequiredProfessional Skill Required:IosMobile Application DevelopmentTeamworkOther SpecificationStrong interest in Mobile App development in Apple’s iOS platformFamiliar with Objective-C or Swift and integrating RESTful APIsCollaborating with the design team to define app featuresEnsuring quality and performance of application to specificationsIdentifying potential problems and resolving application bottlenecksFixing application bugs before final releasePublishing application on App StoreMaintaining the code and atomization of the applicationDesigning and implementing application updatesJob DescriptionParticipate in the architecture and design of the smartphone application and its platformIndependent, self-motivated, and an avid passion in technologiesMust be flexible and capable of handling multiple projects/tasksTeam player with initiative to work on development projectsMust maintain expertise on the new releasesReport senior team about the projectFlexible and ready to accept new challengesSalary and Benefits:Lunch facilitiesProvident fundCITOther benefitsApplication Procedure:Interested candidates meeting the given criteria are requested to send their updated resume and cover letter with job title to[email protected]OR,APPLY NOW", "Page_URL": "https://merojob.com/ios-developer-106/"}, {"name": "Digital Marketing Expert", "company": "", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Putalisadak, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 29, 2020 23:55\n(1 week from now)", "education": "Bachelor", "skills": "Time ManagementMultitaskingMarketingCommunication", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:Full TimeJob Location:Putalisadak, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 29, 2020 23:55\n(1 week from now)Job SpecificationEducation Level:BachelorExperience Required:More than or equals to 2 yearsProfessional Skill Required:Time ManagementMultitaskingMarketingCommunicationOther SpecificationCompletion of Bachelors DegreeMore than 2 years of experience in related fieldProven working experience in social media marketing or as a digital marketing expertDemonstrable social networking experience and social analytics tools knowledgeAdequate knowledge of web design, web development and SEOKnowledge of online marketing and good understanding of major marketing channelsPositive attitude, detail and customer oriented with good multitasking and organizational abilityJob DescriptionPlan and execute all digital marketing, including SEO/SEM, marketing database, email, social media and display advertising campaignsDesign, build and maintain our social media presenceMeasure and report performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)Brainstorm new and creative growth strategiesCollaborate with internal teams to create landing pages and optimize user experienceUtilize strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch pointsAPPLY NOW", "Page_URL": "https://merojob.com/digital-marketing-expert-18/"}, {"name": "WordPress Developer", "company": "", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Butwal", "salary": "Negotiable", "deadline": "Nov. 30, 2020 14:45\n(1 week, 1 day from now)", "education": "Bachelor", "skills": "Html5Web DesignWeb DevelopmentWordpress", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:ButwalNepalgunjBiratnagarKathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 14:45\n(1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than 1 yearProfessional Skill Required:Html5Web DesignWeb DevelopmentWordpressJob DescriptionAt least 1 years of WordPress development experience building custom WordPress applicationA must experience in customization of premium plugins.Understanding of all things WordPress: WP installation, coding & security best practices, Custom Post Types, etcExcellent Skills with Javascript, CSS, XML, Jquery and a must experience in the Bootstrap framework.Basic understanding of VPS Hosting, SFTP, and ability to work with DevOps support to troubleshoot server issuesStrong portfolio of WordPress websites with examples of your work along with a description of your role in the projectAPPLY NOW", "Page_URL": "https://merojob.com/wordpress-developer-198/"}, {"name": "AngularJS Developer", "company": "", "level": "Senior Level", "vacancy": "2", "time": "Full Time", "address": "Baluwatar, Kathmandu", "salary": "Negotiable", "deadline": "Nov. 30, 2020 16:20\n(1 week, 1 day from now)", "education": "Bachelor", "skills": "JavascriptCssHtmlAngularExperience With Restful Services", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Senior LevelNo. of Vacancy/s:[2]Employment Type:Full TimeJob Location:Baluwatar, KathmanduOffered Salary:NegotiableApply Before(Deadline):Nov. 30, 2020 16:20\n(1 week, 1 day from now)Job SpecificationEducation Level:BachelorExperience Required:More than 2 yearsProfessional Skill Required:JavascriptCssHtmlAngularExperience With Restful ServicesJob DescriptionDelivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building RESTful APICommunicating with external web services.APPLY NOW", "Page_URL": "https://merojob.com/angularjs-developer-6/"}, {"name": "IT Officer", "company": "", "level": "Mid Level", "vacancy": "1", "time": "Contract", "address": "", "salary": "", "deadline": "", "education": "", "skills": "", "desct": "Basic Job InformationJob Category:IT & TelecommunicationJob Level:Mid LevelNo. of Vacancy/s:[1]Employment Type:ContractApply Before(Deadline):Nov. 26, 2020, midnight (3 days, 11 hours from now)योग्यता:लोक सेवा आयोगले लिने “कम्प्युटर अधिकृत” पदको न्युनतम योग्यता वा मान्यता प्राप्त शिक्षण संस्थाबाट Computer वा Information and Communications Technologies वा सो सरहको विषयहरु लिई स्नातक उत्तिर्ण गरेको |उमेर :पुरुषहरुको हकमा- २१ वर्ष पुरा भई ३५ वर्ष ननाघेको, महिलाहरुको हकमा-२१ वर्ष पुरा भई ४० वर्ष ननाघेको।आवश्यक कागजात:व्यक्तिगत विवरण, नागरिकताको प्रमाणपत्र, शैक्षिक योग्यताका प्रमाण पत्र (नेपाल बाहिरको प्रमाणपत्र भए नेपालको विश्वविद्यालयबाट equivalence गरिएको प्रमाणपत्र), कार्य अनुभव भए अनुभवको प्रमाण पत्रहरू तथा अन्य कागजातहरु।कार्य शर्त विवरण (TOR):गाउँपालिकाको वेवसाईट (www.sidingbamun.gov.np) मा उपलब्ध रहेको छ।आवेदन शुल्क:रू १००० /- (अक्षरमा रू एक हजार मात्र)बैंक:लक्ष्मी बैंक लिमिटेड, सिदिङ्वा शाखा, साब्लाखु, ताप्लेजुङखाता नं. :०९३०३००००२१ (सिदिङ्वा गा. पा. आन्तरिक राजश्व खाता)दरखास्त दिने अन्तिम मिति:२०७७/०८/१०Applying Procedureकोरोना प्रकोपको कारण इमेल([email protected])मार्फत पनि आवेदन दिन सकिनेछ | इमेल मार्फतआवेदन दिने प्रकृया बारे थप सम्पर्कको लागी क.अ. नारायण अर्याल-९८५२६४४६९९आवेदन परेका मध्येबाट छोटो सुची (short list) प्रकाशन पश्चात परिक्षाको मिति तोकिने छ |", "Page_URL": "https://merojob.com/it-officer-390/"}]