[{"name": "Data Operator(378 views)", "company": "Mphasis Tech Foundation Pvt. Ltd.", "time": "Full Time", "deadline": "November 27, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Mphasis Tech Foundation Pvt. Ltd.Mphasis Tech Foundation Pvt. Ltd.is seeking competent, smart and energetic Nepalese candidates for the following position:Position: Data OperatorNumber of Vacancies: FewMINIMUM REQUIREMENT::AGE:Not exceeding 30 yearsQUALIFICATION :At least +2 completed in any discipline 6 month computer training or academic certification in computer related subjectSKILLS :– Typing speed and accuracy in Traditional or Romanized Nepali Unicode– Knowledge of using office equipmentCandidates fully meeting the mentioned requirements may apply in the address mentioned below. Please attach the copies of:Cover letter with mentioning the position applied forUpdated CV with a recent 2 recent passport size photographMark sheet and transcriptCharacter certificatesID documentsWORKING AREA:Bhadrapur Municipality(Note:– Priorities are giving to candidates from Bhadrapur Municipality)Contact us @ Mobile No.:– 9842103209 / 9828570003E-mail:– tiwariarjun191@gmail.comThe Mphasis Tech Foundation Pvt. Ltd. reserves the right to reject any/ all applications without assigning whatsoever.Last date of Application:30 November 2020.", "Page_URL": "https://www.merorojgari.com/job/data-operator/", "websitename": "merorojgari.com"}, {"name": "Graphic Designer(347 views)", "company": "Raspberry Solution Pvt. Ltd.", "time": "Full Time", "deadline": "November 22, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Raspberry Solution Pvt. Ltd.Position: Graphic DesignerRequirements:01Salary:NegotiableJob Location:New Baneshwor, KathmanduJob DescriptionPrepare work to be accomplished by gathering information and materials.Should have creative skill, originality, and create high-quality visual designs.Understand business priorities, the targeted set, and demands.Manage workflow/prioritization, deadlines, and deliverables of all designs.Collaborate with the team through creative briefs and deliver excellent designs and monitor results.Stay up to date with the latest trends to keep the company at the forefront of design and embed a culture of creative curiosity within the department.Willing to assist different internal departments who seek help for designs.Job SpecificationBachelors graduate.Strong graphic design skills with knowledge of Advanced Adobe Photoshop and other Adobe software.Should have good communication skillsExceptional creativity, innovation, and flexibility.Professional approach to time and deadlines.Interested candidates can attach their CV and send an email tojobs@raspberry.com.np", "Page_URL": "https://www.merorojgari.com/job/graphic-designer-2/", "websitename": "merorojgari.com"}, {"name": "Machine Learning Engineer(372 views)", "company": "Chulo Solutions", "time": "Part Time", "deadline": "November 19, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Chulo SolutionsPosition: Machine Learning Engineer – Part TimeWe are looking for:An expert in machine learning to help us to design and build an online e-learning program.A person who can work part-time for about 15 – 20 hours a week. (It is remote work. Working hours can be decided according to your circumstances.)Required skills:Advanced degree in computer science, math, statistics or a related disciplineExtensive data modeling and data architecture skillsProgramming experience in PythonExperience in machine learning frameworks in python such as TensorFlow or KerasStrong knowledge about machine learning and deep learning algorithms such as k-Nearest, NLP and sequence modeling, along with CNNStrong written and verbal communications in EnglishCore responsibilities:Create, check, and modify online courses about machine learningCommunicate with the foreign team for any improvement in our online programsResearch, Design and Frame Machine Learning SystemsUnderstand and Transform the Prototypes of Data ScienceVerifying data quality, and/or ensuring it via data cleaningPerform Machine Learning Model Tests and ExperimentsDevelop the Machine Learning Model as per the NeedSelect and Implement Right Machine Learning AlgorithmsUnderstand Business Objectives and Developing the ML ModelsCompany benefits:Friendly, creative working environment with a foreign teamWorking with the latest technologiesTimely salary reviewRemote working policyApplying Procedure:If you believe you are the one and have a passion to work with us,APPLY NOWwithYour recent resume in PDF formatYour desired weekly working hours and monthly salaryatrecruit-ml@namespace.jp.We are looking forward to receiving your application!", "Page_URL": "https://www.merorojgari.com/job/machine-learning-engineer-part-time/", "websitename": "merorojgari.com"}, {"name": "Front End Developer(462 views)", "company": "kpiinstitute", "time": "Full Time", "deadline": "November 11, 2020", "desct": "VACANCY ANNOUNCEMENTOrganization: The KPI InstitutePosition: Front End DeveloperThis is full-time remote job.Your main responsibilities include:Collaborate with business analysts and developers to produce software layout;Transform software designs and specifications into high functioning code in the appropriate language;Integrate software layout with functional API;Cooperate with web designers to match visual design intent;Edit content and re-design web pages;Test code periodically to ensure it produces the desirable results and perform debugging when necessaryMaintain and expand our websites;Assist and support in the upkeeping of our websites.Perform upgrades to make software and systems more secure and efficient.We expect you to:Have extensive knowledge of HTML5 and CSS3;Have experience in working with Git,PHP, JavaScript/JQuery, Bootstrap, Redux/Axios, Vue;Have experience in working with frameworks (Laravel);Have experience in working with React;Good knowledge of relational databases (MYSQL);Have experience in working with SASS, Webpack, Selenium, Restful API, tailwindcss – would be a plus;Have experience with WordPress/ Magento – would be a plus;Be able to manage multiple tasks and prioritise work;Have the ability to work collaboratively as part of a project team;Have excellent English skills.", "Page_URL": "https://www.merorojgari.com/job/front-end-developer/", "websitename": "merorojgari.com"}, {"name": "SEO Content Writer(916 views)", "company": "Generating Leads", "time": "Full Time", "deadline": "November 9, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Generating LeadsPosition: SEO Content WriterWe are looking for a highly experienced SEO Content writer who has the capability to put the best content on the table.SALARY:Negotiable | Starting from Rs. 35,000/-DUTIES:♡ Perform accurate keyword research for our industry.♡ Analyse research results and record.♡ Plan work to be carried out according to research data.♡ Carry out the planned work in a fast and efficient manner as our industry is seasonal and requires constant updates on the website.♡ Create creative and informative blog posts.♡ Create and refresh current on-page descriptions including categories and products.♡ Assist with listing products on our website.♡ Check content and product listings on our website to ensure they are in-line with current SEO guidelines.♡ Discuss regularly with management, any upcoming events and plan SEO work accordingly.♡ Regularly monitor the use of SEO by other team members.♡ Update team members on any new or changed SEO methods.EXPERIENCE:♡ Previous experience with SEO practices is essential, specifically on business websites.♡ Knowledge of SEO fundamentals is essential.♡ Understanding of Google rankings and algorithms is essential.♡ Advanced and proficient use of search engines.♡ Advanced computer skills are essential.♡ Proven experience and understanding in the use of Microsoft applications.♡ Previous experience in website administration.♡ Advanced, excellent written and verbal communication skills.♡ Fast typing speed with high accuracy.The successful applicant must be a hard and fast worker as working to deadlines is paramount. The candidate must possess a high level of self-initiative and exemplary attention to detail.The candidate must have the ability to creatively inject on-page content into our website based on the research performed and according to SEO best practices.There is an expectation that the successful candidate will possess prior SEO knowledge and experience, therefore not require intense training and be able to contribute to the growth of our website immediately.", "Page_URL": "https://www.merorojgari.com/job/seo-content-writer/", "websitename": "merorojgari.com"}, {"name": "Software Engineer Trainee – .Net(387 views)", "company": "Verisk Nepal", "time": "Full Time", "deadline": "November 4, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Verisk NepalPosition: Software Engineer Trainee – .NetJob Location:LalitpurVerisk Business:Verisk AnalyticsCompany DescriptionAt the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.It’s the reason Verisk is part of the UN Global Compact sustainability initiative. It’s why we made a commitment to balancing 100 percent of our carbon emissions. It’s the aim of our “returnship” program for experienced professionals rejoining the workforce after time away. And, it’s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers’ problems.At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work® Certification for the fourth consecutive year. We’ve been recognized by Forbes as a World’s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk’s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.Job DescriptionJob Title: .NET TraineeRequirements :Good knowledge in one of the programming languages like .net, Java and SQL scripting / database management system would be consideredKnowledge in JavaScript frameworks (like: Angular 6+, AngularJS, KnockoutJS, JQuery), Web Markup Languages (HTML/HTML5, XML) and Style Sheet Language (CSS/CSS3)• Problem solving skillsGood knowledge curve – Ability to learn quickly and implementGood attitude towards learning and sharing.Good communication and interpersonal skillsGood organizational and time management skillsQualificationsBachelors in Computer Science / Information Technology or equivalent.Up to 1 year of working experience in development are also encouraged to applyAdditional InformationVerisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran’s status, age or disability.http://www.verisk.com/careers.htmlUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/software-engineer-trainee-net/", "websitename": "merorojgari.com"}, {"name": "Java Developer(631 views)", "company": "Cotiviti Nepal Pvt. Ltd.", "time": "Full Time", "deadline": "October 12, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Cotiviti Nepal Pvt. Ltd.Position: Java DeveloperResponsibilities• Involve in all stages of the project life cycle: requirements definition, design, and development.• Translate application stories and requirements into functional applications.• Write neat and clean code for desktop and web application.• Create test cases and follow test cases to implement the requirements.• Active participation in Project level discussion/meeting.• Prepare use case/ flow diagram when needed.• Regular follow up for tasks assigned from development phase to QAQUALIFICATIONS AND EDUCATION REQUIREMENTS• Bachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMUST HAVE SKILLS• At least 2 years of experience in Software development using J2SE and J2EE.• Experience in parallel and multithreaded programming• Knowledge of algorithms and data structures• Interest in achieving maximum performance from available hardware and software• Familiar with design patterns• UI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery)• Hands on knowledge on Spring Framework.• Strong knowledge of Relational Databases, SQL, and ORM technologies• Experience working with source control systems, such as Subversion, and GIT including branching and merging strategies.PREFERABLE SKILLS• Hands on knowledge on Apache Camel Framework• Knowledge of testing frameworks/methodologies (TestNG, JUnit, TDD)• Understanding of XML, JSON, web services technologies• Experience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)• Experience in Continuous Integration leveraging tools such as Bamboo and Maven.SOFT SKILLS• Ability to work independently or as part of a team• Experience of working in SCRUM/Agile team would be added value• Desire and ability to continuously improve, discover and expand the limits• Critical thinking, has an opinion on various technological topics.HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/java-developer-2/", "websitename": "merorojgari.com"}, {"name": "Project Manager(1049 views)", "company": "Cotiviti Nepal Pvt. Ltd.", "time": "Full Time", "deadline": "October 11, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Cotiviti Nepal Pvt. Ltd.Position: Project ManagerResponsibilitiesConduct and facilitate the planning.Help remove impediments and foster an environment for high-performing team dynamics, continuous flow, and relentless improvement.Conduct regular retrospective with focus on continuous improvement.Collaborate with Engineering managers & team members for engineering tasks.Communicate the details of project issues, impediments proactively with stakeholders in different locations.Setup and coordinate the regular meetings with US PMs, technical teams etc. as required.Compile, collect, produce and publish report on different metrics.Skills & ExperienceAt least 2 years of experience in a similar roleKnowledge on US Healthcare systemFamiliar with JIRA, ConfluenceKnowledge of SQLFair understanding of technical practices & technological stacksUnderstanding of Agile, Kanban, Scrum, DevOps processes & toolsEffective presentation skillSoft SkillsPersuasive in both written and verbal communicationLeadership quality, motivatorLast date to apply: 9th November, 2020HOW TO APPLYApply Now", "Page_URL": "https://www.merorojgari.com/job/project-manager-22/", "websitename": "merorojgari.com"}, {"name": "Frontend Developer(662 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "September 9, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Frontend DeveloperDelta Tech is seeking a Frontend Developer who has proven working experience in HTML5, CSS3, JQuery and is also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaSalesCRM, DeltaRetailerApp and DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Understand the requirement clearly, think creatively to produce new ideas and concepts to interactive designConceptualize ideas that bring simplicity and user-friendliness to complex design roadblocksWork with internal team to design and build user-friendly forms/ applications/ interfaces based on functional specificationsWireframe new features and templates and improvements to existing functionalityBuild prototypes of new features, templates, and apps to demonstrate and test new designs.Design UI and interaction layers using best practices and the latest Web/ Mobile trendsOther SpecificationEducation Level: Bachelor of IT/ BE Computer EngineeringExperience Required: More than one yearShould be proficient in HTML5, CSS3, JQuery, and Bootstrap.Should have good knowledge on UI/ UX experience and developing pixel perfect designs on the frontendShould have creative skills on graphic designing tools like Photoshop, Illustrator etcShould have knowledge of color theory and updated with trendsShould have the knowledge of wireframe, prototype, mockupShould be creative and develop new ideasShould possess good communication and interpersonal skillYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeWhat we offerDelta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Position BenefitsCompetitive/ Attractive Salary (No bar for right and deserving candidate)Timely performance appraisal and salary reviewsPaid holiday & paid leavesFestive bonusGreat work cultureFlexible timings against performanceWork from home (During COVID-19 pandemic situation)Interested, enthusiast, and career-oriented candidates are encouraged to drop their resume atcareer@deltatechnepal.com", "Page_URL": "https://www.merorojgari.com/job/frontend-developer-3/", "websitename": "merorojgari.com"}, {"name": "Android Developer(533 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "August 14, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Android DeveloperOther SpecificationBachelor of IT/ BE Computer EngineeringMore than one year of experienceProven software development experience and Android skills developmentProven Working Experience in Android app developmentExperience with Android SDKExperience working with Remote Data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architecture, trends and emerging technologiesSolid understanding of the full mobile development lifecycleYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeJob DescriptionDelta Tech is seeking an Android Developer who is proven working experience in android app development with SDK and also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaRetailerApp, DeltaSalesCRM & DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Design and build advanced native applications for the Android platformCollaborate with cross-functional teams to define, design, and deliver new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performanceContinuously discover, evaluate, and implement new technologies to maximize development efficiencyCommunicate with clients to understand his requirements and deliverWhat we offer:Delta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Competitive/ Attractive Salary (No bar for right and deserving candidate)Festive bonusAnnual performance reviewGreat work cultureFlexible timings against performanceWork from home (during the COVID 19)Apply now and be the part of our dynamic team.Drop resume atcareer@deltatechnepal.comCall or text us at +977 9804067116 (Whatsapp & Viber)", "Page_URL": "https://www.merorojgari.com/job/android-developer-4/", "websitename": "merorojgari.com"}, {"name": "Sr. Android Developer(498 views)", "company": "Delta Tech Pvt. Ltd.", "time": "Full Time", "deadline": "August 14, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: Delta Tech Pvt. Ltd.Position: Sr. Android DeveloperOther SpecificationBachelor of IT/ BE Computer EngineeringMore than or equal to 3 yearsProven software development experience and Android skills developmentProven Working Experience in Android app developmentExperience with Android SDKExperience working with Remote Data via REST and JSONExperience with third-party libraries and APIsWorking knowledge of the general mobile landscape, architecture, trends and emerging technologiesSolid understanding of the full mobile development lifecycleYou areFluent in spoken and written EnglishAble to multitask and focus on deadlines under pressureTeam playerPassionate about new technologyExcellent team-working skills, hardworking, creative and innovativeJob DescriptionDelta Tech is seeking a Senior Android Developer who is proven working experience in android app development with SDK and also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaRetailerApp, DeltaSalesCRM & DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Design and build advanced native applications for the Android platformCollaborate with cross-functional teams to define, design, and deliver new featuresWork with outside data sources and APIsUnit-test code for robustness, including edge cases, usability, and general reliabilityWork on bug fixing and improving application performanceContinuously discover, evaluate, and implement new technologies to maximize development efficiencyCommunicate with clients to understand his requirements and deliverWhat we offer:Delta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Competitive/ Attractive Salary (No bar for right and deserving candidate)Festive bonusAnnual performance reviewGreat work cultureFlexible timings against performanceWork from home (during the COVID 19)Apply now and be the part of our dynamic team.Drop resume atcareer@deltatechnepal.comCall or text us at +977 9804067116 (Whatsapp & Viber)", "Page_URL": "https://www.merorojgari.com/job/sr-android-developer/", "websitename": "merorojgari.com"}, {"name": "WordPress Developer(692 views)", "company": "CodeGearThemes", "time": "Full Time", "deadline": "July 25, 2020", "desct": "VACANCY ANNOUNCEMENTCompany: CodeGearThemesPosition: WordPress DeveloperWe’re looking for a talented WordPress developer to join our full-time team. You need to be experienced in WordPress development, specifically theme development.Experience Required: 1 YearEssential experience:– WordPress Themes & Plugins– PHP, Js & HTMLTo Apply:Send  your CV to: info@codegearthemes.com", "Page_URL": "https://www.merorojgari.com/job/wordpress-developer-2/", "websitename": "merorojgari.com"}]