[
    {
        "image": "https://merojob.com/media/uploads/job_logo/19375f62-5062-4a61-9275-55f46df4afa9.jpg",
        "company": "ITONICS Nepal",
        "name": "Front-End-Engineer (m/f/x)",
        "level": "Senior Level",
        "vacancy": "[ 5 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 05, 2020 23:55\n(1 day, 9 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "D3.Js\nSass And Css3\nTypescript\nHtml5\nJavascript",
        "desc": "Are you eager to cut through the noise and bureaucracy of corporate software development?  Or just wanting to make a name for yourself in a dynamic team environment? Or perhaps looking for a reason to sharpen all of your skills? Anyone interested in cutting edge web and service-based development is welcome. ITONICS is looking for an enthusiastic Front-End-Engineer to join our team. ITONICS is offeringA position with an established leader of innovation and strategic management enterprise software/solutions. Sounds boring so far. We are not focusing on millions of customers loving our location-based dating app. We make market-leading companies in all industries even stronger by boosting their innovation and strategic functions. This requires lots of solid development work and even more magic. If you are the type of person having fun within extreme complexity and building in some magic in your code - let’s talk! At ITONICS you’ll be part of the industrial dawn of innovation through insight and collaboration. Building large scale solutions to answer both demanding high level and concrete questions about the future. Welcoming experienced developers with various levels of savviness and focuses, ITONICS has a place for anyone that is devoted to technology and forward-thinking. The ITONICS team is looking for eager and self-motivated individuals to drive solutions into the future. Please ONLY apply if you are available to undertake the position within Kathmandu, Nepal. Grab the chance to work in one of the most exciting and innovative areas in the industry in one of the most exciting cities on the globe - NOW! Please send us your resume (cover letter, CV) to us at jobs-kathmandu@itonics.de and state your availability.Your responsibilities will includeDevelopment of complex TypeScript single page applications using Angular 2+End to end delivery of concepts and prototypes in various technologiesWorking with a team in an agile environment (daily deliverables)Self-organized in daily workMaintaining readable, testable, and scalable codeWorking with state of the art technologies like TypeScript, Angular, Sass, IonicIf you show a strong interest and are familiar with some of our technologies, let’s talk!Company Benefits:A friendly, competitive, and creative working environment with foreign managersCompetitive salary (Greater than the market for deserving candidates)5 working days in a week(10 am-6:30 pm)Powerful Laptops that you can also carry home Free Lunch from a top-class restaurant.Paid Leave, sick leave, vacation Leave, work from home facility available, Mourning Leave, Paternity Leave, Maternity Leave, and Social Security Fund.Refreshment, Recreational, team building activities (Comparatively higher than other company)Extra activity: Cricket, Futsal every week, Table Soccer and Table tennis board is at the officeNote:Salary Provided Based on Experience. No bar for Deserving CandidateCandidates who have previously applied for a job at ITONICS but were not shortlisted for interviews are also encouraged to applyCome on board! Our Kathmandu office is based in a town in a new and modern office building providing a world-class working environment and offer you a handsome salaryApplying Procedure:Please send us your resume (cover letter, CV) to us at jobs-kathmandu@itonics.de and state your availability.OR,",
        "desc1": "Are you eager to cut through the noise and bureaucracy of corporate software development?  Or just wanting to make a name for yourself in a dynamic team environment? Or perhaps looking for a reason to sharpen all of your skills? Anyone interested in cutting edge web and service-based development is welcome. ITONICS is looking for an enthusiastic Front-End-Engineer to join our team. ",
        "desc2": "Development of complex TypeScript single page applications using Angular 2+End to end delivery of concepts and prototypes in various technologiesWorking with a team in an agile environment (daily deliverables)Self-organized in daily workMaintaining readable, testable, and scalable codeWorking with state of the art technologies like TypeScript, Angular, Sass, Ionic",
        "desc3": "Salary Provided Based on Experience. No bar for Deserving CandidateCandidates who have previously applied for a job at ITONICS but were not shortlisted for interviews are also encouraged to applyCome on board! Our Kathmandu office is based in a town in a new and modern office building providing a world-class working environment and offer you a handsome salary",
        "Page_URL": "https://merojob.com/frontend-developer-87/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/5b8039fd-58b7-4f86-b1c1-a9782e95e796.jpg",
        "company": "Verisk Nepal",
        "name": "Dot Net Developer : VN",
        "level": "Mid Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "NRs. 100,000.00 Monthly",
        "deadline": "Oct. 21, 2020 23:55\n(2 weeks, 3 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Asp.Net\nCommunication\nAws Services",
        "desc": "Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorship",
        "desc1": "Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!",
        "desc2": "Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorship",
        "desc3": "",
        "Page_URL": "https://merojob.com/dot-net-developer-vn/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/9c167935-df18-41e2-adac-56b7fb222f0e.jpg",
        "company": "Tekvortex",
        "name": "Senior/Mid .NET Developer",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Pulchowk, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Oct. 05, 2020 23:55\n(1 day, 9 hours from now)",
        "education": "Bachelor",
        "experience": "More than 2 years",
        "skills": "C# .Net\nCommunication\n.Net Core",
        "desc": "The opening presents a unique career development opportunity to skilled .NET developers by being a part of our expert team managing the Research and Development of several enterprise products and services globally. This position requires a minimum of 2 years of professional experience in software industry. We are looking for skilled .NET developers experienced in developing enterprise applications using C# on latest .NET frameworks. S/he must be a self-starter who can work independently with minimal supervision.ResponsibilitiesAnalyze product requirements and design/develop solutions to meet the requirementsWork on wide range of products and services encompassing data security/compliance, social media among othersMaintain, troubleshoot and enhance existing products and servicesPropose system improvements and offer alternative solutions to the different problems that may appear and proactively seek solutions to improve processes and applicationsTake active part in product design discussions with local and remote teamsWillingness to work in flexible hours overlapping with US office hoursDesired Skills & ExperienceExcellent coding skills with ability to write production-ready code quickly with minimum assistanceSound knowledge of Object Oriented Design and Development conceptExperience working with C# using latest .Net frameworks (including .Net Core) preferably on enterprise grade applications with SQL ServerExperience of developing and consuming Web Services. Knowledge of WCF will be a bonus.Ability to work effectively with huge code base and remote teams using version control tools (SVN, GIT)Must be an effective communicator, balancing business goals with engineering goalsExcellent interpersonal skills with ability to work and coordinate amicably with team members and managementExperience of having worked as a lead and prior involvement in development of Enterprise Application(s) will be a bonus.Candidates can also email their resume directly to jobs@tekvortex.com ",
        "desc1": "The opening presents a unique career development opportunity to skilled .NET developers by being a part of our expert team managing the Research and Development of several enterprise products and services globally. This position requires a minimum of 2 years of professional experience in software industry. We are looking for skilled .NET developers experienced in developing enterprise applications using C# on latest .NET frameworks. S/he must be a self-starter who can work independently with minimal supervision.",
        "desc2": "Analyze product requirements and design/develop solutions to meet the requirementsWork on wide range of products and services encompassing data security/compliance, social media among othersMaintain, troubleshoot and enhance existing products and servicesPropose system improvements and offer alternative solutions to the different problems that may appear and proactively seek solutions to improve processes and applicationsTake active part in product design discussions with local and remote teamsWillingness to work in flexible hours overlapping with US office hours",
        "desc3": "Excellent coding skills with ability to write production-ready code quickly with minimum assistanceSound knowledge of Object Oriented Design and Development conceptExperience working with C# using latest .Net frameworks (including .Net Core) preferably on enterprise grade applications with SQL ServerExperience of developing and consuming Web Services. Knowledge of WCF will be a bonus.Ability to work effectively with huge code base and remote teams using version control tools (SVN, GIT)Must be an effective communicator, balancing business goals with engineering goalsExcellent interpersonal skills with ability to work and coordinate amicably with team members and managementExperience of having worked as a lead and prior involvement in development of Enterprise Application(s) will be a bonus.",
        "Page_URL": "https://merojob.com/seniormid-net-developer-2/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/14afb21b-c406-47d2-ab6f-bb62fc8816ea.jpg",
        "company": "AlphaBetaTheta Technologies",
        "name": "Project Manager",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Butwal\nKathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 30, 2020 23:55\n(3 weeks, 5 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Creative Thinking\nCommunication\nProject Management\nInterpersonal",
        "desc": "We are a growing team and we are seeking to hire a Project Manager to join our team. We build custom applications using the latest and fastest technologies available in the market. We are a motivated team of individuals handling diverse IT projects. If you are passionate about handling unique challenges with a motivated team, this is a great place for you!  You have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta, through modern practices of software development. We have highly talented team members and boast of top notch quality software on every aspect. In this high-paced, creative environment, we know that our people will make all the difference in our success. Leading their success will be you, as a project manager. We need energy, curiosity and a relentless interest in creating the best requirement to delivery experience! The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life!  Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completionActs as the central point of contact for project-related activitiesBreakdown the requirements and assign individual team membersActively participate in all stages of SDLC from requirement to deliveryFacilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverablesManages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channelsForms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departmentsManages conflicting points of views to arrive at creative and responsive solutions. Influences completion of project activities through dotted line relationshipsManages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industryOther duties as assignedApplying Procedure:To apply for this position, please send an email: info@alphabetatheta.com or apply through the given link  http://alphabetatheta.comOR,",
        "desc1": "We are a growing team and we are seeking to hire a Project Manager to join our team. We build custom applications using the latest and fastest technologies available in the market. We are a motivated team of individuals handling diverse IT projects. If you are passionate about handling unique challenges with a motivated team, this is a great place for you!  ",
        "desc2": "Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completionActs as the central point of contact for project-related activitiesBreakdown the requirements and assign individual team membersActively participate in all stages of SDLC from requirement to deliveryFacilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverablesManages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channelsForms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departmentsManages conflicting points of views to arrive at creative and responsive solutions. Influences completion of project activities through dotted line relationshipsManages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industryOther duties as assigned",
        "desc3": "",
        "Page_URL": "https://merojob.com/project-manager-391/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/1b7e688b-193d-4482-a5a3-2a8e397caaed.jpg",
        "company": "AlphaBetaTheta Technologies",
        "name": "Back End Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Butwal\nKathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 30, 2020 23:55\n(3 weeks, 5 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Debugging\nResearch\nQa Automation\nCoding Skills",
        "desc": "We are a growing team and we are seeking to hire a C# Developer to join our team. We are a motivated team of individuals handling diverse projects. If getting the highest performance and reusability for your code excites you, this is a great place for you!  you have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta through modern practices of coding. We leverage the latest serverless architecture and technologies to make our backend as reliable as possible. You will be working with our team with its highly talented members who take pride on their code and analysis. In this high-paced, creative environment, we know that our people will make all the difference in our success.  We need energy, curiosity and a relentless interest in creating the best performance!The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life! Gather and evaluate user requirements from project managerCollaborate with team members to complete the assigned taskProduce high-quality backend solutions with a well-structured and organized code Properly communicate databases migrations and schema when going to productionCreate a JSON contract with front end team Clearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challengesApplying Procedure :To apply for this position, please send an email: info@alphabetatheta.com or apply through the given link  http://alphabetatheta.comOR,",
        "desc1": "We are a growing team and we are seeking to hire a C# Developer to join our team. We are a motivated team of individuals handling diverse projects. If getting the highest performance and reusability for your code excites you, this is a great place for you!  ",
        "desc2": "Gather and evaluate user requirements from project managerCollaborate with team members to complete the assigned taskProduce high-quality backend solutions with a well-structured and organized code Properly communicate databases migrations and schema when going to productionCreate a JSON contract with front end team Clearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challenges",
        "desc3": "",
        "Page_URL": "https://merojob.com/back-end-developer-11/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/062c326d-ca16-4954-ac39-7a54523a14e7.jpg",
        "company": "Dish Media Network",
        "name": "Junior Fiber Technician",
        "level": "Entry Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Bhaisepati",
        "salary": "Negotiable",
        "deadline": "Oct. 13, 2020 23:55\n(1 week, 2 days from now)",
        "education": "Intermediate",
        "experience": "Equals to 2 years",
        "skills": "Computer Operation\nSpreadsheets",
        "desc": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performance.To design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to Supervisor.To analyze overall optical power budget of Distribution Network. ",
        "desc1": "",
        "desc2": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performance.To design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to Supervisor.To analyze overall optical power budget of Distribution Network. ",
        "desc3": "",
        "Page_URL": "https://merojob.com/junior-fiber-technician/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/479df295-a6bd-40b7-b809-653e4feea66e.jpg",
        "company": "Pioneer Associate",
        "name": "Hybrid Mobile Apps Engineer",
        "level": "Mid Level",
        "vacancy": "[ 5 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "Negotiable",
        "deadline": "Oct. 04, 2020 23:55\n(9 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Angular Js\nTeamwork\nCommunication\nMvc.Net\nJavascript\nJquery",
        "desc": "QualificationsBE, BSCIT, Bachelor Degree in IT related field.1+ years of experience in mobile app development.Communication skill with strong quantitative background.Competent, smart, result-oriented and self-motivated.Ability to work well in a team.Knowledge & Skills Programming skill in phonegap, ionic, flutter, javascript, jquery, angular js.Knowledge and experience of MVC.NET.Knowledge of MVC and API will be an added advantage.Knowledge working with code repositories (SVN Git).Applying Procedure:The applicants are requested to send their resume within 06th Oct, 2020 on the following email id: hr@cosys.com.np. Only short listed candidates will be contacted for the further process of recruitment.OR,",
        "desc1": "Qualifications",
        "desc2": "BE, BSCIT, Bachelor Degree in IT related field.1+ years of experience in mobile app development.Communication skill with strong quantitative background.Competent, smart, result-oriented and self-motivated.Ability to work well in a team.",
        "desc3": "",
        "Page_URL": "https://merojob.com/hybrid-mobile-apps-engineer/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/03e0c5b0-d6fb-4a0a-974b-0f266f057274.jpg",
        "company": "Tekkon Technologies",
        "name": "Backend Developer (NodeJs / TypeScript)",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 12, 2020 23:55\n(1 week, 1 day from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Javascript\nGraphql\nNode.Js\nTypescript",
        "desc": "Creating and maintaining server-side application logic.Collaborate with front-end developers on combining their front-end elements and components with the server-side.Write high quality, readable, and testable code.Design and optimize applications for high performance, high availability, and low latency.Company Benefits:A friendly, competitive, and creative working environment with foreign managersCompetitive salary (No bar for deserving candidates)5 working days in a week(9 am – 5:30 pm)Timely salary review and performance bonus facilitiesAccess to the paid learning materials (udemy)Working with the latest technologiesLunch provided in the office (Currently Work From Home)Paid leave, sick leaveRefreshment, Recreational, team building activities.Applying Procedure:Interested candidates fulfilling the criteria mentioned above are highly encouraged to send a cover letter with their updated resume at jobs@tekkon.com.npOR,",
        "desc1": "Company Benefits:",
        "desc2": "Creating and maintaining server-side application logic.Collaborate with front-end developers on combining their front-end elements and components with the server-side.Write high quality, readable, and testable code.Design and optimize applications for high performance, high availability, and low latency.",
        "desc3": "",
        "Page_URL": "https://merojob.com/backend-developer-nodejs-typescript/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/cd9cba53-ef89-4e23-9391-09d3f5d8e4ef.jpg",
        "company": "Tech One Global",
        "name": "Software Engineer (.net)",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 10, 2020 23:55\n(6 days, 9 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Javascript\nCss\nMs-Sql\nAngularjs\n.Net",
        "desc": "Web Application development and IntegrationActively participate in product design reviews by providing creative and practical ideas and solutions in a teamwork environmentIf you are confident that you are ready work with a challenging & winning global team, apply today.Applying Procedure:Interested candidates are requested to send their updated CV at careersnp@techoneglobal.comor call us at 977-9802311210OR,",
        "desc1": "If you are confident that you are ready work with a challenging & winning global team, apply today.",
        "desc2": "Web Application development and IntegrationActively participate in product design reviews by providing creative and practical ideas and solutions in a teamwork environment",
        "desc3": "",
        "Page_URL": "https://merojob.com/software-engineer-net-12/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/5476251b-3c66-4d3c-8157-79b42bd66ae4.jpg",
        "company": "Foreveryng",
        "name": "Android Developer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Sanepa, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 02, 2020 23:55\n(4 weeks, 1 day from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Html5\nSql/Sqlite\nBug Fixing",
        "desc": "We are looking for an Android developer with 2 Years or more of Experience & responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.Skill RequiredKnowledge of Java Kotlin and Android StudioUnderstanding of Android Application Framework and Design Patterns Good understanding of UI placement, Wire frames and Design FlowGood understanding of REST Api, SQL/SQLite , HTML5 & ScriptingShould have Worked on bug fixing and improving application performance.",
        "desc1": "We are looking for an Android developer with 2 Years or more of Experience & responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.",
        "desc2": "Knowledge of Java Kotlin and Android StudioUnderstanding of Android Application Framework and Design Patterns Good understanding of UI placement, Wire frames and Design FlowGood understanding of REST Api, SQL/SQLite , HTML5 & ScriptingShould have Worked on bug fixing and improving application performance.",
        "desc3": "",
        "Page_URL": "https://merojob.com/android-developer-163/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/72624905-84ed-45b9-8e04-a9e8adebf07b.jpg",
        "company": "Sharelook PTE LTD",
        "name": "Front End Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "NRs. 35,000.00 - 70,000.00 Monthly",
        "deadline": "Oct. 16, 2020 23:55\n(1 week, 5 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "React Native\nJavascript\nCss\nHtml",
        "desc": "We are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.Front End Developers are required to work in teams alongside Back end Developers, Graphic Designers and User Experience Designers to ensure all elements of web creation are consistent. This requires excellent communication and interpersonal skills.Responsibilities:Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future use",
        "desc1": "We are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.",
        "desc2": "Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future use",
        "desc3": "",
        "Page_URL": "https://merojob.com/front-end-developer-97/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/ddc9a743-f5f7-4d15-89bb-362720af88b8.jpg",
        "company": "Himalayan Techies",
        "name": "HTML / CSS / JavaScript Developer",
        "level": "Mid Level",
        "vacancy": "[ 10 ]",
        "time": "Full Time",
        "address": "Babar Mahal, Kathmandu",
        "salary": "NRs. 20,000.00 Monthly",
        "deadline": "Oct. 31, 2020 18:00\n(3 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than 2 years",
        "skills": "Html5\nJavascript\nCss\nHtml\nJquery",
        "desc": "Good understanding of Javascript Beginner level familiarity with jQuery Good knowledge of HTML and CSSIn-Depth knowledge of CSS so that they could design-code keeping the responsiveness of the activities in mindMust have done at least 2 website or web app projects just to make sure about the fundamentals of web designing and web programmingKnowledge of AJAX, animation libraries, and UX would be a plusBonus skills adobe aftereffectsApplying Procedure:Interested candidates are requested to send their resume at careers@himalayantechies.com OR,",
        "desc1": "Applying Procedure:",
        "desc2": "Good understanding of Javascript Beginner level familiarity with jQuery Good knowledge of HTML and CSSIn-Depth knowledge of CSS so that they could design-code keeping the responsiveness of the activities in mindMust have done at least 2 website or web app projects just to make sure about the fundamentals of web designing and web programmingKnowledge of AJAX, animation libraries, and UX would be a plusBonus skills adobe aftereffects",
        "desc3": "",
        "Page_URL": "https://merojob.com/htmlcssjavascript-developer/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/cca945d4-ab3b-4425-b4a6-8aea93273b6f.jpg",
        "company": "Executive Search- merojob",
        "name": "IT-Officer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "NRs. 45,000.00 - 50,000.00 Monthly",
        "salary": "Oct. 08, 2020 23:55\n(4 days, 9 hours from now)",
        "deadline": "",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "Epabx\nCm\nCommunication\nManagement\nAvaya",
        "desc": "Project Related:Day to Day system health check and send report to Support Team.Day to Day interaction with customer and understand if there are any issues.Work with Principle Company off site team for the resolution of the issues.For any system/CC issue, work with Principle Company off site team for the resolution.Work as PRINCIPLE COMPANY onsite resource with responsibility.Work with client technical team for any issues and help them for resolution.Day to day system maintenance.Daily, monthly & quarterly report generation and share with PRINCIPLE COMPANY off site team.On concurrence with PRINCIPLE COMPANY off site team share the reports with customer.Work with PRINCIPLE COMPANY to diagnose the hardware and software faults that are reported by client and rectify the hardware & software faults detected.Work with PRINCIPLE COMPANY to repair and replace the faulty server, PCB, modules, terminals, and any other equipment including third party equipment.Support PRINCIPLE COMPANY support team to carry out the periodic preventive maintenance on every quarter of year.Work with PRINCIPLE COMPANY to upkeep the software periodicallyWork with PRINCIPLE COMPANY to upgrade the software to latest version for solving the operational problemsCreate customized reports as per client business requirement.Provide full & time bound assistance and associated systems and resolve any problems that may arise from time to time.Regular Internal Tasks:Manage networking of all PCs, laptops and backup system including all IT related works of the company and ensure functional conditional of all PC in coordination with the Admin Department.Co-ordinate with management and team members and handle the company e-mail, website hosting & Social Media.Update the website, presentation and other IT related issues quarterly in close coordination with team members.Maintain all the IT related equipment of the company including internet devices like; routers/Wi-Fi etc. Also, in order to maintain high security, take charge to change the various passwords time and again.Check the internet bandwidth and fix the issues if any arise and communicate with Internet service provider if necessary.Submit weekly, monthly, and annual progress report and prepare weekly, monthly and annual plans and strategies coordinating with the team, customers and associate partner.Provide IT related basic training to the team members (if needed) for their betterment and support the team members in the technical part during the tender preparation.Work as a focal person of business development in the organizations like Nepal Telecom, Ncell, MoCIT, NTA.",
        "desc1": "Project Related:",
        "desc2": "Day to Day system health check and send report to Support Team.Day to Day interaction with customer and understand if there are any issues.Work with Principle Company off site team for the resolution of the issues.For any system/CC issue, work with Principle Company off site team for the resolution.Work as PRINCIPLE COMPANY onsite resource with responsibility.Work with client technical team for any issues and help them for resolution.Day to day system maintenance.Daily, monthly & quarterly report generation and share with PRINCIPLE COMPANY off site team.On concurrence with PRINCIPLE COMPANY off site team share the reports with customer.Work with PRINCIPLE COMPANY to diagnose the hardware and software faults that are reported by client and rectify the hardware & software faults detected.Work with PRINCIPLE COMPANY to repair and replace the faulty server, PCB, modules, terminals, and any other equipment including third party equipment.Support PRINCIPLE COMPANY support team to carry out the periodic preventive maintenance on every quarter of year.Work with PRINCIPLE COMPANY to upkeep the software periodicallyWork with PRINCIPLE COMPANY to upgrade the software to latest version for solving the operational problemsCreate customized reports as per client business requirement.Provide full & time bound assistance and associated systems and resolve any problems that may arise from time to time.",
        "desc3": "",
        "Page_URL": "https://merojob.com/it-officer-388/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/2e799859-f1c8-4f1b-a58d-323275991575.jpg",
        "company": "Foreveryng",
        "name": "",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/uiux-web-and-mobile-application-designer/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/4f72a143-7da5-4b64-aa27-bf2ab2cc83b4.jpg",
        "company": "Tej Solution",
        "name": "Word Press Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 02, 2020 23:55\n(4 weeks, 1 day from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Css3\nHtml5\nJquery\nJavascript",
        "desc": "We are seeking an experienced, motivated and resourceful PHP / WordPress developer with a blend of back-end and front-end skills to serve as lead developer. In this highly collaborative role, you will work with front end developers, designers and content developers to build efficient, beautiful and responsive media/news focused websites.Responsibilities:Code new WordPress themes, page templates, and plugins from scratch and modify existing themes and pluginsCandidates with experience in Graphic Design, Java Script, HTML & CSS will be preferableBuild efficient, testable, and reusable PHP modules including dynamic content and personalization featuresIntegrate wide range of WordPress plugins, API calls and third party apps and forms, such as EloquaManage back-end services and interchange of data between server and user, including server-side logic and database integrationEnsure high performance and responsiveness to requests from front-endProvide front-end development of digital marketing communications, including full websites and micro-sites, landing pages, emails, and other initiativesDevelop, test and troubleshoot across multiple browsers, platforms and devices, including tablets and smartphones, to support a consistent and positive customer experienceProvide guidance on SEO best practices for site developmentResearch and recommend new technologies and tools for effective integration across various platforms",
        "desc1": "We are seeking an experienced, motivated and resourceful PHP / WordPress developer with a blend of back-end and front-end skills to serve as lead developer. In this highly collaborative role, you will work with front end developers, designers and content developers to build efficient, beautiful and responsive media/news focused websites.",
        "desc2": "Code new WordPress themes, page templates, and plugins from scratch and modify existing themes and pluginsCandidates with experience in Graphic Design, Java Script, HTML & CSS will be preferableBuild efficient, testable, and reusable PHP modules including dynamic content and personalization featuresIntegrate wide range of WordPress plugins, API calls and third party apps and forms, such as EloquaManage back-end services and interchange of data between server and user, including server-side logic and database integrationEnsure high performance and responsiveness to requests from front-endProvide front-end development of digital marketing communications, including full websites and micro-sites, landing pages, emails, and other initiativesDevelop, test and troubleshoot across multiple browsers, platforms and devices, including tablets and smartphones, to support a consistent and positive customer experienceProvide guidance on SEO best practices for site developmentResearch and recommend new technologies and tools for effective integration across various platforms",
        "desc3": "",
        "Page_URL": "https://merojob.com/word-press-developer-7/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/68d923f7-84f8-4868-b396-e326576c5a68.jpg",
        "company": "Genese Solution",
        "name": "PHP Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 23:55\n(1 week, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 4 years",
        "skills": "Php Framework\nLampstack",
        "desc": "Reports to: Team LeadDuties and Responsibilities:Designing and building enterprise-level learning management systems based on PHP frameworksPerform design, configure, customize and implement responsive and effective LMS systemsImplement multi-tenancy scalable architectureIntegrate and develop plugins when requiredPlanning and implementing API integrations with third parties when requiredAnalyze business processes, and user requirementsSupport PHP implementations and resolve any technical issuesQualifications:Bachelor’s Degree in Computer Science or related field4-5 years of experience in the LAMP stackPractical knowledge of OOP Working experience with different PHP frameworksExperience working with GITExperience working with different MVC FrameworksWorking experience of Laravel PHP Framework is a big plusNice to have:Involvement in Open Source projectsExperience of API integrationExperience with Continuous IntegrationWorking experience in Customizing functionalitiesExperience in XML data structures and Web Services (SOA)What we offer:A friendly, competitive and creative working environment5 working days in a week (09:00am-06:00 pm)Refreshment, Recreational, team building activitiesOpportunity to travel countries as part of training and developmentWork in the leadership firm in Cloud Computing in NepalWork in multidisciplinary areas in start-up ecosystemGet to know the working culture of companies like Amazon, Microsoft, Google, Alibaba being affiliates for them in NepalExposure in team management and leadershipApplying ProcedureSuitable candidates meeting the above criteria are requested to send their CV and cover letter to careers@genese.com.np . Only shortlisted candidates will be invited for the further selection process. You are requested to clearly mention the position you are applying for in the subject of the email.OR,",
        "desc1": "Reports to: Team Lead",
        "desc2": "Designing and building enterprise-level learning management systems based on PHP frameworksPerform design, configure, customize and implement responsive and effective LMS systemsImplement multi-tenancy scalable architectureIntegrate and develop plugins when requiredPlanning and implementing API integrations with third parties when requiredAnalyze business processes, and user requirementsSupport PHP implementations and resolve any technical issues",
        "desc3": "Involvement in Open Source projectsExperience of API integrationExperience with Continuous IntegrationWorking experience in Customizing functionalitiesExperience in XML data structures and Web Services (SOA)",
        "Page_URL": "https://merojob.com/php-developer-279/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/b60a01ea-51e4-4401-b4ad-fda8251a2feb.jpg",
        "company": "Executive Search- merojob",
        "name": "PHP-Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 07, 2020 23:55\n(3 days, 9 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Linux\nPhp\nMysql\nApache",
        "desc": "Perfection in working with LAMP (Linux, Apache, MySQL, PHP).Need to possess a good knowledge of software engineering life cycle, database relations, and data structures.Needs to have a good knowledge in custom programming with Object Oriented Approach.Needs to have a good knowledge of VueJs and custom Javascript.The applicant must be able to work using MySQL backend and PHP object oriented programming for the development of web based applications. A bit of CSS 3 and HTML 5 experience is expected.Knowledge of   Laravel framework  will add to the applicant’s value.Knowledge of AWS preferred.",
        "desc1": "",
        "desc2": "Perfection in working with LAMP (Linux, Apache, MySQL, PHP).Need to possess a good knowledge of software engineering life cycle, database relations, and data structures.Needs to have a good knowledge in custom programming with Object Oriented Approach.Needs to have a good knowledge of VueJs and custom Javascript.The applicant must be able to work using MySQL backend and PHP object oriented programming for the development of web based applications. A bit of CSS 3 and HTML 5 experience is expected.Knowledge of   Laravel framework  will add to the applicant’s value.Knowledge of AWS preferred.",
        "desc3": "",
        "Page_URL": "https://merojob.com/php-developer-280/"
    },
    {
        "image": "https://merojob.com/media/uploads/job_logo/cca945d4-ab3b-4425-b4a6-8aea93273b6f.jpg",
        "company": "Executive Search- merojob",
        "name": "IT-Officer-Online",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "NRs. 25,000.00 - 30,000.00 Monthly",
        "salary": "Oct. 08, 2020 23:55\n(4 days, 9 hours from now)",
        "deadline": "",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Illustrator\nPhotoshop\nComputer Operation",
        "desc": "The IT Officer reports to the Executive Director and is responsible for conducting institutional marketing activities of the company. Main Activities:Managing the online portal of the company.Managing the social media platform of the companyDealing with the export clients through mails.Searching for new export clients",
        "desc1": "The IT Officer reports to the Executive Director and is responsible for conducting institutional marketing activities of the company. ",
        "desc2": "Managing the online portal of the company.Managing the social media platform of the companyDealing with the export clients through mails.Searching for new export clients",
        "desc3": "",
        "Page_URL": "https://merojob.com/it-officer-online-3/"
    },
    {
        "image": "",
        "company": "",
        "name": "Sustaining Applications Engineer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 04, 2020 23:55\n(9 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Azure\nPowershell Script\nUnified Communication\nC#\n.Net Core",
        "desc": "ResponsibilitiesWork with Taiwan/Nepal QA and Engineer teams.Develop test plans to observe product scalability, fault tolerance, stability, and backward compatibility for products under development.Develop, improve, and maintain scalable test automation strategies.Evaluate multiple approaches and technologies to implement on test methodologies.Diagnose, track, and manage quality issues to resolution.Collaborate with the development team to drive quality standard and support debugging efforts.",
        "desc1": "Responsibilities",
        "desc2": "Work with Taiwan/Nepal QA and Engineer teams.Develop test plans to observe product scalability, fault tolerance, stability, and backward compatibility for products under development.Develop, improve, and maintain scalable test automation strategies.Evaluate multiple approaches and technologies to implement on test methodologies.Diagnose, track, and manage quality issues to resolution.Collaborate with the development team to drive quality standard and support debugging efforts.",
        "desc3": "",
        "Page_URL": "https://merojob.com/sustaining-applications-engineer/"
    },
    {
        "image": "",
        "company": "",
        "name": "Senior QA Engineer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 04, 2020 23:55\n(9 hours from now)",
        "education": "Master",
        "experience": "More than or equals to 2 years",
        "skills": "Communication\nAngular\nReact",
        "desc": "Major duties include:Collaborate with cross-functional teams to troubleshoot and resolve field reported issues.Identify and fix bugs for Altigen’s Service Delivery Platform and UC ApplicationsEnhance, design and develop software for Altigen's Unified Communication solutionsWork with QA team in delivering world-class experience products and services for our customers",
        "desc1": "Major duties include:",
        "desc2": "Collaborate with cross-functional teams to troubleshoot and resolve field reported issues.Identify and fix bugs for Altigen’s Service Delivery Platform and UC ApplicationsEnhance, design and develop software for Altigen's Unified Communication solutionsWork with QA team in delivering world-class experience products and services for our customers",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-qa-engineer-15/"
    },
    {
        "image": "",
        "company": "",
        "name": "Director of Applications Development",
        "level": "Top Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Katmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 20, 2020 23:55\n(2 weeks, 2 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 10 years",
        "skills": "More than 30 years",
        "desc": "Altigen Communications, a leader in UC communications platform\nproducts, is seeking a Director of Applications Development to lead our Asia engineering\nteam and contribute to our strategic success and expansion in the global marketplace.\nThe ideal candidate will lead multiple groups of engineers to develop Azure-based\ncommunications software for Microsoft Teams. \nHe/she needs to have strong leadership and management skills, solid\ndomain expertise in telecom, networking and Microsoft based communications, along\nwith experience in the full Software Development Life Cycle.  \nResponsibilitiesManage multiple Agile development groups and provide technical guidance to EngineersArchitect, design and develop software for Altigen's leading edge UC communications solutions for Microsoft TeamsCreate Software Specifications based on customer and market requirements Manage existing product sustaining and interact with QA and Technical Support",
        "desc1": "Altigen Communications, a leader in UC communications platform\nproducts, is seeking a Director of Applications Development to lead our Asia engineering\nteam and contribute to our strategic success and expansion in the global marketplace.\nThe ideal candidate will lead multiple groups of engineers to develop Azure-based\ncommunications software for Microsoft Teams. \nHe/she needs to have strong leadership and management skills, solid\ndomain expertise in telecom, networking and Microsoft based communications, along\nwith experience in the full Software Development Life Cycle.  ",
        "desc2": "Manage multiple Agile development groups and provide technical guidance to EngineersArchitect, design and develop software for Altigen's leading edge UC communications solutions for Microsoft TeamsCreate Software Specifications based on customer and market requirements Manage existing product sustaining and interact with QA and Technical Support",
        "desc3": "",
        "Page_URL": "https://merojob.com/director-of-applications-development-2/"
    },
    {
        "image": "",
        "company": "",
        "name": "Software Engineer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kumaripati, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Oct. 06, 2020 23:55\n(2 days, 8 hours from now)",
        "education": "Bachelor",
        "experience": "More than 3 years",
        "skills": "Javascript\nAnalytical\nCommunication\nCreative Thinking\nProgramming Skills",
        "desc": "Utilize established development tools,guidelines and conventions including but not limited to ASP.NET, SQL server,HTML/ HTML 5/XHTML, CSS, Javascript, and C#Design, code and test new web and windows software applicationsEnhance existing system by analyzing business objectives, preparing an action plan and identify areas  of modification and improvementMaintain existing system by identifying and correcting software defectsResearch and develop skills in new technologiesProactively initiate, develop and maintain effective working relationships with team membersWe provide:5 Working Days per WeekProvident fund schemesTimely Salary Review and Performance AppraisalsDashain BonusWorking in a team environment where initiative and dedication is encouragedHigh level of responsibility and excellent career possibilitiesOpen international work environmentFlexible working environmentTeam Building ActivitiesWeekly Team Lunch",
        "desc1": "We provide:",
        "desc2": "Utilize established development tools,guidelines and conventions including but not limited to ASP.NET, SQL server,HTML/ HTML 5/XHTML, CSS, Javascript, and C#Design, code and test new web and windows software applicationsEnhance existing system by analyzing business objectives, preparing an action plan and identify areas  of modification and improvementMaintain existing system by identifying and correcting software defectsResearch and develop skills in new technologiesProactively initiate, develop and maintain effective working relationships with team members",
        "desc3": "",
        "Page_URL": "https://merojob.com/software-engineer-103/"
    },
    {
        "image": "",
        "company": "",
        "name": "",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/php-developer-senior-mid-level-2/"
    },
    {
        "image": "",
        "company": "",
        "name": "Frontend Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Biratnagar",
        "salary": "Negotiable",
        "deadline": "Oct. 18, 2020 23:55\n(2 weeks from now)",
        "education": "Bachelor",
        "experience": "More than 1 year",
        "skills": "Css3\nHtml5\nJquery\nIllustrator\nBootstrap",
        "desc": "Delta Tech is seeking a Frontend Developer who has proven working experience in HTML5, CSS3, JQuery and is also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaSalesCRM, DeltaRetailerApp and DeltaInventory) and external projects with different levels of complexities and challenges.Role and Responsibilities:Your responsibilities will include (but are not limited to):Understand the requirement clearly, think creatively to produce new ideas and concepts to interactive designConceptualize ideas that bring simplicity and user-friendliness to complex design roadblocksWork with internal team to design and build user-friendly forms/ applications/ interfaces based on functional specificationsWireframe new features and templates and improvements to existing functionalityBuild prototypes of new features, templates, and apps to demonstrate and test new designs.Design UI and interaction layers using best practices and the latest Web/ Mobile trendsWhat we offerDelta Tech is looking for candidates who are loyal and plan to make a long-term commitment. In return for your loyalty we offer:Position BenefitsCompetitive/ Attractive Salary (No bar for right and deserving candidate)Timely performance appraisal and salary reviewsPaid holiday & paid leavesFestive bonusGreat work cultureFlexible timings against performanceWork from home (During COVID-19 pandemic situation)",
        "desc1": "Delta Tech is seeking a Frontend Developer who has proven working experience in HTML5, CSS3, JQuery and is also creative and innovative. You will be working in various internal (Our products: DeltaSalesApp, DeltaSalesCRM, DeltaRetailerApp and DeltaInventory) and external projects with different levels of complexities and challenges.",
        "desc2": "Understand the requirement clearly, think creatively to produce new ideas and concepts to interactive designConceptualize ideas that bring simplicity and user-friendliness to complex design roadblocksWork with internal team to design and build user-friendly forms/ applications/ interfaces based on functional specificationsWireframe new features and templates and improvements to existing functionalityBuild prototypes of new features, templates, and apps to demonstrate and test new designs.Design UI and interaction layers using best practices and the latest Web/ Mobile trends",
        "desc3": "",
        "Page_URL": "https://merojob.com/frontend-developer-89/"
    },
    {
        "image": "",
        "company": "",
        "name": "Lead - Software Engineer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "New Baneshwor",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 23:55\n (1 week, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 6 years",
        "skills": "Angular 2.0\nAsp.Net\nLeadership\nMs Sql Server\nInterpersonal",
        "desc": "Design, develop and modify modules based\non functional and system requirements.Work closely with Business Analyst and\nProduct Owner for understanding the functional and system requirements.Manage daily scrum meetings and sprint\nplanning.Translate\nclients’ business requirements and objectives into technical applications and\nsolutions. Manage the Architecture Team to ensure\narchitectural integrity and product quality.Adhere to high-quality development\nprinciples while delivering solutions on-time and on-budget.Develop, refine, and tune integrations\nbetween applications.Run and participate in the peer-reviews of\nsolution designs and related code.Ability to develop unit testing of code\ncomponents or complete applications.Package and support deployment of\nreleases.Design,\ndevelop and implement new integration. Execute\nsystem development and maintenance activities. Responsible for the performance and\nresults of a department.As a leader responsible for deploying\nresources, performance evaluation, pay reviews, and other related decisions.Benefits:In addition to\nthe dynamic and professional environment at Aqore Software, we strive to ensure\nthat our employees have access to a competitive and valuable set of Total\nRewards—the mix of both monetary and non-monetary rewards provided to you in\nrecognition for your time, talents, efforts, and results.",
        "desc1": "Benefits:",
        "desc2": "Design, develop and modify modules based\non functional and system requirements.Work closely with Business Analyst and\nProduct Owner for understanding the functional and system requirements.Manage daily scrum meetings and sprint\nplanning.Translate\nclients’ business requirements and objectives into technical applications and\nsolutions. Manage the Architecture Team to ensure\narchitectural integrity and product quality.Adhere to high-quality development\nprinciples while delivering solutions on-time and on-budget.Develop, refine, and tune integrations\nbetween applications.Run and participate in the peer-reviews of\nsolution designs and related code.Ability to develop unit testing of code\ncomponents or complete applications.Package and support deployment of\nreleases.Design,\ndevelop and implement new integration. Execute\nsystem development and maintenance activities. Responsible for the performance and\nresults of a department.As a leader responsible for deploying\nresources, performance evaluation, pay reviews, and other related decisions.",
        "desc3": "",
        "Page_URL": "https://merojob.com/lead-software-engineer-5/"
    },
    {
        "image": "",
        "company": "",
        "name": "AngularJS Developer",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Contract",
        "address": "Baluwatar, Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 08, 2020 23:55\n(4 days, 8 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Javascript\nCss\nHtml\nAngular\nExperience With Restful Services",
        "desc": "Delivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building RESTful APICommunicating with external web services.",
        "desc1": "",
        "desc2": "Delivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building RESTful APICommunicating with external web services.",
        "desc3": "",
        "Page_URL": "https://merojob.com/angularjs-developer-5/"
    },
    {
        "image": "",
        "company": "",
        "name": "ASP.NET Developer (Remote)",
        "level": "Mid Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu (remote, work from home)",
        "salary": "Negotiable",
        "deadline": "Oct. 08, 2020 23:55\n(4 days, 8 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "More than 24 years",
        "desc": "Design and develop\nwhole technical framework for using ASP .NET and C#  .NET applicationDevelop application\nusing .NET architecture platform for drivers and applicationsDesign, develop,\noptimize and test software using .NetVerify requirement\nspecification, user interface design, program specification, coding and conduct\nproduct testingSupport integration\nand system testing and all UATSupport and provide\nresolutions t the problems / bugs found during system test and UAT",
        "desc1": "",
        "desc2": "Design and develop\nwhole technical framework for using ASP .NET and C#  .NET applicationDevelop application\nusing .NET architecture platform for drivers and applicationsDesign, develop,\noptimize and test software using .NetVerify requirement\nspecification, user interface design, program specification, coding and conduct\nproduct testingSupport integration\nand system testing and all UATSupport and provide\nresolutions t the problems / bugs found during system test and UAT",
        "desc3": "",
        "Page_URL": "https://merojob.com/aspnet-developer-remote/"
    },
    {
        "image": "",
        "company": "",
        "name": "Senior Technician",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "Mahindra authorized service center को लागि निम्न बमोजिम दक्ष र अनुभवी कर्मचारीहरु आवश्यक परेको हुदाँ सम्बन्धित क्षेत्रमा दक्ष व्यक्तिहरुले यहि २०७७ असोज २१ गते भित्र बायोडाटा सहित सम्पर्क गर्नु होला । फोन नं. ०१४२८८९४९, ९८५१०७२८५१ ",
        "desc1": "Mahindra authorized service center को लागि निम्न बमोजिम दक्ष र अनुभवी कर्मचारीहरु आवश्यक परेको हुदाँ सम्बन्धित क्षेत्रमा दक्ष व्यक्तिहरुले यहि २०७७ असोज २१ गते भित्र बायोडाटा सहित सम्पर्क गर्नु होला । फोन नं. ०१४२८८९४९, ९८५१०७२८५१ ",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-technician-7/"
    },
    {
        "image": "",
        "company": "",
        "name": "Technician",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "Mahindra authorized service center को लागि निम्न बमोजिम दक्ष र अनुभवी कर्मचारीहरु आवश्यक परेको हुदाँ सम्बन्धित क्षेत्रमा दक्ष व्यक्तिहरुले यहि २०७७ असोज २१ गते भित्र बायोडाटा सहित सम्पर्क गर्नु होला । फोन नं. ०१४२८८९४९, ९८५१०७२८५१ ",
        "desc1": "Mahindra authorized service center को लागि निम्न बमोजिम दक्ष र अनुभवी कर्मचारीहरु आवश्यक परेको हुदाँ सम्बन्धित क्षेत्रमा दक्ष व्यक्तिहरुले यहि २०७७ असोज २१ गते भित्र बायोडाटा सहित सम्पर्क गर्नु होला । फोन नं. ०१४२८८९४९, ९८५१०७२८५१ ",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/technician-76/"
    },
    {
        "image": "",
        "company": "",
        "name": "प्राविधिक सहायक",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "प्रस्तुत विषयमा श्रम, रोजगार तथा सामाजिक सुरक्षा मन्त्रालय (प्रधानमन्त्री रोजगार कार्यक्रम)को पत्रानुसार यस केराबारी गाउँपालिकामा सञ्चालित रोजगार सेवा केन्द्रको लागि आवश्यक तपशिल बमोजिमका पदहरु करारमा पदपुर्ति गर्नु पर्ने भएको हुदा निम्न बमोजिम योग्यता पुगेका इच्छुक नेपाली नागरिकले १५ दिन भित्र माग बमोजिमका विवरण र राजश्व तिरेका रसिद सहित यस कार्यालयमा निवेदन दिनुहुन अनुरोध छ ।अन्य जानकारीका लागि केराबारी गाउँ कार्यपालिकाको कार्यालय प्रशासन शाखामा सम्पर्क गर्नुहुन अनुरोध छ । सम्पर्क : ०२१४०३११०, ९८४१५१५४७०, १८६७७८६४००प्रमुख प्रशासकिय अधिकृतकेराबारी गाउँपालिका गाउँ कार्यपालिकाको कार्यालयकेराबारी, मोरङ प्रदेश नं. १, नेपाल",
        "desc1": "प्रस्तुत विषयमा श्रम, रोजगार तथा सामाजिक सुरक्षा मन्त्रालय (प्रधानमन्त्री रोजगार कार्यक्रम)को पत्रानुसार यस केराबारी गाउँपालिकामा सञ्चालित रोजगार सेवा केन्द्रको लागि आवश्यक तपशिल बमोजिमका पदहरु करारमा पदपुर्ति गर्नु पर्ने भएको हुदा निम्न बमोजिम योग्यता पुगेका इच्छुक नेपाली नागरिकले १५ दिन भित्र माग बमोजिमका विवरण र राजश्व तिरेका रसिद सहित यस कार्यालयमा निवेदन दिनुहुन अनुरोध छ ।",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/-3321/"
    },
    {
        "image": "",
        "company": "",
        "name": "",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/-3322/"
    },
    {
        "image": "",
        "company": "",
        "name": "नायब प्राबिधिक सहायक",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "यस गाउँ कार्यपालिकाको कार्यालयको रिक्त पदमा सेवा करारमा कर्मचारी पदपूर्ति गर्नु पर्ने भएकोले योग्यता पुगेका नेपाली नागरिकहरुले प्रथम पटक सूचना प्रकाशित भएको मितिले १५ (पन्ध्र दिन भित्र यस कार्यालयमा आइपुग्ने गरी दरखास्त आह्वान गरिन्छ।२. आवेदनको ढाँचा लगाएतका थप विवरणहरु यस गा.पा. को वेब साइट : lisankhupakharmun.gov.np मा उपलब्ध छ । मो.नं. ९८५११४३९७२ मा सम्पर्क गर्न सकिनेछ । गा.पा. को इमेल ठेगाना lisankhupakharmun@gmail.com बाट समेत फाराम भर्न सकिने र इमेलबाट फाराम भर्ने उम्मेदवारहरुले फर्म स्वीकृत भएको conformation लिनु पर्नेछ।प्रमुख प्रशासकीय अधिकृत |लिसंखु पाखर गाउँपालिका गाउँ कार्यपालिकाको कार्यालयअत्तरपुर, सिन्धुपाल्चोक ",
        "desc1": "यस गाउँ कार्यपालिकाको कार्यालयको रिक्त पदमा सेवा करारमा कर्मचारी पदपूर्ति गर्नु पर्ने भएकोले योग्यता पुगेका नेपाली नागरिकहरुले प्रथम पटक सूचना प्रकाशित भएको मितिले १५ (पन्ध्र दिन भित्र यस कार्यालयमा आइपुग्ने गरी दरखास्त आह्वान गरिन्छ।",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/-3323/"
    },

    {
        "logo": "https://merojob.com/media/uploads/job_logo/c3d22f92-c224-48c2-91b9-4fb191e691bf.jpg",
        "company": "Verisk Nepal",
        "name": "Dot Net Developer : VN",
        "level": "Mid Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 21, 2020 23:55\n(1 week, 4 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Asp.Net\nCommunication\nAws Services",
        "desc": "Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!In this role, you will be working alongside a diverse group of talented individuals that are responsible for creating and maintaining high traffic, API/web products depended on by top auto manufacturers and insurance companies for their daily business.Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorship",
        "desc1": "Verisk IoT/ Telematics is seeking an Application Developer to develop our next generation products with an opportunity to work with exciting, cutting-edge technologies that will enable us to deliver innovative, fast, scalable and reliable products to our customers.  You will join the core team responsible for the development of our data exchange for connected cars and home that is one of its kind in the world!",
        "desc2": "Design and develop high performance software libraries and APIsImplement highly scalable, performant, fault tolerant processing systems in an AWS environmentBe involved in all phases of the agile software development lifecycleWork with our Product teams to gather detailed requirements for new products, services & tools.Proactively seek out and minimize pain points within the infrastructure and code baseKeep up-to-date with the latest technologies and introduce them as neededCreate next-gen solutions for unique and challenging use casesLead a team of junior developer(s), provide guidance and mentorship",
        "desc3": "",
        "Page_URL": "https://merojob.com/dot-net-developer-vn/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/14afb21b-c406-47d2-ab6f-bb62fc8816ea.jpg",
        "company": "AlphaBetaTheta Technologies",
        "name": "Project Manager",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Butwal\nKathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 30, 2020 23:55\n(2 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Creative Thinking\nCommunication\nProject Management\nInterpersonal",
        "desc": "We are a growing team and we are seeking to hire a Project Manager to join our team. We build custom applications using the latest and fastest technologies available in the market. We are a motivated team of individuals handling diverse IT projects. If you are passionate about handling unique challenges with a motivated team, this is a great place for you!  You have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta, through modern practices of software development. We have highly talented team members and boast of top notch quality software on every aspect. In this high-paced, creative environment, we know that our people will make all the difference in our success. Leading their success will be you, as a project manager. We need energy, curiosity and a relentless interest in creating the best requirement to delivery experience! The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life!  Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completionActs as the central point of contact for project-related activitiesBreakdown the requirements and assign individual team membersActively participate in all stages of SDLC from requirement to deliveryFacilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverablesManages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channelsForms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departmentsManages conflicting points of views to arrive at creative and responsive solutions. Influences completion of project activities through dotted line relationshipsManages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industryOther duties as assignedApplying Procedure:To apply for this position, please send an email: info@alphabetatheta.com or apply through the given link  http://alphabetatheta.comOR,",
        "desc1": "We are a growing team and we are seeking to hire a Project Manager to join our team. We build custom applications using the latest and fastest technologies available in the market. We are a motivated team of individuals handling diverse IT projects. If you are passionate about handling unique challenges with a motivated team, this is a great place for you!  ",
        "desc2": "Uses proven Project Management tools and methodologies to define and execute projects within defined guidelines and successfully manage projects through to completionActs as the central point of contact for project-related activitiesBreakdown the requirements and assign individual team membersActively participate in all stages of SDLC from requirement to deliveryFacilitates project meetings, hold project participants accountable, creates and posts meeting reviews and posts project documents, maintains project schedules and milestones and ensures project owners/contributors understand and follow standard processes, and adhere to set timelines, budgets and deliverablesManages and reports on changes to business requirements, project scope, and project schedules using appropriate, defined communication channelsForms collaborative partnerships with all levels of staff, including individual developers, developer leads, management, technology and other departmentsManages conflicting points of views to arrive at creative and responsive solutions. Influences completion of project activities through dotted line relationshipsManages day-to-day project activities and makes sound decisions based on project management experience and knowledge of the business/company/industryOther duties as assigned",
        "desc3": "",
        "Page_URL": "https://merojob.com/project-manager-391/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/1b7e688b-193d-4482-a5a3-2a8e397caaed.jpg",
        "company": "AlphaBetaTheta Technologies",
        "name": "Back End Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Butwal\nKathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 30, 2020 23:55\n(2 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Debugging\nResearch\nQa Automation\n Coding Skills",
        "desc": "We are a growing team and we are seeking to hire a C# Developer to join our team. We are a motivated team of individuals handling diverse projects. If getting the highest performance and reusability for your code excites you, this is a great place for you!  you have the unique opportunity to be a part of a transformational team that will create new experiences within Alpha Beta Theta through modern practices of coding. We leverage the latest serverless architecture and technologies to make our backend as reliable as possible. You will be working with our team with its highly talented members who take pride on their code and analysis. In this high-paced, creative environment, we know that our people will make all the difference in our success.  We need energy, curiosity and a relentless interest in creating the best performance!The number one thing you need to know about working at Alpha Beta Theta, our employees like being here. They are motivated to come together to reach goals, celebrate wins, and make this a fun place to work. After all, if you love what you do, you never work a day in your life! Gather and evaluate user requirements from project managerCollaborate with team members to complete the assigned taskProduce high-quality backend solutions with a well-structured and organized code Properly communicate databases migrations and schema when going to productionCreate a JSON contract with front end team Clearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challengesApplying Procedure :To apply for this position, please send an email: info@alphabetatheta.com or apply through the given link  http://alphabetatheta.comOR,",
        "desc1": "We are a growing team and we are seeking to hire a C# Developer to join our team. We are a motivated team of individuals handling diverse projects. If getting the highest performance and reusability for your code excites you, this is a great place for you!  ",
        "desc2": "Gather and evaluate user requirements from project managerCollaborate with team members to complete the assigned taskProduce high-quality backend solutions with a well-structured and organized code Properly communicate databases migrations and schema when going to productionCreate a JSON contract with front end team Clearly communicate your architectural ideas to team membersStay up to date with new coding trends and technologiesWrite reliable code acknowledging security and maintainability challenges",
        "desc3": "",
        "Page_URL": "https://merojob.com/back-end-developer-11/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/f4ffa663-e0fe-42b1-99a9-b5e0298216ed.jpg",
        "company": "IDenTV Nepal",
        "name": "Sr Node.js Developer",
        "level": "Senior Level",
        "vacancy": "[ 3 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "NRs. 50,000.00 - 200,000.00 Monthly",
        "deadline": "Nov. 07, 2020 23:55\n(4 weeks from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Jest\nJavascript\nNode.Js",
        "desc": "Oversee and/or lead analysis, architecture design, development and maintenance of large scale and/or complex applicationsWrite modular, reusable and excellent quality code, code reviews, and implement best practicesSupport the migration and redeployment of existing application (if any)Take responsibility of project and ensure robust hosting, application stability, security and system integration",
        "desc1": "",
        "desc2": "Oversee and/or lead analysis, architecture design, development and maintenance of large scale and/or complex applicationsWrite modular, reusable and excellent quality code, code reviews, and implement best practicesSupport the migration and redeployment of existing application (if any)Take responsibility of project and ensure robust hosting, application stability, security and system integration",
        "desc3": "",
        "Page_URL": "https://merojob.com/sr-nodejs-developer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ee06ba0f-4300-4256-a091-411ecf85d77d.jpg",
        "company": "Eightsquare",
        "name": "Senior .Net Developer",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 01, 2020 23:55\n(3 weeks, 1 day from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Problem Solving\nManagerial Skills\nCommunication\n\nProject Management",
        "desc": "Supporting the technical design process by participating in the analysis of technical application requirementsWriting scalable code for .NET software applicationsReviewing, debugging and upgrading existing .NET web and applicationsProviding support and training for junior developersCoding and testing program modules; assisting in design by collaborating with internal teamDrafting software and application operating proceduresTest and deploy applications and systemsDevelop documentation throughout the software development life cycle (SDLC)Participating in execution and documentation of testsDrive the delivery quality system utilizing automated unit testing, TDD and performance testingCollaborate with internal team to identify pain points, develop solutions and evangelize best practiceCompany Benefits:Competitive RemunerationTimely Appraisal and Pay UpgradationSophisticated InfrastructureMedical insurance inclusive Spouse, Parents & ChildrenAccidental and Term Life InsuranceFestival AllowanceOnsite Engagement with MultinationInternational Travel Exposure and Allowance.Technical and Soft Skills Trainings.Retreat ProgramsApplying Procedure:Candidates who meet the above specified requirements are encouraged to send their CV’s with a covering letter at hr@8squarei.com.OR,",
        "desc1": "",
        "desc2": "Supporting the technical design process by participating in the analysis of technical application requirementsWriting scalable code for .NET software applicationsReviewing, debugging and upgrading existing .NET web and applicationsProviding support and training for junior developersCoding and testing program modules; assisting in design by collaborating with internal teamDrafting software and application operating proceduresTest and deploy applications and systemsDevelop documentation throughout the software development life cycle (SDLC)Participating in execution and documentation of testsDrive the delivery quality system utilizing automated unit testing, TDD and performance testingCollaborate with internal team to identify pain points, develop solutions and evangelize best practice",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-net-developer-48/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/cc676175-3db2-4934-a790-18851758ef6c.jpg",
        "company": "EBPearls",
        "name": "iOS Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kandevsthan",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 23:55\n(1 week from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Orm And Rdbms\nCoredata\nCocoa Touch",
        "desc": "Position OverviewAre you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award winning iOS App Development team?We are looking for iOS Developers who will be a responsible member of the Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. iOS developer reports directly to the Project Manager and is accountable for the Project Development.Job Roles and Responsibilities1. Project AccountabilityUnderstand the project requirements clearly.Generate queries in case there is any confusion in understanding the project.Discuss any technical challenges that might come affront while working on the project.Realize the project delivery date and understand the communication channels.Write codes to develop a quality product on time.Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager.Verify the product with SRS.2. Adapt to EB Work CultureAttend project meetings conducted by Project Manager with full preparation by studying the project documents and information.Follow company coding standards.3. Team CoordinationTake ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.Perks and BenefitsWe strive to make sure that our people are comfortable, happy and growing at EB Pearls.We offer:Insurance: We enroll our employees in the company's group insurance policy that covers both medial and accidental insurance.Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standardsTimely performance appraisal and salary reviews: We conduct bi yearly performance review to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to compliment.Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays.Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our peopleSocial Security Fund: SSF is a contribution based social security scheme, the employee contributes 11 % and the employer adds 20% of the basic salary per month( 31% of the basic salary of employee) every month.Festival Allowance: We have the provision of festival allowance and provide Dashain bonus which is based on the amount of employees’ basic salary.Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly.Work on next generation technology projectsWork with leading edge technologyFun At EBAll work and no play is not our cup of tea. At EB, we enjoy:Office Events: Chat and Chew, Residential Annual Event, Team Lunch OutEEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out eventsFood and Coffee: Office Provided lunch and stocked pantryInspiring Colleagues: Fun and friendly work environment with brilliant one of a kind teamApplying ProcedureSubmit a cover letter along with your recently updated resume via email to “careers@ebpearls.com” with “Application for iOS Developer” in the subject line.OR,Send your application via our website: CLICK HEREOR,",
        "desc1": "Position Overview",
        "desc2": "Understand the project requirements clearly.Generate queries in case there is any confusion in understanding the project.Discuss any technical challenges that might come affront while working on the project.Realize the project delivery date and understand the communication channels.Write codes to develop a quality product on time.Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager.Verify the product with SRS.",
        "desc3": "Take ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.",
        "Page_URL": "https://merojob.com/ios-developer-102/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/3c67e8d1-b656-4c45-8ee7-7ce60c93cdd7.jpg",
        "company": "EBPearls",
        "name": "Android Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kandevsthan",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 22:55\n(1 week from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Mvvm\nArchitecture\nMvc",
        "desc": "Position OverviewAre you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award winning Android App Development team? We are looking for Android Developers who will be a responsible member of the Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. Android developer reports directly to the Project Manager and is accountable for the Project Development.Job Roles and Responsibilities:1. Project AccountabilityUnderstand the project requirements clearly.Generate queries in case there is any confusion in understanding the project.Discuss any technical challenges that might come affront while working on the project.Realize the project delivery date and understand the communication channels.Write codes to develop a quality product on time.Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager.Verify the product with SRS.2. Adapt to EB Work CultureAttend project meetings conducted by Project Manager with full preparation by studying the project documents and information.Follow company coding standards.3. Team CoordinationTake ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.Perks and BenefitsWe strive to make sure that our people are comfortable, happy and growing at EB Pearls.We offer:Insurance: We enroll our employees in the company's group insurance policy that covers both medial and accidental insurance.Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standardsTimely performance appraisal and salary reviews: We conduct bi yearly performance review to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to compliment.Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays.Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our peopleSocial Security Fund: SSF is a contribution based social security scheme, the employee contributes 11 % and the employer adds 20% of the basic salary per month( 31% of the basic salary of employee) every month.Festival Allowance: We have the provision of festival allowance and provide Dashain bonus which is based on the amount of employees’ basic salary.Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly.Work on next generation technology projectsWork with leading edge technologyFun At EBAll work and no play is not our cup of tea. At EB, we enjoy:Office Events: Chat and Chew, Residential Annual Event, Team Lunch OutEEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out eventsFood and Coffee: Office Provided lunch and stocked pantryInspiring Colleagues: Fun and friendly work environment with brilliant one of a kind teamApplying ProcedureSubmit a cover letter along with your recently updated resume via email to “careers@ebpearls.com” with “Application for Android Developer” in the subject line.OR,Send your application via our website: CLICK HEREOR,",
        "desc1": "Position Overview",
        "desc2": "Understand the project requirements clearly.Generate queries in case there is any confusion in understanding the project.Discuss any technical challenges that might come affront while working on the project.Realize the project delivery date and understand the communication channels.Write codes to develop a quality product on time.Conduct first hand testing of the project tasks before submitting the tasks to the Project Manager.Verify the product with SRS.",
        "desc3": "Take ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.",
        "Page_URL": "https://merojob.com/android-developer-164/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/31945286-da57-4865-9eba-42758e219c2d.jpg",
        "company": "EBPearls",
        "name": "Node.js Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Lalitpur, Nepal",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 23:55\n(1 week from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Nosql\nAnalytical\nVue.Js\nCommunication\nAngular",
        "desc": "Position Overview: Node.js Developer is a responsible member of Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. Node.js developer reports directly to the Project Manager and is accountable for the Project Development. 1. Project Accountability Understand the project requirements clearlyGenerate queries in case there is any confusion in understanding the projectDiscuss any technical challenges that might come affront while working on the projectRealize the project delivery date and understand the communication channelsWrite codes to develop a quality product on timeConduct first hand testing of the project tasks before submitting the tasks to the Project ManagerVerify the product with SRS2. Adapt to EB Work Culture Attend project meetings conducted by Project Manager with full preparation by studying the project documents and informationFollow company coding standards3. Team Coordination Take ownership of the project from planning to the delivery of the projectBe easily approachable and flexible in workBenefits and more Competitive and negotiable salary. No bar for deserving candidatesPeriodic salary reviewProvident fund and gratuity facilities Other benefits such as, insurance (medical and accidental), festival bonus, meal facility and recreational facilitiesDynamic and challenging working environmentFacilitate career growth via promoting learning cultureApplying Procedure: Interested candidates can submit a cover letter explaining with evidence how you meet the required criteria along with your recent CV/resume via email to “hr@ebpearls.com” with “Application for Node.js Developer” in the subject line. OR, Send your application with a cover letter via our website: https://ebpearls.com.au/job/nodejs-developer/ We shall update your current status in our recruitment process soon. OR,",
        "desc1": "Position Overview: ",
        "desc2": "Understand the project requirements clearlyGenerate queries in case there is any confusion in understanding the projectDiscuss any technical challenges that might come affront while working on the projectRealize the project delivery date and understand the communication channelsWrite codes to develop a quality product on timeConduct first hand testing of the project tasks before submitting the tasks to the Project ManagerVerify the product with SRS",
        "desc3": "Take ownership of the project from planning to the delivery of the projectBe easily approachable and flexible in work",
        "Page_URL": "https://merojob.com/nodejs-developer-28/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/1123d027-1275-463a-9228-0498a1c51722.jpg",
        "company": "Muncha.com",
        "name": "Web Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Ekantakuna, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 04, 2020 23:55\n(3 weeks, 4 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Nodejs\nVuejs\nMysql\nPhp",
        "desc": "Web-based chat application development and maintenanceDevelop, troubleshoot and enhance cutting edge web applicationsFrameworks - LaravelPayment gateway integration and maintenanceSource Version Control (git preferred, svn, cvs)Applying Procedure:Experienced candidate are requested to drop their updated resume at hr@muncha.com / 9801184441OR,",
        "desc1": "Applying Procedure:",
        "desc2": "Web-based chat application development and maintenanceDevelop, troubleshoot and enhance cutting edge web applicationsFrameworks - LaravelPayment gateway integration and maintenanceSource Version Control (git preferred, svn, cvs)",
        "desc3": "",
        "Page_URL": "https://merojob.com/web-developer-350/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/54e51f69-f608-4c7e-8ac1-055a8ed9a26a.jpg",
        "company": "Muncha.com",
        "name": "App Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Ekantakuna, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 04, 2020 23:55\n(3 weeks, 4 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Problem Solving\nTime Management\nCommunication\nJavascript",
        "desc": "Develop the best technical design and approach for new products or technologiesFamiliarity with code versioning tools such as GITDiagnose and fix bugs and performance bottlenecksIdentify project risks and clearly communicate risks and expectations to your team members and your managementCommunicate proactively with clients regarding projects’ status and progressStay aware of industry trends and use these to make informed technology choices and strategic decisionsApplying Procedure:Experienced candidate are requested to drop their updated resume at hr@muncha.com / 9801184441OR,",
        "desc1": "Applying Procedure:",
        "desc2": "Develop the best technical design and approach for new products or technologiesFamiliarity with code versioning tools such as GITDiagnose and fix bugs and performance bottlenecksIdentify project risks and clearly communicate risks and expectations to your team members and your managementCommunicate proactively with clients regarding projects’ status and progressStay aware of industry trends and use these to make informed technology choices and strategic decisions",
        "desc3": "",
        "Page_URL": "https://merojob.com/app-developer-11/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/89c897b9-cc52-4ce4-be38-e17d8ea0cdb7.jpg",
        "company": "Agram Infotech",
        "name": "Team Lead (Java/Spring Framework)",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Birgunj",
        "salary": "Negotiable",
        "deadline": "Nov. 05, 2020 23:55\n(3 weeks, 5 days from now)",
        "education": "Bachelor",
        "experience": "More than 3 years",
        "skills": "Problem Solving\nAnalytical\nCreative Thinking\nLogical Thinking",
        "desc": "Position Summary: As Java Software Engineer, you will be part of an agile development team building and supporting software systems. In this crucial role, you'll work on a high performing team and be involved with the design, development, testing, and support of desktop, mobile and web applications. Who We Are: We are a startup software company focused on software development, Internet of Things, Cyber Security and Artificial IntelligenceOur Vision: Identify social challenges and develop technical solutions to ease themOur Mission: To be a leading and innovative software solution provider in NepalEssential Job Functions:Work with a cross-functional, highly talented team to design, develop and deliver new featuresUse the latest technologies to design and build flexible, scalable, reliable and high-performing applicationsWrite tests and perform code reviews to ensure that we're shipping reliable, readable, and reusable codeSupport our current applications, investing in fixing technical debt, and refactoring opportunitiesDevelop and design user interface components, web services, API’s, and database integrations Must have led a team of 3 to 5 people for a period of at least 1 yearMust have good verbal and written communication skills (Should be able to talk fluently and write emails without grammatical mistakes)Proven experience of delivering on-time and with qualityProven experience of handling risks and providing mitigation strategies",
        "desc1": "Position Summary: ",
        "desc2": "Work with a cross-functional, highly talented team to design, develop and deliver new featuresUse the latest technologies to design and build flexible, scalable, reliable and high-performing applicationsWrite tests and perform code reviews to ensure that we're shipping reliable, readable, and reusable codeSupport our current applications, investing in fixing technical debt, and refactoring opportunitiesDevelop and design user interface components, web services, API’s, and database integrations Must have led a team of 3 to 5 people for a period of at least 1 yearMust have good verbal and written communication skills (Should be able to talk fluently and write emails without grammatical mistakes)Proven experience of delivering on-time and with qualityProven experience of handling risks and providing mitigation strategies",
        "desc3": "",
        "Page_URL": "https://merojob.com/team-lead-javaspring-framework/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ee60e0aa-0770-4642-94e8-5b80889950b6.jpg",
        "company": "Verisk Nepal",
        "name": "ETL Developer",
        "level": "Mid Level",
        "vacancy": "[ 4 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 06, 2020 23:55\n(3 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Sql\nProgramming\nEtl",
        "desc": "Support, development and data operation workloadCoordinate and communicate effectively with team members and various stakeholdersUnderstand the business requirement, produce code and conduct testing to ensure that product meets the requirementsIdentify and test for bugs and bottlenecks in the ETL solutionEnsure the best possible performance and quality in the packagesParticipate in different support activitiesApplying Procedure: Please visit mentioned website : https://careers.smartrecruiters.com/Verisk?search=nepal",
        "desc1": "Applying Procedure: ",
        "desc2": "Support, development and data operation workloadCoordinate and communicate effectively with team members and various stakeholdersUnderstand the business requirement, produce code and conduct testing to ensure that product meets the requirementsIdentify and test for bugs and bottlenecks in the ETL solutionEnsure the best possible performance and quality in the packagesParticipate in different support activities",
        "desc3": "",
        "Page_URL": "https://merojob.com/etl-developer-2/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/8503df16-2e03-4a5e-8fe3-8e208d3eb883.jpg",
        "company": "Verisk Nepal",
        "name": "ETL - Tester / QA Engineer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 06, 2020 23:55\n(3 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Sql\nEtl\nTesting",
        "desc": "Act as QA lead on a wide variety of data intense projectsLead analysis for the purposes of developing test cases and test data for back-end data intense applicationPerform hands-on manual testing while scripting automated tests to ensure application and data quality.Test ETL systems in Pentaho which includes Data Analysis, Test Data Creation in different format/input files and Testing regulated data – majority in a scripted automated environmentContinuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation SuitesServe as a liaison to business analyst and product owner, providing feedback on application readiness for migrationsAdditional Information : Verisk Analytics is an equal opportunity employer.All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability. Applying Procedure:Please visit mentioned website:  https://careers.smartrecruiters.com/Verisk?search=nepalor https://jobs.smartrecruiters.com/Verisk/743999721164045-software-engineer-data-qa-automation-engineerUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume. Consumer Privacy Notice",
        "desc1": "Additional Information : Verisk Analytics is an equal opportunity employer.",
        "desc2": "Act as QA lead on a wide variety of data intense projectsLead analysis for the purposes of developing test cases and test data for back-end data intense applicationPerform hands-on manual testing while scripting automated tests to ensure application and data quality.Test ETL systems in Pentaho which includes Data Analysis, Test Data Creation in different format/input files and Testing regulated data – majority in a scripted automated environmentContinuously develop and socialize best practices for the design and development of robust and easily maintainable QA Automation SuitesServe as a liaison to business analyst and product owner, providing feedback on application readiness for migrations",
        "desc3": "",
        "Page_URL": "https://merojob.com/etl-tester-qa-engineer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/e30b8cb3-1996-48cd-9b5d-a6fb2ccd2cab.jpg",
        "company": "IDenTV Nepal",
        "name": "Sr. Machine Learning Engineer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "$. 1,000.00 - 2,000.00 Monthly",
        "deadline": "Nov. 07, 2020 23:55\n(4 weeks from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "Python\nProgramming",
        "desc": "Building data pipelines and calling machine learning algorithms.Data cleansingCreate Visual ChartsThe project/s that this person will be supporting are around our Artificial Intelligence.",
        "desc1": "",
        "desc2": "Building data pipelines and calling machine learning algorithms.Data cleansingCreate Visual ChartsThe project/s that this person will be supporting are around our Artificial Intelligence.",
        "desc3": "",
        "Page_URL": "https://merojob.com/sr-machine-learning-engineer-2/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/cc124869-c18b-4028-a2e4-db99c1233ac8.jpg",
        "company": "Proshore Nepal",
        "name": "Senior .Net Developer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Tinkune Marg, Kathmandu, Nepal",
        "salary": "Negotiable",
        "deadline": "Oct. 21, 2020 23:55\n(1 week, 4 days from now)",
        "education": "Bachelor",
        "experience": "Not Required",
        "skills": "Technical Lead\nC#\nJavascript\nCommunication",
        "desc": "We want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers. Personal Skills We ValueNatural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a team You are assertive and feel free to express yourself and your idea’s in EnglishYour Technical Skill SetYou get energy from coding and and you are familiar in the Microsoft ecosystem such as Visual Studio, Azure & .NET CoreYou believe in writing clean, scalable code using C# .NETYou can act as a leader of your team and provide them technical assistanceWorking with API's and microservices is a piece of cake for youScalable and manageable solutions are in your DNA   You are familiar with front-end JS frameworks such as Angular, React or VueWhat We Have to Offer YouYour own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activities  Paid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday's  Open office environment This is what happens after you applyTell us more about yourself along with your CVLet's first have a 'virtual tea talk'  to introduce Proshore, the role and to get to know you. This will be done by Hangouts or Skype. During the interview phase (of max 2 round) we'll inform you as soon as we've decided whether we'd like to proceed with youThe interview phase may include a technical assessment to test your technical skills",
        "desc1": "We want you to be a team player and a real problem solver. Together we want to create something valuable and useful for our customers. ",
        "desc2": "Natural curiosity around new technologies and toolsYou always believe there is a better or smarter way to solve problemsA mindset of creating a solution that is valuable for the end userYou like to achieve a goal within a team You are assertive and feel free to express yourself and your idea’s in English",
        "desc3": "Your own workstation with dual monitorFlexible work timingFree Lunch and BreakfastParticipate in eventsExcellent career opportunitiesSpace for own initiativesHealth & Accidental insurance coverageRecreational activities  Paid Paternity, Maternity, Marriage, Sick and Casual LeaveFloating Holiday's  Open office environment ",
        "Page_URL": "https://merojob.com/senior-net-developer-49/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/44da9024-f313-468e-867a-6770f022f06b.jpg",
        "company": "Pay Nep",
        "name": "Senior Software Developer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "Negotiable",
        "deadline": "Nov. 08, 2020 23:55\n(4 weeks, 1 day from now)",
        "education": "Master",
        "experience": "More than or equals to 5 years",
        "skills": "Problem Solving\nTeamwork\nTime Management\nCommunication\nInterpersonal",
        "desc": "We are looking for Technical ninja who want to help us Design/Develop/Deploy cutting edge scalable products to meet our business requirements. We are building out a team and looking for multiple levels but you should have at least 5 years of programming experience.We need Full stack developer role to lead, manage a team of App & Web. UX/ UI design understanding. Development with Flutter, React JS, React Native, Node, Python, Java etc. API plugging’s workflow, concurrency, multithreading. Server integration- Exp in Product management. Cross functional knowledge in development, testing deployment, maintenance. Team Management, hiring, guiding, training. Lead R&D. Strong in Flutter, Python development environment.Roles and ResponsibilitiesExperience in developing functional code for front-end and back-endDesigning and developing and Integrating API’s using server-side programming languages such as Node, Python, JavaExperience in front-end JavaScript frameworks such Angular, React, Vue JS, React Native, Native Script, FlutterEffective programming skills in TypeScriptWorking experience with databases such as MongoDB, SQL, and Oracle.Knowledge of UI rendering programming languages such as HTML, CSS, JQueryExcellent at QA Testing Procedures and Cloud (AWS and Azure)Should be an active contributor to developer communities like Stack overflow, Top coder, GitHub, Google Developer Groups (GDGs).Customer- focused, react well to changes, work with teams and able to multi- task.Excellent data structure & algorithm and problem-solving skills.Working knowledge with JavaScript frameworks and librariesBuild features and applications with mobile responsive designDevelop and design documents based on functional specificationsGood communication and teamwork skillsDevelop medium to large scale applications using required technology, Database design and analysis.Stay abreast of changes in technology and learn new technologies as needed.Develop complex software components.Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.Protect operations by keeping information confidential.Accomplish engineering and organization mission by completing related results as needed.Mentor junior-level developers.Collaborate with the team to brainstorm and create new products.Grow engineering teams by interviewing, recruiting and hiring.Understand business needs and know how to create the tools to manage them.Comply with the project plan and stay on the leading edge of development practices.Advise team on software development and code creation.Demonstrate strong knowledge proficiency in the development methodologies including Object-Oriented Development, Component-based Development, Test-Driven Development, Behavior-Driven Development, Design Patterns and Design for Reuse.Work closely with stakeholders to obtain requirements, break them down to tasks, and manage a team of several developers.Perform unit testing and integration testing of Apps and web applications with the test automation tools. Analyze and resolve performance issues in them.Should be capable of Handling a product from planning phase to getting the product/project running which include, Product planning, Task bi-furcation, assigning tasks to the team and self-involvement, Setting the deadlines and working on the deadlines, Requirements Testing, Deployment, Maintenance, Security testing, etc.Must be a proven performer and team player that enjoy challenging assignments in a high- energy, fast growing and start- up workplace.Must be a self- starter who can work well with minimal guidance and in fluid environment.For Further information:Moru.com.np9801035347",
        "desc1": "We are looking for Technical ninja who want to help us Design/Develop/Deploy cutting edge scalable products to meet our business requirements. We are building out a team and looking for multiple levels but you should have at least 5 years of programming experience.",
        "desc2": "Experience in developing functional code for front-end and back-endDesigning and developing and Integrating API’s using server-side programming languages such as Node, Python, JavaExperience in front-end JavaScript frameworks such Angular, React, Vue JS, React Native, Native Script, FlutterEffective programming skills in TypeScriptWorking experience with databases such as MongoDB, SQL, and Oracle.Knowledge of UI rendering programming languages such as HTML, CSS, JQueryExcellent at QA Testing Procedures and Cloud (AWS and Azure)Should be an active contributor to developer communities like Stack overflow, Top coder, GitHub, Google Developer Groups (GDGs).Customer- focused, react well to changes, work with teams and able to multi- task.Excellent data structure & algorithm and problem-solving skills.Working knowledge with JavaScript frameworks and librariesBuild features and applications with mobile responsive designDevelop and design documents based on functional specificationsGood communication and teamwork skillsDevelop medium to large scale applications using required technology, Database design and analysis.Stay abreast of changes in technology and learn new technologies as needed.Develop complex software components.Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.Protect operations by keeping information confidential.Accomplish engineering and organization mission by completing related results as needed.Mentor junior-level developers.Collaborate with the team to brainstorm and create new products.Grow engineering teams by interviewing, recruiting and hiring.Understand business needs and know how to create the tools to manage them.Comply with the project plan and stay on the leading edge of development practices.Advise team on software development and code creation.Demonstrate strong knowledge proficiency in the development methodologies including Object-Oriented Development, Component-based Development, Test-Driven Development, Behavior-Driven Development, Design Patterns and Design for Reuse.Work closely with stakeholders to obtain requirements, break them down to tasks, and manage a team of several developers.Perform unit testing and integration testing of Apps and web applications with the test automation tools. Analyze and resolve performance issues in them.Should be capable of Handling a product from planning phase to getting the product/project running which include, Product planning, Task bi-furcation, assigning tasks to the team and self-involvement, Setting the deadlines and working on the deadlines, Requirements Testing, Deployment, Maintenance, Security testing, etc.Must be a proven performer and team player that enjoy challenging assignments in a high- energy, fast growing and start- up workplace.Must be a self- starter who can work well with minimal guidance and in fluid environment.",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-software-developer-20/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/e1e033cf-8fa1-4d4d-b0c6-795bb0f7a5e2.jpg",
        "company": "Pay Nep",
        "name": "UI/UX Head",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "Negotiable",
        "deadline": "Nov. 08, 2020 23:55\n(4 weeks, 1 day from now)",
        "education": "Bachelor",
        "experience": "Not Required",
        "skills": "Web Design\nUser-Centered Design\nVideo Editing\nUi/Ux\nCommunication",
        "desc": "As a Product/UI designer, you will be the champion of UI & UX Design within the organization and create simple, intuitive and efficient experiences for the co.As one of the core members of the team, you would be responsible to design world-class mobile & web products to enhance user experience and contribute actively in making it a leading brand.ResponsibilitiesCreate and execute all visual designs from concept to final hand-off to engineering.Conceptualize original ideas that bring simplicity and user-friendliness to complex design roadblocks.Create wireframes, storyboards, user flows, process flows and site maps to effectively communicate interaction and design ideasCreate banners for the app, advertisement, social media.Excellent understanding of typography, colour theory, and layoutsBe accountable for the outcome of the design and own the delivery, quality, and outcome of the design including the learning and iteration cycle.Collaborate actively with the Product Managers and Engineers to build best in class experiences, while pushing the needle of how front-end web & mobile technologies can help deliver experiences that delight.Create and manage the Design roadmap being alive and aligned with the overall Business and Product StrategyEvaluate competitive and innovative products and design approaches to identify best practices and encourage innovation.For Further information:Please visit mentioned website Moru.com.np or contact on 9801035347",
        "desc1": "As a Product/UI designer, you will be the champion of UI & UX Design within the organization and create simple, intuitive and efficient experiences for the co.",
        "desc2": "Create and execute all visual designs from concept to final hand-off to engineering.Conceptualize original ideas that bring simplicity and user-friendliness to complex design roadblocks.Create wireframes, storyboards, user flows, process flows and site maps to effectively communicate interaction and design ideasCreate banners for the app, advertisement, social media.Excellent understanding of typography, colour theory, and layoutsBe accountable for the outcome of the design and own the delivery, quality, and outcome of the design including the learning and iteration cycle.Collaborate actively with the Product Managers and Engineers to build best in class experiences, while pushing the needle of how front-end web & mobile technologies can help deliver experiences that delight.Create and manage the Design roadmap being alive and aligned with the overall Business and Product StrategyEvaluate competitive and innovative products and design approaches to identify best practices and encourage innovation.",
        "desc3": "",
        "Page_URL": "https://merojob.com/uiux-head/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/e6611287-fb00-4f00-bfe0-f2e662a7c0b8.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Senior Dot Net Developer",
        "level": "Senior Level",
        "vacancy": "[ 10 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Software Development\nAnalytical\nCommunication\nInterpersonal",
        "desc": "ResponsibilitiesTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAQualification and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc would be an added advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added value",
        "desc1": "Responsibilities",
        "desc2": "Translate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QA",
        "desc3": "Minimum 5 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)",
        "Page_URL": "https://merojob.com/senior-dot-net-developer-12/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/07fb2d26-2798-4d8f-b0e1-6a5dca12bb2d.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Dot Net Developer",
        "level": "Mid Level",
        "vacancy": "[ 4 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Analytical\nJavascript\nCommunication\nInterpersonal\nSoftware Development",
        "desc": "ResponsibilitiesTranslate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QAQualification and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 2 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)Preferable SkillsKnowledge of Javascript based front-end frameworks like ember.js, angular.js etc would be an added advantage.Working knowledge of MVC design patterns.Experience in Continuous Integration leveraging tools such as Bamboo and Maven.Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added value",
        "desc1": "Responsibilities",
        "desc2": "Translate application stories and requirements into functional applications.Design, code, and maintain efficient and reliable C# code.Write neat and clean code mostly for desktop application.Create test cases and follow test cases to implement the requirements.Maintain legacy code and implement the new requirements in best possible way.Prepare use case/ flow diagram when needed.Regular follow up for tasks assigned from development phase to QA",
        "desc3": "Minimum 2 years of experience in Software development using C#.Strong theoretical and practical knowledge of object-oriented programmingAbility to write reusable C# librariesFamiliar with design patternsExperience in writing unit test and integration testing in Nunit Framework.Knack for writing clean, readable C# code.Strong knowledge of Relational Databases, SQL, and ORM technologiesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Web Service Frameworks (RESTful, SOAP)",
        "Page_URL": "https://merojob.com/dot-net-developer-52/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/e9c6a299-5429-4710-9a1b-07181bc7cbc7.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Senior Java Developer",
        "level": "Senior Level",
        "vacancy": "[ 7 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Jquery\nAngular 5\nJavascript\nCommunication\nSoftware Development",
        "desc": "Experience developing enterprise applications with proven enterprise experience level with RDBMS and SQL (Oracle and/or Microsoft SQL Server) Experience with Continuous Integration and writing automated unit and integration tests Strong object-oriented programming skills using JavaKnowledge of relevant technologies inclusive of (Angular 5, JavaScript, JOuery) Knowledge of algorithms and data structures Familiar with design patterns Knowledge of secure coding practices as it pertains to OWASPKnowledge of Version Control Software tools such as SVN, bitbucketExperience with Software development/management tools using the Atlassian suite (JIRA, Confluence)  Experience with both Windows and Unix Operating systemQualification and Education RequirementsBS Computer Science or related field or equivalent industry experience At least 5 years of experience in Software developmentSoft SkillsAbility to work independently or as part of a team Experience of working in SCRUM/Agile team would be added value Desire and ability to continuously improve, discover and expand the limits Critical thinking has an opinion on various technological topics.",
        "desc1": "Soft Skills",
        "desc2": "Experience developing enterprise applications with proven enterprise experience level with RDBMS and SQL (Oracle and/or Microsoft SQL Server) Experience with Continuous Integration and writing automated unit and integration tests Strong object-oriented programming skills using JavaKnowledge of relevant technologies inclusive of (Angular 5, JavaScript, JOuery) Knowledge of algorithms and data structures Familiar with design patterns Knowledge of secure coding practices as it pertains to OWASPKnowledge of Version Control Software tools such as SVN, bitbucketExperience with Software development/management tools using the Atlassian suite (JIRA, Confluence)  Experience with both Windows and Unix Operating systemQualification and Education RequirementsBS Computer Science or related field or equivalent industry experience At least 5 years of experience in Software development",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-java-developer-45/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/11ce2c46-bd33-4e70-b9b0-60d60fb3bc0b.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Java Developer",
        "level": "Mid Level",
        "vacancy": "[ 6 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Css\nHtml\nJquery\nJavascript\nSoftware Development",
        "desc": "ResponsibilitiesInvolve in all stages of the project life cycle: requirements definition, design, and development. Translate application stories and requirements into functional applications. Write neat and clean code for desktop and web application. Create test cases and follow test cases to implement the requirements. Active participation in Project level discussion/meeting. Prepare use case/ flow diagram when needed. Regular follow up for tasks assigned from development phase to QA Qualification and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studies Must Have SkillsAt least 2 years of experience in Software development using J2SE and J2EE. Experience in parallel and multithreaded programming Knowledge of algorithms and data structures Interest in achieving maximum performance from available hardware and software Familiar with design patterns UI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery) Hands on knowledge on Spring Framework. Strong knowledge of Relational Databases, SQL, and ORM technologies Experience working with source control systems, such as Subversion, and GIT including branching and merging strategies. Preferable SkillsHands on knowledge on Apache Camel Framework Knowledge of testing frameworks/methodologies (TestNG, JUnit, TDD) Understanding of XML, JSON, web services technologies Experience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible) Experience in Continuous Integration leveraging tools such as Bamboo and Maven. Soft SkillsAbility to work independently or as part of a team Experience of working in SCRUM/Agile team would be added value Desire and ability to continuously improve, discover and expand the limits Critical thinking, has an opinion on various technological topics.",
        "desc1": "Responsibilities",
        "desc2": "Involve in all stages of the project life cycle: requirements definition, design, and development. Translate application stories and requirements into functional applications. Write neat and clean code for desktop and web application. Create test cases and follow test cases to implement the requirements. Active participation in Project level discussion/meeting. Prepare use case/ flow diagram when needed. Regular follow up for tasks assigned from development phase to QA ",
        "desc3": "At least 2 years of experience in Software development using J2SE and J2EE. Experience in parallel and multithreaded programming Knowledge of algorithms and data structures Interest in achieving maximum performance from available hardware and software Familiar with design patterns UI Development Skills (JavaFx, JavaScript, CSS, HTML, jQuery) Hands on knowledge on Spring Framework. Strong knowledge of Relational Databases, SQL, and ORM technologies Experience working with source control systems, such as Subversion, and GIT including branching and merging strategies. ",
        "Page_URL": "https://merojob.com/java-developer-118/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/fc50607b-e31f-468c-b0f3-91d30dd54f84.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Oracle- PL/SQL Developer",
        "level": "Mid Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Analytical\nLinux\nCommunication\nSoftware Development",
        "desc": "Experience Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.EducationBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesRequired Technical SkillMinimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo)Other SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added value",
        "desc1": "Experience ",
        "desc2": "Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.",
        "desc3": "Minimum 2 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.",
        "Page_URL": "https://merojob.com/oracle-plsql-developer-6/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/122ae500-bc71-49f9-8549-7d2ba5e01fc3.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Senior Oracle – PL/SQL DEVELOPER",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Analytical\nLinux\nCommunication\nSoftware Development",
        "desc": "ResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Qualification and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsAt least 5 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Shell, Perl Scripting languageExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added value",
        "desc1": "Responsibilities",
        "desc2": "Should have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.",
        "desc3": "At least 5 years of experience in Software development using PL/SQL, MS-SQL.Strong knowledge of Relational DatabasesMust be familiar with Oracle Optimization techniquesMust be familiar with basic Linux commandsStrong theoretical and practical knowledge of object-oriented programmingFamiliar with design patternsExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.",
        "Page_URL": "https://merojob.com/senior-oracle-plsql-developer-6/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/7947a442-9fcf-48fe-a9d5-9907c31d8695.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Senior Test Automation Engineer",
        "level": "Senior Level",
        "vacancy": "[ 5 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Communication\nSoftware Development",
        "desc": "ResponsibilitiesTest Automation Engineers would be expected to be doing following:Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Qualification and Education RequirementsBachelor Degree or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application Server",
        "desc1": "Responsibilities",
        "desc2": "Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.",
        "desc3": "Minimum 5 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.",
        "Page_URL": "https://merojob.com/senior-test-automation-engineer-3/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/d15e39c8-7541-4fce-8e37-695876a7c3ea.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Test Automation Engineer",
        "level": "Mid Level",
        "vacancy": "[ 5 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "Communication\nInterpersonal\nSoftware Development",
        "desc": "ResponsibilitiesTest Automation Engineers would be expected to be doing following:Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.Qualification and Education RequirementsBachelor’s degree or equivalent degree in Computer related studiesMust Have SkillsMinimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Preferable SkillsKnowledge of Relational DatabasesKnowledge of Build Scripting using MSBuild with BambooExperience of working in IIS Application Server",
        "desc1": "Responsibilities",
        "desc2": "Test Automation using Selenium in .NetTest Execution on various level (System Test, Regression Test, Smoke Test)Understand the existing products and business flowDefect reportingPrepare Testing platform (Application and Database)Performance Test using JMeterTest Automation of data/database level testingResearch/implementation of latest test automation frameworks.",
        "desc3": "Minimum 3 years of Software Development/Programming in the past or recently. Preferably in .Net.Must have experience of selenium test automation in .netMust have sound knowledge of Software TestingExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.",
        "Page_URL": "https://merojob.com/test-automation-engineer-6/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/1166e43e-2f3e-4c5a-8f94-4e4add1d96ae.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Business Analyst",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Problem Solving\nTime Management\nOrganizational\nCommunication\nInterpersonal",
        "desc": "The Business Analyst is the liaison between the agile sprint team and the business (SME, Product Manager and Product Owner). Works to create and refine the feature backlog in preparation for the next Program Increment through defining innovative improvements to business processes in order to meet the business requirements. Works with the Sprint Team to foster a collaborative atmosphere and provide clear understanding of the business problem being solved. Works well in a team-structured environment.Responsibilities Reviews existing legacy application documentation to develop an understanding of the existing functionality.Meets with business leadership (SME, Product Manager and Product Owner) to clarify business requirements.Documents existing business processes and proposes innovative improvements.Develops a clear definition and acceptance criteria for each of the features to ensure the business requirements will be addressed.Assists with documentation and prioritization of the business value associated with the business requirements.Develops product expertise.Conduct user acceptance testsQualifications Bachelor Degree in Computer or related field.5+ years of business analysis experience.Experience in an agile software development environment an asset.Possesses excellent communication, organizational and observational skills.Proficient problem solving skills with good judgment and decision making.Must work well as a member of a team.",
        "desc1": "The Business Analyst is the liaison between the agile sprint team and the business (SME, Product Manager and Product Owner). Works to create and refine the feature backlog in preparation for the next Program Increment through defining innovative improvements to business processes in order to meet the business requirements. Works with the Sprint Team to foster a collaborative atmosphere and provide clear understanding of the business problem being solved. Works well in a team-structured environment.",
        "desc2": "Reviews existing legacy application documentation to develop an understanding of the existing functionality.Meets with business leadership (SME, Product Manager and Product Owner) to clarify business requirements.Documents existing business processes and proposes innovative improvements.Develops a clear definition and acceptance criteria for each of the features to ensure the business requirements will be addressed.Assists with documentation and prioritization of the business value associated with the business requirements.Develops product expertise.Conduct user acceptance tests",
        "desc3": "",
        "Page_URL": "https://merojob.com/business-analyst-49/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/9988341a-a920-47ad-a9a8-50272d00f721.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Project Manager",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Time Management\nOrganizational\nCommunication\nInterpersonal",
        "desc": "ResponsibilitiesConduct and facilitate the planning. Help team to define their goals on each planning.Facilitate all the sprint rituals of own team.Coordinate with other teams on the Agile Release Train (ART) as needed. Participate in SOS to present own team's progress.Own team’s commitments and help team to achieve their goal.Help remove impediments and foster an environment for high-performing team dynamics, continuous flow, and relentless improvement.Help and guide the team to optimally plan their capacity.Make sure the team’s utilization is efficiently managed and has higher productivity.Conduct regular retrospective on every event. Make sure every action items have individual/team’s name and a date expected to get resolved with a follow up.Manage team’s RAID – Risk, Assumption, Issues and Dependencies.Compile, collect, produce and publish team’s report on different metrics.Work with Engineering manager for team’s development that helps the team to be more productive as well as efficient.Escalate to higher authority as required on any case that needs resolution from cross team.Coach the team in Scrum, Extreme Programming (XP), Kanban, and SAFe, ensuring that the agreed Agile process is being followed.Develop, document and conduct Agile development and process training as required – getting started and regular refresher training. Work with organization training manager/specialistRequirementsMinimum five years’ experience in similar role.",
        "desc1": "Responsibilities",
        "desc2": "Conduct and facilitate the planning. Help team to define their goals on each planning.Facilitate all the sprint rituals of own team.Coordinate with other teams on the Agile Release Train (ART) as needed. Participate in SOS to present own team's progress.Own team’s commitments and help team to achieve their goal.Help remove impediments and foster an environment for high-performing team dynamics, continuous flow, and relentless improvement.Help and guide the team to optimally plan their capacity.Make sure the team’s utilization is efficiently managed and has higher productivity.Conduct regular retrospective on every event. Make sure every action items have individual/team’s name and a date expected to get resolved with a follow up.Manage team’s RAID – Risk, Assumption, Issues and Dependencies.Compile, collect, produce and publish team’s report on different metrics.Work with Engineering manager for team’s development that helps the team to be more productive as well as efficient.Escalate to higher authority as required on any case that needs resolution from cross team.Coach the team in Scrum, Extreme Programming (XP), Kanban, and SAFe, ensuring that the agreed Agile process is being followed.Develop, document and conduct Agile development and process training as required – getting started and regular refresher training. Work with organization training manager/specialist",
        "desc3": "",
        "Page_URL": "https://merojob.com/project-manager-392/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/14d5e78d-b1ee-4b15-ac9d-34993d7f461b.jpg",
        "company": "COTIVITI NEPAL",
        "name": "Senior MS-SQL Developer",
        "level": "Senior Level",
        "vacancy": "[ 4 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Analytical\nCommunication\nInterpersonal",
        "desc": "ResponsibilitiesShould have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.Qualification and Education RequirementsBachelor of Engineering in Computer/IT or equivalent degree in Computer related studiesMust Have SkillsMinimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS. Preferable SkillsExperience with Atlassian suite of tools (Jira, Confluence, Bamboo, Crucible)Soft SkillsAbility to work independently or as part of a teamExperience of working in SCRUM/Agile team would be added valuePersuasive in both written and verbal communicationStrong Analytical SkillsUS Healthcare experience would be added value",
        "desc1": "Responsibilities",
        "desc2": "Should have strong knowledge on all stages of Software life cycle process: Planning, design, development, Testing and deployment.Understanding business requirements and technical documentsTranslate design into functional unit.Follow coding standard during developmentDevelop optimized queriesCreate unit test to validate changesActive participation in Project level discussion/meeting.Maintain legacy code and implement the new requirements in best possible way.Prepare Technical/flow diagram.Prepare documentation of the changes or legacy code base.",
        "desc3": "Minimum 5 years of experience in Software development using MS-SQL.Strong knowledge of Relational DatabasesExperience working with source control systems, such as Subversion, and GIT including branching and merging strategies.Knowledge of SSIS. ",
        "Page_URL": "https://merojob.com/senior-ms-sql-developer-2/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/020f7f24-1e4e-482e-a084-2e08e8d881e9.jpg",
        "company": "Infocom Solutions",
        "name": "Ful Stack .Net/ React developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Css3\nJavascript\nDatabase Design",
        "desc": "Design and implementation of the overall web architecture“Pixel-perfect” implementation of our approved user interfaceDesign and deployment of our databaseEnsuring the entire stack is designed and built for speed and scalabilityDesign and construction of our REST APIIntegrating our front-end UI with the constructed APIDesign and implementation of continuous integration and deploymentBusiness Overview Representation & liaisonSystem Integration Value Added ServicesEnd-to-End IT Project ManagementIT Consulting and Advisory ServicesSoftware Solutions Networking Equipments Applying Procedure:Applicants are requested to send their CV in mentioned mail : info@ispl.com.npOR,",
        "desc1": "Business Overview ",
        "desc2": "Design and implementation of the overall web architecture“Pixel-perfect” implementation of our approved user interfaceDesign and deployment of our databaseEnsuring the entire stack is designed and built for speed and scalabilityDesign and construction of our REST APIIntegrating our front-end UI with the constructed APIDesign and implementation of continuous integration and deployment",
        "desc3": "",
        "Page_URL": "https://merojob.com/ful-stack-net-react-developer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/a6cfe5f0-a034-4f46-b882-e3bb948780c0.jpg",
        "company": "Dish Media Network",
        "name": "Senior Fiber Technician",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Bhaisepati",
        "salary": "Negotiable",
        "deadline": "Oct. 13, 2020 23:55\n(3 days, 3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Reporting\nTime Management\nAnalytical\nCommunication",
        "desc": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performanceKeep track of the signal strength of different devices including SFP to provide adequate performanceTo maintain and prepare the audit report of network design from third party vendorsTo design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to SupervisorTo calculate the Bill of Quantities (BOQ) for ISP network infrastructure.To analyze overall optical power budget of Distribution Network. ",
        "desc1": "",
        "desc2": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performanceKeep track of the signal strength of different devices including SFP to provide adequate performanceTo maintain and prepare the audit report of network design from third party vendorsTo design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to SupervisorTo calculate the Bill of Quantities (BOQ) for ISP network infrastructure.To analyze overall optical power budget of Distribution Network. ",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-fiber-technician/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/062c326d-ca16-4954-ac39-7a54523a14e7.jpg",
        "company": "Dish Media Network",
        "name": "Junior Fiber Technician",
        "level": "Entry Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Bhaisepati",
        "salary": "Negotiable",
        "deadline": "Oct. 13, 2020 23:55\n(3 days, 3 hours from now)",
        "education": "Intermediate",
        "experience": "Equals to 2 years",
        "skills": "Computer Operation\nSpreadsheets",
        "desc": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performance.To design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to Supervisor.To analyze overall optical power budget of Distribution Network. ",
        "desc1": "",
        "desc2": "Able to use and operate Optical instruments and ODN Products. Mainly Splicing Machine, OTDR, FDB, JCs, Power Meter, PLC Splitter, EDFA, FTTH network design and WDM EDFA.Monitor the Optical network issues deployed in the different location and forward the issue to respective vendor and technicianMonitor the Fiber Trunk link connection for ISP headed and escalate the issue to designated VendorTake care of fiber splicing inside Point of Distribution premises and rectify fiber optic problem areasConduct timely inspections to make sure that faulty fiber optic system does not destabilize its performance.To design and use GIS, Google MAP or any geographical mapping software to track the FTTH deployed equipment’s.Coordination and reporting to Supervisor.To analyze overall optical power budget of Distribution Network. ",
        "desc3": "",
        "Page_URL": "https://merojob.com/junior-fiber-technician/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/2c074c84-e85b-43de-81fa-11ac8cca6a38.jpg",
        "company": "Tekkon Technologies",
        "name": "Sr. FullStack Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 16, 2020 23:55\n(6 days, 3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Reactjs\nApollo Graphql\nPostgressql\nNode.Js\nTypescript",
        "desc": "Creating professional dynamic web app forms & integrating them with a SQL DB.Handling large data sets, API calls, etc. Markdown editors. Image and file upload/download. Nginx and docker experience is highly desirable.Permissions systems, sign in/sign out and user account types with different components visible based on user type.Admin pages, changing users’ passwords, emails, etc. Setting up license trials for the app.UI design, charts, and dashboards.Bulk emailing of users based on actions made by users. Instant messaging.Company Benefits:A friendly, competitive, and creative working environment with foreign managersCompetitive salary (100k to 120k) based on experience.5 working days in a week(9 am – 5:30 pm)Timely salary review and performance bonus facilitiesAccess to the paid learning materials (udemy)Working with the latest technologiesLunch provided in the office (Currently Work From Home)Paid leave, sick leaveRefreshment, Recreational, team building activities.Applying Procedure:Interested candidates fulfilling the criteria mentioned above are highly encouraged to send a cover letter with their updated resume at jobs@tekkon.com.npOR,",
        "desc1": "Company Benefits:",
        "desc2": "Creating professional dynamic web app forms & integrating them with a SQL DB.Handling large data sets, API calls, etc. Markdown editors. Image and file upload/download. Nginx and docker experience is highly desirable.Permissions systems, sign in/sign out and user account types with different components visible based on user type.Admin pages, changing users’ passwords, emails, etc. Setting up license trials for the app.UI design, charts, and dashboards.Bulk emailing of users based on actions made by users. Instant messaging.",
        "desc3": "",
        "Page_URL": "https://merojob.com/backend-developer-nodejs-typescript/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/cd9cba53-ef89-4e23-9391-09d3f5d8e4ef.jpg",
        "company": "Tech One Global",
        "name": "Software Engineer (.net)",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 10, 2020 23:55\n(3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Javascript\nCss\nMs-Sql\nAngularjs\n.Net",
        "desc": "Web Application development and IntegrationActively participate in product design reviews by providing creative and practical ideas and solutions in a teamwork environmentIf you are confident that you are ready work with a challenging & winning global team, apply today.Applying Procedure:Interested candidates are requested to send their updated CV at careersnp@techoneglobal.comor call us at 977-9802311210OR,",
        "desc1": "If you are confident that you are ready work with a challenging & winning global team, apply today.",
        "desc2": "Web Application development and IntegrationActively participate in product design reviews by providing creative and practical ideas and solutions in a teamwork environment",
        "desc3": "",
        "Page_URL": "https://merojob.com/software-engineer-net-12/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/5476251b-3c66-4d3c-8157-79b42bd66ae4.jpg",
        "company": "Foreveryng",
        "name": "Android Developer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Sanepa, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 02, 2020 23:55\n(3 weeks, 2 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Html5\nSql/Sqlite\nBug Fixing",
        "desc": "We are looking for an Android developer with 2 Years or more of Experience & responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.Skill RequiredKnowledge of Java Kotlin and Android StudioUnderstanding of Android Application Framework and Design Patterns Good understanding of UI placement, Wire frames and Design FlowGood understanding of REST Api, SQL/SQLite , HTML5 & ScriptingShould have Worked on bug fixing and improving application performance.",
        "desc1": "We are looking for an Android developer with 2 Years or more of Experience & responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration with back-end services. You will be working along-side other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and creating quality products is essential.",
        "desc2": "Knowledge of Java Kotlin and Android StudioUnderstanding of Android Application Framework and Design Patterns Good understanding of UI placement, Wire frames and Design FlowGood understanding of REST Api, SQL/SQLite , HTML5 & ScriptingShould have Worked on bug fixing and improving application performance.",
        "desc3": "",
        "Page_URL": "https://merojob.com/android-developer-163/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/72624905-84ed-45b9-8e04-a9e8adebf07b.jpg",
        "company": "Sharelook PTE LTD",
        "name": "Front End Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "NRs. 35,000.00 - 70,000.00 Monthly",
        "deadline": "Oct. 16, 2020 23:55\n(6 days, 3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 3 years",
        "skills": "React Native\nJavascript\nCss\nHtml",
        "desc": "We are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.Front End Developers are required to work in teams alongside Back end Developers, Graphic Designers and User Experience Designers to ensure all elements of web creation are consistent. This requires excellent communication and interpersonal skills.Responsibilities:Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future use",
        "desc1": "We are looking for programmers with a keen eye for design for the position of Front End Developer. Front end Developers are responsible for ensuring the alignment of web design and user experience requirements, optimizing web pages for maximum efficiency and maintaining brand consistency across all web pages, among other duties.",
        "desc2": "Designing and developing user-facing web features using ReactJSLearning and working with new technology, and creating effective use of this in the businessBuilding reusable components and front-end libraries for future use",
        "desc3": "",
        "Page_URL": "https://merojob.com/front-end-developer-97/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ddc9a743-f5f7-4d15-89bb-362720af88b8.jpg",
        "company": "Himalayan Techies",
        "name": "HTML / CSS / JavaScript Developer",
        "level": "Mid Level",
        "vacancy": "[ 10 ]",
        "time": "Full Time",
        "address": "Babar Mahal, Kathmandu",
        "salary": "NRs. 20,000.00 Monthly",
        "deadline": "Oct. 31, 2020 18:00\n(2 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "More than 2 years",
        "skills": "Html5\nJavascript\nCss\nHtml\nJquery",
        "desc": "Good understanding of Javascript Beginner level familiarity with jQuery Good knowledge of HTML and CSSIn-Depth knowledge of CSS so that they could design-code keeping the responsiveness of the activities in mindMust have done at least 2 website or web app projects just to make sure about the fundamentals of web designing and web programmingKnowledge of AJAX, animation libraries, and UX would be a plusBonus skills adobe aftereffectsApplying Procedure:Interested candidates are requested to send their resume at careers@himalayantechies.com OR,",
        "desc1": "Applying Procedure:",
        "desc2": "Good understanding of Javascript Beginner level familiarity with jQuery Good knowledge of HTML and CSSIn-Depth knowledge of CSS so that they could design-code keeping the responsiveness of the activities in mindMust have done at least 2 website or web app projects just to make sure about the fundamentals of web designing and web programmingKnowledge of AJAX, animation libraries, and UX would be a plusBonus skills adobe aftereffects",
        "desc3": "",
        "Page_URL": "https://merojob.com/htmlcssjavascript-developer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/2e799859-f1c8-4f1b-a58d-323275991575.jpg",
        "company": "Foreveryng",
        "name": "Front- End Developer",
        "level": "Senior Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Sanepa Height, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 02, 2020 23:30\n(3 weeks, 2 days from now)",
        "education": "More than 2 years",
        "experience": "Javascript\nSass\nReact\nVue\nUi/Ux",
        "skills": "",
        "desc": "Design UI/UX for Website and Mobile Application using tools like Figma or similar toolsConvert UI/UX designs into responsive website using front-end technologies, languages and frameworksImplement API to develop and maintain dynamic website",
        "desc1": "",
        "desc2": "Design UI/UX for Website and Mobile Application using tools like Figma or similar toolsConvert UI/UX designs into responsive website using front-end technologies, languages and frameworksImplement API to develop and maintain dynamic website",
        "desc3": "",
        "Page_URL": "https://merojob.com/uiux-web-and-mobile-application-designer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/4f72a143-7da5-4b64-aa27-bf2ab2cc83b4.jpg",
        "company": "Tej Solution",
        "name": "Word Press Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 02, 2020 23:55\n(3 weeks, 2 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Css3\nHtml5\nJquery\n\nJavascript",
        "desc": "We are seeking an experienced, motivated and resourceful PHP / WordPress developer with a blend of back-end and front-end skills to serve as lead developer. In this highly collaborative role, you will work with front end developers, designers and content developers to build efficient, beautiful and responsive media/news focused websites.Responsibilities:Code new WordPress themes, page templates, and plugins from scratch and modify existing themes and pluginsCandidates with experience in Graphic Design, Java Script, HTML & CSS will be preferableBuild efficient, testable, and reusable PHP modules including dynamic content and personalization featuresIntegrate wide range of WordPress plugins, API calls and third party apps and forms, such as EloquaManage back-end services and interchange of data between server and user, including server-side logic and database integrationEnsure high performance and responsiveness to requests from front-endProvide front-end development of digital marketing communications, including full websites and micro-sites, landing pages, emails, and other initiativesDevelop, test and troubleshoot across multiple browsers, platforms and devices, including tablets and smartphones, to support a consistent and positive customer experienceProvide guidance on SEO best practices for site developmentResearch and recommend new technologies and tools for effective integration across various platforms",
        "desc1": "We are seeking an experienced, motivated and resourceful PHP / WordPress developer with a blend of back-end and front-end skills to serve as lead developer. In this highly collaborative role, you will work with front end developers, designers and content developers to build efficient, beautiful and responsive media/news focused websites.",
        "desc2": "Code new WordPress themes, page templates, and plugins from scratch and modify existing themes and pluginsCandidates with experience in Graphic Design, Java Script, HTML & CSS will be preferableBuild efficient, testable, and reusable PHP modules including dynamic content and personalization featuresIntegrate wide range of WordPress plugins, API calls and third party apps and forms, such as EloquaManage back-end services and interchange of data between server and user, including server-side logic and database integrationEnsure high performance and responsiveness to requests from front-endProvide front-end development of digital marketing communications, including full websites and micro-sites, landing pages, emails, and other initiativesDevelop, test and troubleshoot across multiple browsers, platforms and devices, including tablets and smartphones, to support a consistent and positive customer experienceProvide guidance on SEO best practices for site developmentResearch and recommend new technologies and tools for effective integration across various platforms",
        "desc3": "",
        "Page_URL": "https://merojob.com/word-press-developer-7/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/68d923f7-84f8-4868-b396-e326576c5a68.jpg",
        "company": "Genese Solution",
        "name": "PHP Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 17, 2020 23:55\n(1 week from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 4 years",
        "skills": "Php Framework\nLampstack",
        "desc": "Reports to: Team LeadDuties and Responsibilities:Designing and building enterprise-level learning management systems based on PHP frameworksPerform design, configure, customize and implement responsive and effective LMS systemsImplement multi-tenancy scalable architectureIntegrate and develop plugins when requiredPlanning and implementing API integrations with third parties when requiredAnalyze business processes, and user requirementsSupport PHP implementations and resolve any technical issuesQualifications:Bachelor’s Degree in Computer Science or related field4-5 years of experience in the LAMP stackPractical knowledge of OOP Working experience with different PHP frameworksExperience working with GITExperience working with different MVC FrameworksWorking experience of Laravel PHP Framework is a big plusNice to have:Involvement in Open Source projectsExperience of API integrationExperience with Continuous IntegrationWorking experience in Customizing functionalitiesExperience in XML data structures and Web Services (SOA)What we offer:A friendly, competitive and creative working environment5 working days in a week (09:00am-06:00 pm)Refreshment, Recreational, team building activitiesOpportunity to travel countries as part of training and developmentWork in the leadership firm in Cloud Computing in NepalWork in multidisciplinary areas in start-up ecosystemGet to know the working culture of companies like Amazon, Microsoft, Google, Alibaba being affiliates for them in NepalExposure in team management and leadershipApplying ProcedureSuitable candidates meeting the above criteria are requested to send their CV and cover letter to careers@genese.com.np . Only shortlisted candidates will be invited for the further selection process. You are requested to clearly mention the position you are applying for in the subject of the email.OR,",
        "desc1": "Reports to: Team Lead",
        "desc2": "Designing and building enterprise-level learning management systems based on PHP frameworksPerform design, configure, customize and implement responsive and effective LMS systemsImplement multi-tenancy scalable architectureIntegrate and develop plugins when requiredPlanning and implementing API integrations with third parties when requiredAnalyze business processes, and user requirementsSupport PHP implementations and resolve any technical issues",
        "desc3": "Involvement in Open Source projectsExperience of API integrationExperience with Continuous IntegrationWorking experience in Customizing functionalitiesExperience in XML data structures and Web Services (SOA)",
        "Page_URL": "https://merojob.com/php-developer-279/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ed046b12-7ba2-4ea5-8fc9-508f726dc2a0.jpg",
        "company": "EBPearls",
        "name": "Trainee",
        "level": "Entry Level",
        "vacancy": "[ 1 ]",
        "time": "Traineeship ,\nFull Time",
        "address": "Lalitpur, Nepal",
        "salary": "Negotiable",
        "deadline": "Oct. 25, 2020 23:55\n(2 weeks, 1 day from now)",
        "education": "Bachelor",
        "experience": "Not Required",
        "skills": "Problem Solving\nTime Management\nAnalytical\nCommunication",
        "desc": "Are you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award-winning Development team?We are looking for enthusiastic Trainees. This position is an entry-level position for the development team at EB Pearls. Trainees go through an insightful learning experience from beginning to completion of a sample project based on a real work environment under the direct supervision of our experienced Project Managers and Tech Leads.Key Roles and Responsibilities:Learn website and web application development in one or more frameworks Understand, analyze and modify existing codes and popular open sources Understand and analyze the clients' requirements Get involved in discussions pertaining to critical project issues and contribute to the\nteam effort in finding solutions to problems at hand Other duties and responsibilities as directed by Project Managers and/or mentorsPerks and Benefits:We strive to make sure that our people are comfortable, happy, and growing at EB Pearls. We offer:Insurance: We enroll our employees in the company's group insurance policy that covers both medical and accidental insurance.Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standardsTimely performance appraisal and salary reviews: We conduct bi-yearly performance reviews to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to complement.Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays.Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our peopleSocial Security Fund: SSF is a contribution-based social security scheme, the employeecontributes 11 % and the employer adds 20% of the basic salary per month( 31% of thebasic salary of the employee) every month.Festival Allowance: We have the provision of festival allowance and provide a Dashainbonus which is based on the amount of employees’ basic salary.Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly.Work on next-generation technology projectsWork with leading-edge technologyFun At EBAll work and no play is not our cup of tea. At EB, we enjoy:Office Events: Chat and Chew, Residential Annual Event, Team Lunch OutEEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out eventsFood and Coffee: Office Provided lunch and stocked pantryInspiring Colleagues: Fun and friendly work environment with brilliant one of a kindApplying Procedure:Submit a cover letter along with your recent updated resume via email to\n“careers@ebpearls.com” with “Application for Flutter/ Android/iOS Trainee” as per your\ninterested platform in the subject line. OR,\nSend your application via our website:\nhttps://ebpearls.com.au/apply-now/?jobid=583547000001665013OR,",
        "desc1": "Are you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award-winning Development team?",
        "desc2": "Learn website and web application development in one or more frameworks Understand, analyze and modify existing codes and popular open sources Understand and analyze the clients' requirements Get involved in discussions pertaining to critical project issues and contribute to the\nteam effort in finding solutions to problems at hand Other duties and responsibilities as directed by Project Managers and/or mentors",
        "desc3": "Office Events: Chat and Chew, Residential Annual Event, Team Lunch OutEEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out eventsFood and Coffee: Office Provided lunch and stocked pantryInspiring Colleagues: Fun and friendly work environment with brilliant one of a kind",
        "Page_URL": "https://merojob.com/trainee-30/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/84486c56-f64c-4775-960c-36a339cfac16.jpg",
        "company": "Pioneer Associate",
        "name": "Hybrid Mobile Apps Engineer",
        "level": "Mid Level",
        "vacancy": "[ 5 ]",
        "time": "Full Time",
        "address": "Kathmandu, Nepal",
        "salary": "Negotiable",
        "deadline": "Oct. 12, 2020 23:55\n(2 days, 3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Angular Js\nTeamwork\nCommunication\nMvc.Net\nJavascript\nJquery",
        "desc": "QualificationsBE, BSCIT, Bachelor Degree in IT related field.1+ years of experience in mobile app development.Communication skill with strong quantitative background.Competent, smart, result-oriented and self-motivated.Ability to work well in a team.Knowledge & Skills Programming skill in phonegap, ionic, flutter, javascript, jquery, angular js.Knowledge and experience of MVC.NET.Knowledge of MVC and API will be an added advantage.Knowledge working with code repositories (SVN Git).Applying Procedure:The applicants are requested to send their resume within 12th Oct, 2020 on the following email id: hr@cosys.com.np. Only short listed candidates will be contacted for the further process of recruitment.OR,",
        "desc1": "Qualifications",
        "desc2": "BE, BSCIT, Bachelor Degree in IT related field.1+ years of experience in mobile app development.Communication skill with strong quantitative background.Competent, smart, result-oriented and self-motivated.Ability to work well in a team.",
        "desc3": "",
        "Page_URL": "https://merojob.com/hybrid-mobile-apps-engineer-2/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/8bbb6109-6346-4008-bb70-c9253a468426.jpg",
        "company": "ContentioLab",
        "name": "Technical Writers (Work From Home)",
        "level": "Entry Level",
        "vacancy": "[ 12 ]",
        "time": "Full Time",
        "address": "Kathmandu (Work from Home)",
        "salary": "NRs. 20,000.00 Monthly",
        "deadline": "Nov. 06, 2020 23:55\n(3 weeks, 6 days from now)",
        "education": "Bachelor",
        "experience": "Not Required",
        "skills": "Critical Thinking\nMultitasking\nCommunication",
        "desc": "Research, write, edit and  technical dataCreate, maintain and update manuals, procedures, specifications and other documentsCreate, maintain and update installation instructions, training material and other technical documentsDesign and establish style guidelines and standards for texts and illustrations to meet business needsReview, revise, modify or edit documents prepared by othersCoordinate project plans, budget and determine resourcesCompile, organize and write online help files to support end-usersWrite technical documents in compliance to the company’s established standards and guidelinesProvide writing, editing and design support to other team membersCategories:Computer Engineering/Bsc. CsIT -2; Proficiency in C#, .net, R-Programming Mechanical - 2Electrical - 3Electronics & Communication - 4Telecom- 1Office Hours:Morning Shift: 7:00 AM to 3:00 PMWorking Days: 6 Days a WeekNote:Fresher can apply. Training will be provided.Selected candidates will be writing Technical & Engineering Reports for clients based in UK & Australia.Knowledge with good software fluency will be prioritizedApplying Procedure:Applicants are requested to drop their application letter and CV/Bio-data to hr@contentiolab.com\nCV Should Contain All Of The Academic Scores From Schooling To Your Recent Qualification. Only shortlisted candidates will be scheduled for an online Interview and further selection process(es).OR,",
        "desc1": "Categories:",
        "desc2": "Research, write, edit and  technical dataCreate, maintain and update manuals, procedures, specifications and other documentsCreate, maintain and update installation instructions, training material and other technical documentsDesign and establish style guidelines and standards for texts and illustrations to meet business needsReview, revise, modify or edit documents prepared by othersCoordinate project plans, budget and determine resourcesCompile, organize and write online help files to support end-usersWrite technical documents in compliance to the company’s established standards and guidelinesProvide writing, editing and design support to other team members",
        "desc3": "Fresher can apply. Training will be provided.Selected candidates will be writing Technical & Engineering Reports for clients based in UK & Australia.Knowledge with good software fluency will be prioritized",
        "Page_URL": "https://merojob.com/technical-writers-work-from-home-2/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/3860e29b-9e82-42f5-97d5-6bd861507b6c.jpg",
        "company": "Concinnity Limited",
        "name": "Senior Node JS Backend Developer",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Part Time",
        "address": "Kathmandu",
        "salary": "NRs. 40,000.00 - 60,000.00 Monthly",
        "deadline": "Nov. 07, 2020 23:55\n(4 weeks from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Css3\nHtml5\nNode.Js\nWeb Development",
        "desc": "We are looking for a Node.js Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.Responsibilities:Integration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsIntegration of data storage solutionsImplementation of security and data protection",
        "desc1": "We are looking for a Node.js Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.",
        "desc2": "Integration of user-facing elements developed by front-end developers with server side logicWriting reusable, testable, and efficient codeDesign and implementation of low-latency, high-availability, and performant applicationsIntegration of data storage solutionsImplementation of security and data protection",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-backend-developer-5/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/74a34247-47cd-40ff-8fe1-f9ab9b7b6754.jpg",
        "company": "Concinnity Limited",
        "name": "Senior Front-end Developer (Angular)",
        "level": "Senior Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "NRs. 40,000.00 - 60,000.00 Monthly",
        "deadline": "Nov. 07, 2020 23:55\n(4 weeks from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 5 years",
        "skills": "Html5\nCss\nCommunication\nSearch Engine Optimization (Seo)",
        "desc": "We are looking for an AngularJS Developer responsible for the client side of our service. Your primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. Your main duties will include creating modules and components and coupling them together into a functional app. The artistic design will be delivered to you, together with a few HTML templates, but we will ask for your help in regard to animations, CSS, and final HTML output. You will work in a team with the back-end developer, and communicate with the API using standard methods. A thorough understanding of all of the components of our platform and infrastructure is required.ResponsibilitiesDelivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building the RESTful APICommunicating with external web services",
        "desc1": "We are looking for an AngularJS Developer responsible for the client side of our service. Your primary focus will be to implement a complete user interface in the form of a mobile and desktop web app, with a focus on performance. Your main duties will include creating modules and components and coupling them together into a functional app. The artistic design will be delivered to you, together with a few HTML templates, but we will ask for your help in regard to animations, CSS, and final HTML output. You will work in a team with the back-end developer, and communicate with the API using standard methods. A thorough understanding of all of the components of our platform and infrastructure is required.",
        "desc2": "Delivering a complete front end applicationEnsuring high performance on mobile and desktopWriting tested, idiomatic, and documented JavaScript, HTML and CSSCoordinating the workflow between the graphic designer, the HTML coder, and yourselfCooperating with the back-end developer in the process of building the RESTful APICommunicating with external web services",
        "desc3": "",
        "Page_URL": "https://merojob.com/senior-front-end-developer-angular/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/1ba564cc-b1ad-4350-9c9b-a3d15757f73a.jpg",
        "company": "NBIT",
        "name": "Software Engineer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kumaripati, Lalitpur",
        "salary": "Negotiable",
        "deadline": "Nov. 07, 2020 23:55\n(4 weeks from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "C#\nJavascript\nWeb Development\nAsp.Net\nAgile Development",
        "desc": "Utilize established development tools, guidelines and conventions including but not limited to ASP.NET, SQL Server, HTML/HTML5/XHTML, CSS, JavaScript, and C#Design, code and test new web & Windows software applicationsEnhance existing systems by analyzing business objectives, preparing an action plan and identifying areas for modification and improvementMaintain existing software systems by identifying and correcting software defectsResearch and develop skills in new technologiesProactively initiate, develop, and maintain effective working relationships with team membersWe Provide:Provident fund schemesWorking in a team environment where initiative and dedication is encouragedHigh level of responsibility and excellent career possibilitiesOpen international work environment5 Working Days per WeekDashain BonusFlexible working environmentTeam Building ActivitiesTimely Salary Review and Performance Appraisals",
        "desc1": "We Provide:",
        "desc2": "Utilize established development tools, guidelines and conventions including but not limited to ASP.NET, SQL Server, HTML/HTML5/XHTML, CSS, JavaScript, and C#Design, code and test new web & Windows software applicationsEnhance existing systems by analyzing business objectives, preparing an action plan and identifying areas for modification and improvementMaintain existing software systems by identifying and correcting software defectsResearch and develop skills in new technologiesProactively initiate, develop, and maintain effective working relationships with team members",
        "desc3": "",
        "Page_URL": "https://merojob.com/software-engineer-104/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/b60a01ea-51e4-4401-b4ad-fda8251a2feb.jpg",
        "company": "Executive Search- merojob",
        "name": "PHP-Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "kathmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 13, 2020 23:55\n(3 days, 3 hours from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 2 years",
        "skills": "Linux\nPhp\nMysql\nApache",
        "desc": "Perfection in working with LAMP (Linux, Apache, MySQL, PHP).Need to possess a good knowledge of software engineering life cycle, database relations, and data structures.Needs to have a good knowledge in custom programming with Object Oriented Approach.Needs to have a good knowledge of VueJs and custom Javascript.The applicant must be able to work using MySQL backend and PHP object oriented programming for the development of web based applications. A bit of CSS 3 and HTML 5 experience is expected.Knowledge of   Laravel framework  will add to the applicant’s value.Knowledge of AWS preferred.",
        "desc1": "",
        "desc2": "Perfection in working with LAMP (Linux, Apache, MySQL, PHP).Need to possess a good knowledge of software engineering life cycle, database relations, and data structures.Needs to have a good knowledge in custom programming with Object Oriented Approach.Needs to have a good knowledge of VueJs and custom Javascript.The applicant must be able to work using MySQL backend and PHP object oriented programming for the development of web based applications. A bit of CSS 3 and HTML 5 experience is expected.Knowledge of   Laravel framework  will add to the applicant’s value.Knowledge of AWS preferred.",
        "desc3": "",
        "Page_URL": "https://merojob.com/php-developer-282/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ad41aae4-c911-4116-b6fc-4538c9d2610d.jpg",
        "company": "",
        "name": "",
        "level": "",
        "vacancy": "",
        "time": "",
        "address": "",
        "salary": "",
        "deadline": "",
        "education": "",
        "experience": "",
        "skills": "",
        "desc": "",
        "desc1": "",
        "desc2": "",
        "desc3": "",
        "Page_URL": "https://merojob.com/java-backend-engineer/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/bcb6606a-8302-45f1-96fb-a3ba0e6d9c7a.jpg",
        "company": "EBPearls",
        "name": "Junior iOS Developer",
        "level": "Mid Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Kandevsthan",
        "salary": "Negotiable",
        "deadline": "Oct. 28, 2020 23:55\n(2 weeks, 4 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 1 year",
        "skills": "Orm And Rdbms\nCoredata\nCocoa Touch",
        "desc": "Position OverviewAre you passionate about developing state of the art web and mobile app solutions? Do you want to work with the award winning iOS App Development team?We are looking for iOS Developers who will be a responsible member of the Mobile Apps development team, the largest team at EB Pearls. This position is responsible for developing projects as per clients’ requirements. iOS developer reports directly to the Project Manager and is accountable for the Project Development.Job Roles and Responsibilities1. Project AccountabilityUnderstand the project requirements clearlyGenerate queries in case there is any confusion in understanding the projectDiscuss any technical challenges that might come affront while working on the projectRealize the project delivery date and understand the communication channelsWrite codes to develop a quality product on timeConduct first hand testing of the project tasks before submitting the tasks to the Project ManagerVerify the product with SRS2. Adapt to EB Work CultureAttend project meetings conducted by Project Manager with full preparation by studying the project documents and information.Follow company coding standards.3. Team CoordinationTake ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.Perks and BenefitsWe strive to make sure that our people are comfortable, happy and growing at EB Pearls.We offer:Insurance: We enroll our employees in the company's group insurance policy that covers both medial and accidental insurance.Competitive Salary: We strive to ensure that our people get competitive remuneration as per the industry standardsTimely performance appraisal and salary reviews: We conduct bi yearly performance review to ensure that our people are always on top of their game and ensure yearly salary review on a timely basis to compliment.Paid Time Off (PTO)/ Paid Holidays: PTO refers to days when you can take time away from work while still being paid your usual salary. We provide 13 business days off as festival holidays.Employee Recognition: We are a company led by performers and we never fail to acknowledge the exemplary performance of our peopleSocial Security Fund: SSF is a contribution based social security scheme, the employee contributes 11 % and the employer adds 20% of the basic salary per month( 31% of the basic salary of employee) every month.Festival Allowance: We have the provision of festival allowance and provide Dashain bonus which is based on the amount of employees’ basic salary.Training and Development Programs: We are obsessed with constantly developing our competencies. Hence, we determine the training needs for our people from the performance review that we conduct bi- yearly.Work on next generation technology projectsWork with leading edge technologyFun At EBAll work and no play is not our cup of tea. At EB, we enjoy:Office Events: Chat and Chew, Residential Annual Event, Team Lunch OutEEC Club Activities: Night outs, Picnics, Lunch Outs, Futsal, Festival Events, Pool Parties, Day out eventsFood and Coffee: Office Provided lunch and stocked pantryInspiring Colleagues: Fun and friendly work environment with brilliant one of a kind teamApplying ProcedureSubmit a cover letter along with your recently updated resume via email to “careers@ebpearls.com” with “Application for Junior iOS Developer” in the subject line.OR,Send your application via our website https://ebpearls.com.au/apply-now/?jobid=583547000001704274OR,",
        "desc1": "Position Overview",
        "desc2": "Understand the project requirements clearlyGenerate queries in case there is any confusion in understanding the projectDiscuss any technical challenges that might come affront while working on the projectRealize the project delivery date and understand the communication channelsWrite codes to develop a quality product on timeConduct first hand testing of the project tasks before submitting the tasks to the Project ManagerVerify the product with SRS",
        "desc3": "Take ownership of the project from planning to the delivery of the project.Be easily approachable and flexible in work.",
        "Page_URL": "https://merojob.com/ios-developer-103/"
    },
    {
        "logo": "https://merojob.com/media/uploads/job_logo/ae8806fe-eaf4-424d-b67c-15bbfe7edc7b.jpg",
        "company": "Socheko.com",
        "name": "Front End Developer",
        "level": "Mid Level",
        "vacancy": "[ 2 ]",
        "time": "Full Time",
        "address": "Kathmandu",
        "salary": "Negotiable",
        "deadline": "Nov. 09, 2020 23:55\n(1 month from now)",
        "education": "Bachelor",
        "experience": "Not Required",
        "skills": "",
        "desc": "Skill full in Website designing\nKnowledge about JS frontend\ntechnologyExperience on Data\n Visualization & Familiar with Developer tools HTML5, SASS (CSS 3)Have to possess good\nknowledge of software life cycle, database relations, and data structuresShould be able to write\nlibraries and modular codes from scratch.Deep understanding of JS\nprogramming, database modelling and design, scalable web architecture",
        "desc1": "",
        "desc2": "Skill full in Website designing\nKnowledge about JS frontend\ntechnologyExperience on Data\n Visualization & Familiar with Developer tools HTML5, SASS (CSS 3)Have to possess good\nknowledge of software life cycle, database relations, and data structuresShould be able to write\nlibraries and modular codes from scratch.Deep understanding of JS\nprogramming, database modelling and design, scalable web architecture",
        "desc3": "",
        "Page_URL": "https://merojob.com/front-end-developer-98/"
    },
    {
        "logo": "",
        "company": "",
        "name": "Director of Applications Development",
        "level": "Top Level",
        "vacancy": "[ 1 ]",
        "time": "Full Time",
        "address": "Katmandu",
        "salary": "Negotiable",
        "deadline": "Oct. 20, 2020 23:55\n(1 week, 3 days from now)",
        "education": "Bachelor",
        "experience": "More than or equals to 10 years",
        "skills": "More than 30 years",
        "desc": "Altigen Communications, a leader in UC communications platform\nproducts, is seeking a Director of Applications Development to lead our Asia engineering\nteam and contribute to our strategic success and expansion in the global marketplace.\nThe ideal candidate will lead multiple groups of engineers to develop Azure-based\ncommunications software for Microsoft Teams. \nHe/she needs to have strong leadership and management skills, solid\ndomain expertise in telecom, networking and Microsoft based communications, along\nwith experience in the full Software Development Life Cycle.  \nResponsibilitiesManage multiple Agile development groups and provide technical guidance to EngineersArchitect, design and develop software for Altigen's leading edge UC communications solutions for Microsoft TeamsCreate Software Specifications based on customer and market requirements Manage existing product sustaining and interact with QA and Technical Support",
        "desc1": "Altigen Communications, a leader in UC communications platform\nproducts, is seeking a Director of Applications Development to lead our Asia engineering\nteam and contribute to our strategic success and expansion in the global marketplace.\nThe ideal candidate will lead multiple groups of engineers to develop Azure-based\ncommunications software for Microsoft Teams. \nHe/she needs to have strong leadership and management skills, solid\ndomain expertise in telecom, networking and Microsoft based communications, along\nwith experience in the full Software Development Life Cycle.  ",
        "desc2": "Manage multiple Agile development groups and provide technical guidance to EngineersArchitect, design and develop software for Altigen's leading edge UC communications solutions for Microsoft TeamsCreate Software Specifications based on customer and market requirements Manage existing product sustaining and interact with QA and Technical Support",
        "desc3": "",
        "Page_URL": "https://merojob.com/director-of-applications-development-2/"
    }
]
