[{"name": "Documentation & Database Officer", "company": "Swisscontact", "level": "", "vacancy": "", "time": "Contract", "address": "Nepal", "salary": "As Per Organization's Rule", "deadline": "2020-12-15", "desct": "Job DescriptionSwisscontact is a leading partner organisation for the implementation of international development projects. We promote inclusive economic, social and ecological development to make an effective contribution towards sustainable and widespread prosperity in developing and emerging economies. Government of Nepal (GoN) and Government of Switzerland have been implementing Nepal Vocational Qualifications System Project (NVQS-P) since 2015. The Swiss Agency for Development and Cooperation (SDC) is providing financial and technical assistance to the GoN (Council for Technical Education and Vocational Training (CTEVT)/Ministry of Education, Science and Technology (MoEST)) for the implementation of the project. Swisscontact Nepal has set up a technical assistance team- Project Support Unit (PSU) on behalf of SDC.For the second Phase of NVQS-P, we invite applications from committed and experienced Nepali citizens for the following position.Documentation & Database Officer (1)Location:NVQS PSU Office, Bhaktapur with occasional field-visitsReports to:Deputy Team Leader - ManagementDuration:One year with possibility of extensionPurpose of the JobUnder the direct supervision of Deputy Team Leader - Management, this position is responsible to support the design and implementation of the project documentation and database strategies ensuring adherence to the log frame targets and secure the sustained system of documentation and data retrieval.Qualification and ExperienceThe individual must conform to the following qualifications and expertise:Bachelor’s degree in Computer/Information Technology (IT) or other relevant fields.Minimum of three years relevant working experience in IT, database, communication and documentation or other related field.Candidate should have an extensive experience in IT and database management and documentation.Good knowledge of new technologies and experience of providing IT support will be an assetDownload Detailed JDApply InstructionsApplication Procedures:Please submit your current CV with at least two referees, Job Application Form and a cover letter tonp.info@swisscontact.orglatest by 15 December 2020.Please mention the position applied for in the \"subject\" line of your email.Swisscontact Nepal shall not entertain any phone enquiries or other such solicitations for these positions. Only shortlisted candidates will be contacted for the selection process. Swisscontact Nepal reserves the right to reject any or all applications.Swisscontact Nepal promotes workforce diversity and applies positive discrimination to candidates from discriminated groups (Women, Dalit, Janajati, Madhesi/Terai and other minority communities).", "Page_URL": "https://www.ramrojob.com/documentation-database-officer", "websitename": "ramrojob.com"}, {"name": "React Native DeveloperMid Level", "company": "Bitspanda Technology Pvt Ltd", "level": "Mid Level", "vacancy": "2", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "2020-12-31", "desct": "Job DescriptionCreate beautiful, pixel-perfect UIs across both mobile platforms that look and feel nativeLeverage native APIs for deep integrations with both platformsWork alongside our product owner and UI/UX designers to realize your shared visionWrite automated tests that give us the confidence to iterate quickly and ensure the product is of the highest qualityDiagnose and fix bugs and performance bottlenecksEngage with the React Native community to report, request, and help implement critical software fixesMaintain a stable and current-when-possible React Native create environment for our CI pipelineStay current on the latest platform capabilities so that we know what’s possiblePractice Scrum with a great group of developers and product managersJob SpecificationFirm grasp of modern JavaScript and TypeScriptDeep React Native experience, bonus for ReactJS experienceProficiency with HTML, CSS, JavaScriptSolid understanding of object-oriented programming, functional programming, and design patternsAbility to write clean, understandable, well-documented codeComfortable working with third-party dependencies and debugging dependency conflictsFamiliarity with native create tools, like Xcode, Android Studio/IntelliJ, and GradleExperience with native Android and iOS SDKs preferred (bonus for Swift/Kotlin)Deep experience working with and debugging RESTful APIsExperiences with automated testing frameworks, likeJest or MochaApply InstructionsInterested candidates can send their updated CV at bitspandatechnology@gmail.com", "Page_URL": "https://www.ramrojob.com/react-native-developer-4", "websitename": "ramrojob.com"}, {"name": "Asp .Net Core DeveloperMid Level", "company": "Bitspanda Technology Pvt Ltd", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kupondole", "salary": "Negotiable", "deadline": "2020-12-31", "desct": "Job DescriptionProven ability in leading the design and development of API or data integration applications.Expertise in web services, Rest, WCF, and WebAPI.Superior ability to develop web applications using C#, .Net Core, etc.Demonstrated knowledge of SQL Server database design and advanced query techniques (DML and performance tuning).Experience in Entity framework performance tuning.Experience with SSIS and/or Reporting Services;Strong understanding of design patterns, architecture, and best practices in development and deployment.Strong refactoring skills.Practices Test-driven development and does continuous integration.Ability to manage concurrent projects while meeting project deadlines;Detail oriented with the ability to work independently or as part of a team;Demonstrated skills in providing accurate project coding timelines and estimates.Extensive experience in Object-Oriented Programming and Software Development Life Cycle methodologies including Agile.Demonstrated experience in recommending technology solutions, techniques, and processes for the department- and/or corporate-wide implementationsAptitude for mentoring junior developersJob SpecificationNET Core DevelopmentMicroservicesMVC, Web API 2, JavaScript, JQueryObject Oriented Design PrinciplesSQL ServerCloud (AWS, GCP, Azure)Docker Containers PREFERREDDevOps Pipeline Automation/Integration PREFERREDApply InstructionsInterested candidates can send their CVs online or atcareer@bitspanda.com. Candidates are requested to clearly specify the position that they are applying for. Failure to do so will automatically disqualify the candidate.", "Page_URL": "https://www.ramrojob.com/asp-net-core-developer-1", "websitename": "ramrojob.com"}, {"name": "IT Engineer and Technical Assistant", "company": "T.U. Teaching Hospital", "level": "", "vacancy": "", "time": "Full Time", "address": "Nepal", "salary": "As Per Organization's Rule", "deadline": "2020-12-15", "desct": "Job DescriptionClick the image for detail", "Page_URL": "https://www.ramrojob.com/it-engineer-and-technical-assistant", "websitename": "ramrojob.com"}, {"name": "Project Manager SoftwareMid Level", "company": "Classic Tech Pvt. Ltd", "level": "Mid Level", "vacancy": "1", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "2020-12-16", "desct": "Job DescriptionA self-starter with a great work ethic and an eagerness to keep up to date with leading technological trends in the automated testing spaceConduct and facilitate the planning. Help team to define their goals on each planning.Facilitate all the sprint rituals of own team.Help and guide the team to optimally plan their capacityMake sure the team’s utilization is efficiently managed and has higher productivity.Compile, collect, produce and publish team’s report on different metrics.Develops test cases and data and test all changes and new modulesDevelop Software as assigned by Senior ManagementJob SpecificationCandidate having 3 years plus experience in Software Development and Quality ControlNon Coder but having strong knowledge about Mobile Applications and SoftwareMust have Bug analysis capabilityHands-on experience in PHP and JAVA Object-Oriented Programming design concepts and software development processes and methodsStrong knowledge of UI/UX, Android, IOSExcellent troubleshooting and communication skills( Verbal and Written)Excellent Logical and Analytical SkillAttention to detailTime Management and ProfessionalismExperience with technologies listed in previous sectionReporting and MetricsOn-time task completion percentageTeam Leader and ManagerApply InstructionsBenefits:Working in a team environment where initiative and dedication is encouragedAn equal opportunity workplace that values diversity and does not discriminateHigh level of responsibility with opportunities to learn and growAttractive salary based on experience and qualificationsAnnual Performance Appraisal SystemFestival expense allowanceInterested candidates can send their Updated Resume and cover letter tocareer@classic.com.np. Candidates are requested to clearly specify thePosition & Locationthat they are applying for.", "Page_URL": "https://www.ramrojob.com/project-manager-software-1", "websitename": "ramrojob.com"}, {"name": "IT Assistant", "company": "Advance Group of Companies", "level": "Entry Level", "vacancy": "1", "time": "Full Time", "address": "Rolpa", "salary": "As Per Organization's Rule", "deadline": "2020-12-14", "desct": "Job DescriptionInstall and configure computer hardware operating systems and applications.Monitor and maintain computer system and networks.Troubleshoot system and network problems,diagnosing and solving hardware or software faults.Replace parts as required.Provide support,including procedural documentation and relevant reports.Follow diagrams and written instructions tp repair a fault or set up a system.Support the roll-out of new applications.Set up  new users account and profiles and deal with password issue.Conduct electrical safety checks on computer equipments.Apply InstructionsInterested candidates are requested to send their CV at vacancy@advancegroup.com.np within 10 days of advertisement published.", "Page_URL": "https://www.ramrojob.com/it-assistant-45", "websitename": "ramrojob.com"}, {"name": "Graphics DesignerMid Level", "company": "Sharda Group", "level": "Mid Level", "vacancy": "02", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "2020-12-31", "desct": "Job DescriptionMeet with clients or the art director to determine the scope of a marketing campaignUse digital illustration, photo editing software, and layout software to create designsCreate visual elements such as logos, original images, and illustrations that help deliver a desired messageDesign layouts and select colors, images, and typefaces to usePresent design concepts to clients or art directorsIncorporate changes recommended by clients or art directors into final designsReview designs for errors before printing or publishing themCreating design and developing concept as per the requirement.Coordination with marketing department for timely preparation of design as per requirement.Coordinating with agency for various branding activities and designsHoarding Board placement and review on regular basisRecording of vendors bills and timely forwarding, follow-up for paymentJob SpecificationShould have good knowledge of Graphic designingMinimum 1 years’ experience in a marketing/advertising agency/event management would be given PriorityShould have strong English and Nepali communication skillsShould be a team Player, because we work collaborativelypreferred knowledge with Corel Draw, Motion Graphics and After Effects but now mandatoryApply InstructionsInterested Candidates may send their resume at    hratfabcgbl@gmail.com", "Page_URL": "https://www.ramrojob.com/graphics-designer-11", "websitename": "ramrojob.com"}, {"name": "Graphics DesignerMid Level", "company": "Asian Thai Foods", "level": "Mid Level", "vacancy": "02", "time": "Full Time", "address": "Kathmandu", "salary": "Negotiable", "deadline": "2020-12-31", "desct": "Job DescriptionMeet with clients or the art director to determine the scope of a marketing campaignUse digital illustration, photo editing software, and layout software to create designsCreate visual elements such as logos, original images, and illustrations that help deliver a desired messageDesign layouts and select colors, images, and typefaces to usePresent design concepts to clients or art directorsIncorporate changes recommended by clients or art directors into final designsReview designs for errors before printing or publishing themCreating design and developing concept as per the requirement.Coordination with marketing department for timely preparation of design as per requirement.Coordinating with agency for various branding activities and designsHoarding Board placement and review on regular basisRecording of vendors bills and timely forwarding, follow-up for paymentJob SpecificationShould have good knowledge of Graphic designingMinimum 1 years’ experience in a marketing/advertising agency/event management would be given PriorityShould have strong English and Nepali communication skillsShould be a team Player, because we work collaborativelypreferred knowledge with Corel Draw, Motion Graphics and After Effects but now mandatoryApply InstructionsInterested Candidates may send their resume at      hratfabcgbl@gmail.com", "Page_URL": "https://www.ramrojob.com/graphics-designer-12", "websitename": "ramrojob.com"}, {"name": "Quality Assurance Automation Engineer", "company": "Reputed IT Company (US)", "level": "", "vacancy": "4", "time": "Full Time", "address": "Nepal", "salary": "Negotiable", "deadline": "2020-12-16", "desct": "Job DescriptionQuality Assurance Automation EngineerCategory:senior &  juniorJob Level:Senior Level & Mid levelNo. of Vacancy/s: 4Employment Type:Full TimeOffered Salary:NegotiableUS Based company makes it easy for legal and investigative teams to rapidly uncover the most important information in the most complex of cases. With its lightning fast processing, AI-powered technology assisted review (TAR/CAL), deep analytics, and cloud and hybrid delivery, US Based company provides everything you need to handle more cases with greater speed, accuracy, and predictability in a single cost-efficient platform.Join us as we build disruptive products, a world class team and an inclusive culture of passionate people who love our customers, products, and vision. At  Systems, we are always looking for exceptional folks who seek to deliver their best every day and in every situation because  we're committed to our customers and will stop at nothing to delight them while having fun and helping each other realize our full potential.Role:The Product Development team at US Based company  is looking for a senior Quality Assurance Automation Engineer to help build great products that will make the eDiscovery process quick and easy for our customers.If you are data driven, passionate about building great software and want to join a team of highly talented and innovative people who are building the next generation of eDiscovery products for Legal Service Providers, Law Firms, Government Agencies and Corporates, you will love working with us. You will get to work with a super smart bunch of folks who are doing state of the art work, designing, developing and implementing highly sophisticated technologies including machine learning, cloud, and data analytics.You will collaborate with cross-functional teams while receiving mentorship from your management and colleagues. We will support your growth and career development while empowering you for a successful future.Responsibilities:Work closely with the developers, product management and devops in your Scrum teamBecome the quality advocate inside the scrum team and coach manual testersDevelop and maintain smoke, performance, functional, security, and regression tests to ensure code is functioning as designed.Building a test harness for cloud and on-premise environmentCollaborate and participate in sprint planning and retrospectivesProactively design tests from the user stories and dev tasksQualifications:A bachelor's degree in Computer Science, Engineering or related fieldAt least 5 years of hands-on experience with QA and performance automation software including  Selenium, JMeter, Katalon, NUnit or  any other unit testing framework.A deep understanding of automation frameworks, platforms and designsDeep expertise with Blackbox and Whitebox testingAdvanced skills designing and running headless tests in an automated CI/CD environmentAbility to script automated API testsProven Experience with Continuous Integration & Continuous Delivery (CI/CD) practices with Gitlab and TeamCityAbility to code in Javascript, Angular, C# and MS SQL Server is highly desirable.Experience with AWS platform or similar cloud services will be a huge plusExperience working in Agile/Scrum teamsFamiliarity with TDD will be nice to haveUS Based company  values diversity and leadership at all levels. We don’t create or believe in hierarchies and value everybody’s opinions, equally and without any bias. We guarantee that all qualified applicants will be considered for employment without regard to national origin, color, race, religion,sexual orientation, gender identity, sex, or any other applicable legally protected characteristics in the location in which the candidate is applying.Apply InstructionsInterested and qualified candidates are requested to send their application online or send it tojobnepal2019@gmail.com.The candidates are requested to mention the position they are applying for in the subject line of the email.", "Page_URL": "https://www.ramrojob.com/quality-assurance-automation-engineer", "websitename": "ramrojob.com"}, {"name": "Call Center Assistant", "company": "Websurfer Communications Pvt. Ltd", "level": "Entry Level", "vacancy": "20", "time": "Part Time", "address": "Kathmandu", "salary": "", "deadline": "2020-12-18", "desct": "Job DescriptionHandling visitor's callCustomer care and disbursement of calls accordinglyEffective communication skillApply Instructionshumanresourcesmanager1234@gmail.com", "Page_URL": "https://www.ramrojob.com/call-center-assistant", "websitename": "ramrojob.com"}]